{
  "sources": [
    {
      "title": "CSS-Tricks",
      "feedUrl": "https://css-tricks.com/feed/",
      "siteUrl": "https://css-tricks.com",
      "articles": [
        {
          "id": "https://css-tricks.com/?p=344273",
          "author": "Georgi Nikoloff",
          "description": "Dynamically scaling CSS values based on the viewport width is hardly a new topic. You can find plenty of in-depth coverage right here on CSS-Tricks in articles like this one or this one.\nMost of those examples, though, use …\nThe post How to Get a Pixel-Perfect, Linearly Scaled UI appeared first on CSS-Tricks. You can support CSS-Tricks by being an MVP Supporter.",
          "link": "https://css-tricks.com/how-to-get-a-pixel-perfect-linearly-scaled-ui/",
          "publishedOn": "2021-07-15T14:40:03.000Z",
          "wordCount": 1780,
          "title": "How to Get a Pixel-Perfect, Linearly Scaled UI"
        },
        {
          "id": "https://css-tricks.com/?p=344249",
          "author": "Temani Afif",
          "description": "I recently illustrated how we can achieve complex CSS animations using cubic-bezier() and how to do the same when it comes to CSS transitions. I was able to create complex hover effect without resorting to keyframes. In this article, I …\nThe post Build Complex CSS Transitions using Custom Properties and cubic-bezier() appeared first on CSS-Tricks. You can support CSS-Tricks by being an MVP Supporter.",
          "link": "https://css-tricks.com/build-complex-css-transitions-using-custom-properties-and-cubic-bezier/",
          "publishedOn": "2021-07-14T14:31:02.000Z",
          "wordCount": 1964,
          "title": "Build Complex CSS Transitions using Custom Properties and cubic-bezier()"
        },
        {
          "id": "https://css-tricks.com/?p=344407",
          "author": "Chris Coyier",
          "description": "Most of us grumble when running across a frustrating UX experience online (like not being able to complete a transaction because of a misplaced button). We might pen a whiny tweet. Jason Grigsby is like I’m going to write 2,000 …\nThe post A Bashful Button Worth $8 Million appeared first on CSS-Tricks. You can support CSS-Tricks by being an MVP Supporter.",
          "link": "https://cloudfour.com/thinks/a-bashful-button-worth-8-million/",
          "publishedOn": "2021-07-14T14:25:08.000Z",
          "wordCount": 2461,
          "title": "A Bashful Button Worth $8 Million"
        },
        {
          "id": "https://css-tricks.com/?p=344316",
          "author": "Chris Coyier",
          "description": "As a day-job, React-using person, I like to stay abreast of interesting React news. As such, I save a healthy amount of links. Allow me to dump out my latest pile. Most of this is about React but not all …\nThe post Links on React and JavaScript appeared first on CSS-Tricks. You can support CSS-Tricks by being an MVP Supporter.",
          "link": "https://css-tricks.com/links-on-react-and-javascript/",
          "publishedOn": "2021-07-13T19:57:10.000Z",
          "wordCount": 1003,
          "title": "Links on React and JavaScript"
        },
        {
          "id": "https://css-tricks.com/?p=343850",
          "author": "Manuel Matuzovic",
          "description": "Starting with Version 15, Safari supports the theme-color <meta> tag both on macOS and iOS. That’s exciting news because now the first desktop browser supports this <meta> tag and it also supports the media attribute and the prefers-color-scheme media feature.…\nThe post Meta Theme Color and Trickery appeared first on CSS-Tricks. You can support CSS-Tricks by being an MVP Supporter.",
          "link": "https://css-tricks.com/meta-theme-color-and-trickery/",
          "publishedOn": "2021-07-13T14:58:33.000Z",
          "wordCount": 2597,
          "title": "Meta Theme Color and Trickery"
        },
        {
          "id": "https://css-tricks.com/?p=344542",
          "author": "Geoff Graham",
          "description": "(This is a sponsored post.)\nThe folks over at Netlify have opened up the Jamstack Community Survey for 2021. More than 3,000 front-enders like yourself took last year’s survey, which gauged how familiar people are with the …\nThe post Jamstack Community Survey 2021 appeared first on CSS-Tricks. You can support CSS-Tricks by being an MVP Supporter.",
          "link": "https://www.surveymonkey.com/r/jamstack-survey-css-tricks",
          "publishedOn": "2021-07-13T14:34:48.000Z",
          "wordCount": 142,
          "title": "Jamstack Community Survey 2021"
        },
        {
          "id": "https://css-tricks.com/?p=344355",
          "author": "Chris Coyier",
          "description": "The reasons that are often cited that make container queries difficult or impossible is things like infinite loops—e.g. changing the width of an element, invalidating a container query, which changes the width again, which makes the container query take effect, …\nThe post Meet `:has`, A Native CSS Parent Selector appeared first on CSS-Tricks. You can support CSS-Tricks by being an MVP Supporter.",
          "link": "https://www.smashingmagazine.com/2021/06/has-native-css-parent-selector/",
          "publishedOn": "2021-07-12T19:45:00.000Z",
          "wordCount": 2791,
          "title": "Meet `:has`, A Native CSS Parent Selector"
        },
        {
          "id": "https://css-tricks.com/?p=343613",
          "author": "Mojtaba Seyedi",
          "description": "I don’t know about you, but I write these three declarations many times in my CSS:\nul {\n  padding: 0;\n  margin: 0;\n  list-style-type: none;\n}\nYou might yell at me and say I can just put those in my CSS …\nThe post Using the Specificity of :where() as a CSS Reset appeared first on CSS-Tricks. You can support CSS-Tricks by being an MVP Supporter.",
          "link": "https://css-tricks.com/using-the-specificity-of-where-as-a-css-reset/",
          "publishedOn": "2021-07-12T14:30:34.000Z",
          "wordCount": 855,
          "title": "Using the Specificity of :where() as a CSS Reset"
        },
        {
          "id": "https://css-tricks.com/?p=344334",
          "author": "Chris Coyier",
          "description": "This is a nice update from Manuel Rego Casasnovas. Igalia has this idea to sort of crowd-source important web platform features that need to get worked on (that’s the sort of work they do). They call it Open Prioritization. …\nThe post :focus-visible in WebKit appeared first on CSS-Tricks. You can support CSS-Tricks by being an MVP Supporter.",
          "link": "https://blogs.igalia.com/mrego/2021/06/07/focus-visible-in-webkit-may-2021/",
          "publishedOn": "2021-07-09T18:53:51.000Z",
          "wordCount": 1281,
          "title": ":focus-visible in WebKit"
        },
        {
          "id": "https://css-tricks.com/?p=343598",
          "author": "Philippe Bernard",
          "description": "Ever heard of favicons made with SVG? If you are a regular reader of CSS-Tricks, you probably have. But does your website actually use one?\nThe task is more non-trivial than you might think. As we will see in this …\nThe post SVG Favicons in Action appeared first on CSS-Tricks. You can support CSS-Tricks by being an MVP Supporter.",
          "link": "https://css-tricks.com/svg-favicons-in-action/",
          "publishedOn": "2021-07-09T14:31:57.000Z",
          "wordCount": 2079,
          "title": "SVG Favicons in Action"
        },
        {
          "id": "https://css-tricks.com/?p=344024",
          "author": "Chris Coyier",
          "description": "Wes has a heck of a set of “notes” for learning JavaScript. It’s organized like a curriculum, meaning if you teach JavaScript, you could do a lot worse. It’s actually more like 85 really fleshed-out blog posts organized into sections …\nThe post Beginner JavaScript Notes appeared first on CSS-Tricks. You can support CSS-Tricks by being an MVP Supporter.",
          "link": "https://wesbos.com/javascript",
          "publishedOn": "2021-07-08T22:25:22.000Z",
          "wordCount": 700,
          "title": "Beginner JavaScript Notes"
        },
        {
          "id": "https://css-tricks.com/?p=343623",
          "author": "Amit Sheen",
          "description": "The wonderful company I work for, Payoneer, has a new logo, and my job was to recreate it and animate it for a loader component in our app. I’ll explain exactly how I did it, share the problems I …\nThe post My Struggle to Use and Animate a Conic Gradient in SVG appeared first on CSS-Tricks. You can support CSS-Tricks by being an MVP Supporter.",
          "link": "https://css-tricks.com/my-struggle-to-use-and-animate-a-conic-gradient-in-svg/",
          "publishedOn": "2021-07-08T14:35:38.000Z",
          "wordCount": 1712,
          "title": "My Struggle to Use and Animate a Conic Gradient in SVG"
        },
        {
          "id": "https://css-tricks.com/?p=343574",
          "author": "Fortune Ikechi",
          "description": "Command line tools are one of the most popular applications we have today. We use command line tools every day, and they range from git, npm or yarn. Command line tools are very fast and useful for automating applications and …\nThe post Building a Command Line Tool with Nodejs and Fauna appeared first on CSS-Tricks. You can support CSS-Tricks by being an MVP Supporter.",
          "link": "https://css-tricks.com/building-a-command-line-tool-with-nodejs-and-fauna/",
          "publishedOn": "2021-07-08T14:35:09.000Z",
          "wordCount": 1131,
          "title": "Building a Command Line Tool with Nodejs and Fauna"
        },
        {
          "id": "https://css-tricks.com/?p=343495",
          "author": "Chris Coyier",
          "description": "Astro is a brand new framework for building websites. To me, the big thing is that it allows you to build a site like you’re using a JavaScript framework (and you are), but the output is a zero-JavaScript static site. …\nThe post A Look at Building with Astro appeared first on CSS-Tricks. You can support CSS-Tricks by being an MVP Supporter.",
          "link": "https://css-tricks.com/a-look-at-building-with-astro/",
          "publishedOn": "2021-07-07T21:06:35.000Z",
          "wordCount": 2391,
          "title": "A Look at Building with Astro"
        },
        {
          "id": "https://css-tricks.com/?p=343388",
          "author": "Robin Rendle",
          "description": "There are a lot of great defaults when it comes to browsers and the web. Think about all the accessibility features that are baked into HTML so that you don’t have to do weird stuff, like this example from Manuel…\nThe post The Web’s Worst Default appeared first on CSS-Tricks. You can support CSS-Tricks by being an MVP Supporter.",
          "link": "https://css-tricks.com/the-webs-worst-default/",
          "publishedOn": "2021-07-07T14:30:34.000Z",
          "wordCount": 1322,
          "title": "The Web’s Worst Default"
        },
        {
          "id": "https://css-tricks.com/?p=343438",
          "author": "Chris Coyier",
          "description": "I appreciate the clarity of this trick that Mikael Ainalem posted over on Reddit:\nIt’s a one-liner that toggles the class on the <body> so you can mock up different states and toggle between them on click.\n<body onclick=\"this.classList.toggle(\"active\");\"\nCould …\nThe post Body Toggle appeared first on CSS-Tricks. You can support CSS-Tricks by being an MVP Supporter.",
          "link": "https://css-tricks.com/body-toggle/",
          "publishedOn": "2021-07-06T20:55:45.000Z",
          "wordCount": 385,
          "title": "Body Toggle"
        },
        {
          "id": "https://css-tricks.com/?p=343560",
          "author": "Chris Coyier",
          "description": "And maybe an optional follow-up if you’re up for it.\nAutomattic, the makers of Jetpack and many other WordPress-y things, have sponsored my site (me = Chris Coyier; site = CSS-Tricks) for quite a while. I use Jetpack myself, …\nThe post I’ve got one question about Jetpack for you. appeared first on CSS-Tricks. You can support CSS-Tricks by being an MVP Supporter.",
          "link": "https://css-tricks.com/ive-got-one-question-about-jetpack-for-you/",
          "publishedOn": "2021-07-06T20:00:30.000Z",
          "wordCount": 391,
          "title": "I’ve got one question about Jetpack for you."
        },
        {
          "id": "https://css-tricks.com/?p=343149",
          "author": "Martin Lexelius",
          "description": "Normally, a project will have a set of pre-determined font sizes, usually as variables named in such a way that seeks some semblance of order and consistency. Any project of considerable size can use something like that. There are always …\nThe post The Dilemma of Naming Font Size Variables appeared first on CSS-Tricks. You can support CSS-Tricks by being an MVP Supporter.",
          "link": "https://css-tricks.com/the-dilemma-of-naming-font-size-variables/",
          "publishedOn": "2021-07-06T14:41:22.000Z",
          "wordCount": 2452,
          "title": "The Dilemma of Naming Font Size Variables"
        },
        {
          "id": "https://css-tricks.com/?p=343166",
          "author": "Lari Maza",
          "description": "If you zone out every time someone mentions “Kubernetes,” “containers,” or “pods,” this article is for you. No complex diagrams involved!\nAs a front-end developer, you don’t have to know how to configure an infrastructure from scratch. However, if you …\nThe post Kubernetes Explained Simply: Containers, Pods and Images appeared first on CSS-Tricks. You can support CSS-Tricks by being an MVP Supporter.",
          "link": "https://css-tricks.com/kubernetes-explained-simply-containers-pods-and-images/",
          "publishedOn": "2021-07-05T14:17:33.000Z",
          "wordCount": 1113,
          "title": "Kubernetes Explained Simply: Containers, Pods and Images"
        },
        {
          "id": "https://css-tricks.com/?p=343671",
          "author": "Chris Coyier",
          "description": "Web design is such a rectangle-based design medium that literally any deviation from it feels fresh. Michelle Barker gets into using math in various ways to programmatically draw lines, shapes, and animations that end up looking both beautiful and have …\nThe post Trigonometry in CSS and JavaScript: Beyond Triangles appeared first on CSS-Tricks. You can support CSS-Tricks by being an MVP Supporter.",
          "link": "https://tympanus.net/codrops/2021/06/04/trigonometry-in-css-and-javascript-beyond-triangles/",
          "publishedOn": "2021-07-05T14:15:20.000Z",
          "wordCount": 2662,
          "title": "Trigonometry in CSS and JavaScript: Beyond Triangles"
        },
        {
          "id": "https://css-tricks.com/?p=343496",
          "author": "Chris Coyier",
          "description": "It’s CSS-Tricks birthday! Somehow that keeps coming around every year. It’s that time where I reflect upon that past year. It’s like the annual vibe check. \nI’m writing this just days after my current home state of Oregon has …\nThe post The Fourteenth Fourth appeared first on CSS-Tricks. You can support CSS-Tricks by being an MVP Supporter.",
          "link": "https://css-tricks.com/the-fourteenth-fourth/",
          "publishedOn": "2021-07-04T13:29:01.000Z",
          "wordCount": 1842,
          "title": "The Fourteenth Fourth"
        },
        {
          "id": "https://css-tricks.com/?p=343435",
          "author": "Chris Coyier",
          "description": "The name zero-width space is antithetical, but it’s not without uses. In text, maybe you’d use it around slashes because you want to be sure the words are treated individually but not have any physical space around the slash:…\nThe post Zero-Width Space appeared first on CSS-Tricks. You can support CSS-Tricks by being an MVP Supporter.",
          "link": "https://css-tricks.com/zero-width-space/",
          "publishedOn": "2021-07-02T20:39:04.000Z",
          "wordCount": 763,
          "title": "Zero-Width Space"
        },
        {
          "id": "https://css-tricks.com/?p=342995",
          "author": "Sarah Drasner",
          "description": "Like it or not, meetings are essential to a good working environment and communication. Therefore, it’s crucial that we work on making them as productive as possible. Today we’ll explore myriad ways to keep meetings coordinated, well documented, and talk …\nThe post Good Meetings appeared first on CSS-Tricks. You can support CSS-Tricks by being an MVP Supporter.",
          "link": "https://css-tricks.com/good-meetings/",
          "publishedOn": "2021-07-02T14:41:26.000Z",
          "wordCount": 3441,
          "title": "Good Meetings"
        },
        {
          "id": "https://css-tricks.com/?p=342994",
          "author": "Chris Coyier",
          "description": "This is a super niche blog post. But it’s been on my list forever to write down because this caused me grief for far too long.\nThe setup is that you can use WooCommerce to sell things on a WordPress …\nThe post The Trick to Enable Printify Shipping Notifications for Orders in WooCommerce? Customer Notes. appeared first on CSS-Tricks. You can support CSS-Tricks by being an MVP Supporter.",
          "link": "https://css-tricks.com/the-trick-to-enable-printify-shipping-notifications-for-orders-in-woocommerce-customer-notes/",
          "publishedOn": "2021-07-02T00:02:51.000Z",
          "wordCount": 1151,
          "title": "The Trick to Enable Printify Shipping Notifications for Orders in WooCommerce? Customer Notes."
        },
        {
          "id": "https://css-tricks.com/?p=343637",
          "author": "Chris Coyier",
          "description": "The marketing for Core Web Vitals (CWV) has been a massive success. I guess that’s what happens when the world’s dominant search engine tells people that something’s going to be an SEO factor. Ya know what language can play a …\nThe post CSS for Web Vitals appeared first on CSS-Tricks. You can support CSS-Tricks by being an MVP Supporter.",
          "link": "https://web.dev/css-web-vitals/",
          "publishedOn": "2021-07-01T18:54:45.000Z",
          "wordCount": 1639,
          "title": "CSS for Web Vitals"
        },
        {
          "id": "https://css-tricks.com/?p=342591",
          "author": "Chris Coyier",
          "description": "This is new stuff from DO.\nApp Platform is a hosting product, no surprise there, but it has some features that are Jamstack-inspired in the best possible way, and an additional set of unique and powerful features. Let’s start with …\nThe post App Platform on Digital Ocean appeared first on CSS-Tricks. You can support CSS-Tricks by being an MVP Supporter.",
          "link": "https://css-tricks.com/app-platform-on-digital-ocean/",
          "publishedOn": "2021-07-01T18:54:12.000Z",
          "wordCount": 953,
          "title": "App Platform on Digital Ocean"
        },
        {
          "id": "https://css-tricks.com/?p=343092",
          "author": "Cassidy Williams",
          "description": "If you’re anything like me, you like being lazy shortcuts. The “Deploy to Netlify” button allows me to take this lovely feature of my personality and be productive with it.\n\nClicking the button above lets me (or you!) instantly …\nThe post Hack the “Deploy to Netlify” Button Using Environment Variables to Make a Customizable Site Generator appeared first on CSS-Tricks. You can support CSS-Tricks by being an MVP Supporter.",
          "link": "https://css-tricks.com/hack-the-deploy-to-netlify-button-using-environment-variables-to-make-a-customizable-site-generator/",
          "publishedOn": "2021-07-01T14:40:14.000Z",
          "wordCount": 1576,
          "title": "Hack the “Deploy to Netlify” Button Using Environment Variables to Make a Customizable Site Generator"
        },
        {
          "id": "https://css-tricks.com/?p=343224",
          "author": "Chris Coyier",
          "description": "I got this exact question in an email the other day, and I thought it would make a nice blog post because of how wonderfully satisfying this is to do in CSS these days. Plus we can sprinkle in polish …\nThe post How do you make a layout with pictures down one side of a page matched up with paragraphs on the other side? appeared first on CSS-Tricks. You can support CSS-Tricks by being an MVP Supporter.",
          "link": "https://css-tricks.com/how-do-you-make-a-layout-with-pictures-down-one-side-of-a-page-matched-up-with-paragraphs-on-the-other-side/",
          "publishedOn": "2021-06-30T20:36:52.000Z",
          "wordCount": 645,
          "title": "How do you make a layout with pictures down one side of a page matched up with paragraphs on the other side?"
        },
        {
          "id": "https://css-tricks.com/?p=343064",
          "author": "Travis Almand",
          "description": "The click event is quite simple and easy to use; you listen for the event and run code when the event is fired. It works on just about every HTML element there is, a core feature of the DOM API.…\nThe post When a Click is Not Just a Click appeared first on CSS-Tricks. You can support CSS-Tricks by being an MVP Supporter.",
          "link": "https://css-tricks.com/when-a-click-is-not-just-a-click/",
          "publishedOn": "2021-06-30T14:45:42.000Z",
          "wordCount": 4397,
          "title": "When a Click is Not Just a Click"
        },
        {
          "id": "https://css-tricks.com/?p=343182",
          "author": "Chris Coyier",
          "description": "I was working on a bug ticket the other day where it was reported that an icon was sitting low in a button. Just not aligned like it should be. I had to go on a little journey to figure …\nThe post Fixing a Bug in Low-Resolution Mode appeared first on CSS-Tricks. You can support CSS-Tricks by being an MVP Supporter.",
          "link": "https://css-tricks.com/fixing-a-bug-in-low-resolution-mode/",
          "publishedOn": "2021-06-30T14:44:54.000Z",
          "wordCount": 725,
          "title": "Fixing a Bug in Low-Resolution Mode"
        },
        {
          "id": "https://css-tricks.com/?p=343470",
          "author": "Chris Coyier",
          "description": "I use this line, or one like it, in a lot of quick demos. Not that it’s not a production-worthy line of code—I just tend to be a bit more explicit on bigger projects. \nhtml {\n  font: 110%/1.4 system-ui;\n}\n…\nThe post What does `font: 110%/1.4 system-ui` mean? appeared first on CSS-Tricks. You can support CSS-Tricks by being an MVP Supporter.",
          "link": "https://css-tricks.com/what-does-font-110-1-4-system-ui-mean/",
          "publishedOn": "2021-06-29T22:43:50.000Z",
          "wordCount": 672,
          "title": "What does `font: 110%/1.4 system-ui` mean?"
        },
        {
          "id": "https://css-tricks.com/?p=343260",
          "author": "Chris Coyier",
          "description": "Delan Azabani digs into the (hopefully) coming soon ::spelling-error and ::grammar-error pseudo selectors in CSS. Design control is always nice. Hey, if we can style scrollbars and style selected text, why not this?\nThe squiggly lines that indicate possible spelling or grammar errors \n…\nThe post Chromium spelling and grammar features appeared first on CSS-Tricks. You can support CSS-Tricks by being an MVP Supporter.",
          "link": "https://www.azabani.com/2021/05/17/spelling-grammar.html",
          "publishedOn": "2021-06-29T20:25:00.000Z",
          "wordCount": 3316,
          "title": "Chromium spelling and grammar features"
        },
        {
          "id": "https://css-tricks.com/?p=342736",
          "author": "Chris Coyier",
          "description": "I needed to select some elements between two fixed indexes the other day — like literally the second through fifth elements. Ironically, I have a whole post on “Useful :nth-child Recipes” but this wasn’t one of them. \nThe answer, it …\nThe post :nth-child Between Two Fixed Indexes appeared first on CSS-Tricks. You can support CSS-Tricks by being an MVP Supporter.",
          "link": "https://css-tricks.com/nth-child-between-two-fixed-indexes/",
          "publishedOn": "2021-06-29T14:37:21.000Z",
          "wordCount": 747,
          "title": ":nth-child Between Two Fixed Indexes"
        },
        {
          "id": "https://css-tricks.com/?p=343040",
          "author": "Chris Coyier",
          "description": "I think we’re all largely aware of named colors in CSS:\ncolor: OldLace;\nbackground: rebeccapurple;\nI guess you’d just call those “named colors” in CSS. \nThose aren’t the only kind of named colors there are though. Some of them …\nThe post System *Things appeared first on CSS-Tricks. You can support CSS-Tricks by being an MVP Supporter.",
          "link": "https://css-tricks.com/system-things/",
          "publishedOn": "2021-06-28T22:14:22.000Z",
          "wordCount": 959,
          "title": "System *Things"
        },
        {
          "id": "https://css-tricks.com/?p=343139",
          "author": "Chris Coyier",
          "description": "Sara digs into a bug I happened to have mentioned back in 2012 where fluid type didn’t resize when the browser window resized. Back then, it affected Chrome 20 and Safari 6, but the bug still persists today in Safari …\nThe post Working around the viewport-based fluid typography bug in Safari appeared first on CSS-Tricks. You can support CSS-Tricks by being an MVP Supporter.",
          "link": "https://www.sarasoueidan.com/blog/safari-fluid-typography-bug-fix/",
          "publishedOn": "2021-06-28T21:17:26.000Z",
          "wordCount": 937,
          "title": "Working around the viewport-based fluid typography bug in Safari"
        },
        {
          "id": "https://css-tricks.com/?p=342971",
          "author": "Ryan Mulligan",
          "description": "Not news to any web developer in 2021: CSS Grid is an incredibly powerful tool for creating complex, distinct two-dimensional modern web layouts.\nRecently, I have been experimenting with CSS Grid and alignment properties to create component layouts that …\nThe post Positioning Overlay Content with CSS Grid appeared first on CSS-Tricks. You can support CSS-Tricks by being an MVP Supporter.",
          "link": "https://css-tricks.com/positioning-overlay-content-with-css-grid/",
          "publishedOn": "2021-06-28T14:25:33.000Z",
          "wordCount": 2338,
          "title": "Positioning Overlay Content with CSS Grid"
        },
        {
          "id": "https://css-tricks.com/?p=343072",
          "author": "Chris Coyier",
          "description": "To make some terminology clear here:\nCMS = Content Management System\nCRM = Customer Relationship Management\nBoth are essentially database-backed systems for managing data. HubSpot is both, and much more. Where a CMS might be very focused on content and …\nThe post Scaling Organizations Should Consider Building a Website Backed by a CRM Platform appeared first on CSS-Tricks. You can support CSS-Tricks by being an MVP Supporter.",
          "link": "https://css-tricks.com/scaling-organizations-should-consider-building-a-website-backed-by-a-crm-platform/",
          "publishedOn": "2021-06-28T13:29:00.000Z",
          "wordCount": 738,
          "title": "Scaling Organizations Should Consider Building a Website Backed by a CRM Platform"
        },
        {
          "id": "https://css-tricks.com/?p=342718",
          "author": "Chris Coyier",
          "description": "I am part of that 82% that got the answer to Lea Verou's quiz wrong. Stephen Shaw posted a similar quiz as well and it's a fun exercise sharpen your CSS chops.\nThe post Custom Property Brain Twisters appeared first on CSS-Tricks. You can support CSS-Tricks by being an MVP Supporter.",
          "link": "https://css-tricks.com/custom-property-brain-twisters/",
          "publishedOn": "2021-06-25T18:39:46.000Z",
          "wordCount": 652,
          "title": "Custom Property Brain Twisters"
        },
        {
          "id": "https://css-tricks.com/?p=342911",
          "author": "Georgi Nikoloff",
          "description": "I recently had to create a widget in React that fetches data from multiple API endpoints. As the user clicks around, new data is fetched and marshalled into the UI. But it caused some problems.\nOne problem quickly became evident: …\nThe post How to Cancel Pending API Requests to Show Correct Data appeared first on CSS-Tricks. You can support CSS-Tricks by being an MVP Supporter.",
          "link": "https://css-tricks.com/how-to-cancel-pending-api-requests-to-show-correct-data/",
          "publishedOn": "2021-06-25T14:33:33.000Z",
          "wordCount": 993,
          "title": "How to Cancel Pending API Requests to Show Correct Data"
        },
        {
          "id": "https://css-tricks.com/?p=342818",
          "author": "Jay Hoffmann",
          "description": "In April of 2009, Yahoo! shut down GeoCities. Practically overnight, the once beloved service had its signup page replaced with a vague message announcing its closure.\nWe have decided to discontinue the process of allowing new customers to sign up \n…\nThe post Chapter 9: Community appeared first on CSS-Tricks. You can support CSS-Tricks by being an MVP Supporter.",
          "link": "https://css-tricks.com/chapter-9-community/",
          "publishedOn": "2021-06-24T14:30:11.000Z",
          "wordCount": 6342,
          "title": "Chapter 9: Community"
        },
        {
          "id": "https://css-tricks.com/?p=343076",
          "author": "Chris Coyier",
          "description": "When I blogged “Making Tables With Sticky Header and Footers Got a Bit Easier” recently, I mentioned that the “stickiness” improvement was just one of the features that got better for <table>s in Chrome as part of the TablesNG upgrade…\nThe post TablesNG — Improvements to table rendering in Chromium appeared first on CSS-Tricks. You can support CSS-Tricks by being an MVP Supporter.",
          "link": "https://www.bram.us/2021/06/21/tablesng-improvements-to-table-rendering-in-chromium/",
          "publishedOn": "2021-06-23T21:37:14.000Z",
          "wordCount": 1325,
          "title": "TablesNG — Improvements to table rendering in Chromium"
        },
        {
          "id": "https://css-tricks.com/?p=342750",
          "author": "Ollie Williams",
          "description": "The CSS image-set() function has been supported in Chromium-based browsers since 2012 and in Safari since version 6. Support recently landed in Firefox 88. Let’s dive in and see what we can and can’t do today with image-set().…\nThe post Using Performant Next-Gen Images in CSS with image-set appeared first on CSS-Tricks. You can support CSS-Tricks by being an MVP Supporter.",
          "link": "https://css-tricks.com/using-performant-next-gen-images-in-css-with-image-set/",
          "publishedOn": "2021-06-23T19:10:54.000Z",
          "wordCount": 1244,
          "title": "Using Performant Next-Gen Images in CSS with image-set"
        },
        {
          "id": "https://css-tricks.com/?p=342669",
          "author": "Chris Coyier",
          "description": "PPK looks at aspect-ratio, a CSS property for layout that, for the most part, does exactly what you would think it does. It’s getting more interesting as it’s behind a flag in Firefox and Safari now, so we’ll have …\nThe post “Weak declaration” appeared first on CSS-Tricks. You can support CSS-Tricks by being an MVP Supporter.",
          "link": "https://css-tricks.com/weak-declaration/",
          "publishedOn": "2021-06-23T14:27:14.000Z",
          "wordCount": 629,
          "title": "“Weak declaration”"
        },
        {
          "id": "https://css-tricks.com/?p=342930",
          "author": "Chris Coyier",
          "description": "There are four keywords that are valid values for any CSS property (see the title). Of those, day to day, I’d say I see the inherit used the most. Perhaps because it’s been around the longest (I think?) but also …\nThe post inherit, initial, unset, revert appeared first on CSS-Tricks. You can support CSS-Tricks by being an MVP Supporter.",
          "link": "https://css-tricks.com/inherit-initial-unset-revert/",
          "publishedOn": "2021-06-22T21:20:20.000Z",
          "wordCount": 687,
          "title": "inherit, initial, unset, revert"
        },
        {
          "id": "https://css-tricks.com/?p=342634",
          "author": "Geoff Rich",
          "description": "Svelte fully supports custom elements (e.g. <my-component>) without any custom configuration or wrapper components and has a perfect score on Custom Elements Everywhere. However, there are still a few quirks you need to watch out for, especially around …\nThe post Using Custom Elements in Svelte appeared first on CSS-Tricks. You can support CSS-Tricks by being an MVP Supporter.",
          "link": "https://css-tricks.com/using-custom-elements-in-svelte/",
          "publishedOn": "2021-06-22T14:37:50.000Z",
          "wordCount": 3090,
          "title": "Using Custom Elements in Svelte"
        },
        {
          "id": "https://css-tricks.com/?p=342925",
          "author": "Chris Coyier",
          "description": "I’m not here to raise a shield protecting CSS utility frameworks. I don’t even particularly like the approach, myself, and nothing is above fair criticism. But fair is a key word there. I can’t tell you how many times I’ve …\nThe post If we’re gonna criticize utility-class frameworks, let’s be fair about it appeared first on CSS-Tricks. You can support CSS-Tricks by being an MVP Supporter.",
          "link": "https://css-tricks.com/if-were-gonna-criticize-utility-class-frameworks-lets-be-fair-about-it/",
          "publishedOn": "2021-06-22T14:33:41.000Z",
          "wordCount": 1497,
          "title": "If we’re gonna criticize utility-class frameworks, let’s be fair about it"
        },
        {
          "id": "https://css-tricks.com/?p=342887",
          "author": "Chris Coyier",
          "description": "Una is calling it the new responsive. A nod to the era we were most certainly in, the era of responsive design. Where responsive design was fluid grids, flexible media, and media queries, the new responsive is those things …\nThe post Are we in a new era of web design? What do we call it? appeared first on CSS-Tricks.\nYou can support CSS-Tricks by being an MVP Supporter.",
          "link": "https://web.dev/new-responsive/",
          "publishedOn": "2021-06-21T21:22:33.000Z",
          "wordCount": 2285,
          "title": "Are we in a new era of web design? What do we call it?"
        },
        {
          "id": "https://css-tricks.com/?p=342448",
          "author": "Preethi",
          "description": "Let’s forego the usual circles and bars we typically see used in charts for more eccentric shapes. With online presentations more and more common today, a quick way to spruce up your web slides and make them stand out is …\nThe post How to Create CSS Charts With Interesting Shapes, Glyphs and Emoji appeared first on CSS-Tricks.\nYou can support CSS-Tricks by being an MVP Supporter.",
          "link": "https://css-tricks.com/how-to-create-css-charts-with-interesting-shapes-glyphs-and-emoji/",
          "publishedOn": "2021-06-21T14:32:45.000Z",
          "wordCount": 1598,
          "title": "How to Create CSS Charts With Interesting Shapes, Glyphs and Emoji"
        },
        {
          "id": "https://css-tricks.com/?p=341511",
          "author": "Carter Li",
          "description": "The outline property in CSS draws a line around the outside of an element. This is quite similar to the border property, the main exception being that outline isn’t a part of the box model. It is often used for …\nThe post Using the `outline` Property as a Collapsable Border appeared first on CSS-Tricks.\nYou can support CSS-Tricks by being an MVP Supporter.",
          "link": "https://css-tricks.com/using-the-outline-property-as-a-collapsable-border/",
          "publishedOn": "2021-06-18T20:38:59.000Z",
          "wordCount": 974,
          "title": "Using the `outline` Property as a Collapsable Border"
        },
        {
          "id": "https://css-tricks.com/?p=342326",
          "author": "Chris Coyier",
          "description": "I studied the fonts of the top 1000 websites. Here’s what I learned. — Michael Li brings the data. San-serif has total dominance. “[…] it is rare to go below 10px or above 24px.” And poor <h5> always being the \n…\nThe post Links on Typography appeared first on CSS-Tricks.\nYou can support CSS-Tricks by being an MVP Supporter.",
          "link": "https://css-tricks.com/links-on-typography-2/",
          "publishedOn": "2021-06-18T13:44:17.000Z",
          "wordCount": 784,
          "title": "Links on Typography"
        },
        {
          "id": "https://css-tricks.com/?p=341948",
          "author": "Louis Hoebregts",
          "description": "Clipping and masking have been around for a while now in CSS and even have pretty decent browser support. I recently worked on a project that needed to use a clipping technique for tooltips showing above links in text.\nThose …\nThe post Perfect Tooltips With CSS Clipping and Masking appeared first on CSS-Tricks.\nYou can support CSS-Tricks by being an MVP Supporter.",
          "link": "https://css-tricks.com/perfect-tooltips-with-css-clipping-and-masking/",
          "publishedOn": "2021-06-17T14:45:57.000Z",
          "wordCount": 1554,
          "title": "Perfect Tooltips With CSS Clipping and Masking"
        },
        {
          "id": "https://css-tricks.com/?p=342257",
          "author": "ImageEngine",
          "description": "Images have become extremely important to the effectiveness of websites. They speak a 1000 words, attract attention, and stimulate emotions.\nHowever, web performance is also a growing problem for most websites. And images are at the heart of many web …\nThe post Start Serving Optimized Images in Vue appeared first on CSS-Tricks.\nYou can support CSS-Tricks by being an MVP Supporter.",
          "link": "https://css-tricks.com/start-serving-optimized-images-in-vue/",
          "publishedOn": "2021-06-17T14:38:42.000Z",
          "wordCount": 1290,
          "title": "Start Serving Optimized Images in Vue"
        },
        {
          "id": "https://css-tricks.com/?p=342358",
          "author": "Chris Coyier",
          "description": "If you’re abhorred by using inline styles, just move that style to the class attribute! And then make sure you have CSS in place that, ya know, does what it says on the box. \nI've revolutionized CSS. pic.twitter.com/1AWCldyCwP\n— Sam \n\n…\nThe post Inline Styles as Classes (lol) appeared first on CSS-Tricks.\nYou can support CSS-Tricks by being an MVP Supporter.",
          "link": "https://css-tricks.com/inline-styles-as-classes-lol/",
          "publishedOn": "2021-06-16T21:11:02.000Z",
          "wordCount": 604,
          "title": "Inline Styles as Classes (lol)"
        },
        {
          "id": "https://css-tricks.com/?p=342630",
          "author": "Chris Coyier",
          "description": "Jim Nielsen: \nIf somebody says a comment isn’t adding any value, I would ask: to whom?\nPersonally, I’ve never liked the advice that writing obvious comments is bad practice—probably because I write obvious comments all the time.\nJim showed …\nThe post Useful and Useless Code Comments appeared first on CSS-Tricks.\nYou can support CSS-Tricks by being an MVP Supporter.",
          "link": "https://blog.jim-nielsen.com/2021/useful-and-usless-code-comments/",
          "publishedOn": "2021-06-16T19:08:33.000Z",
          "wordCount": 869,
          "title": "Useful and Useless Code Comments"
        },
        {
          "id": "https://css-tricks.com/?p=342353",
          "author": "Okiki Ojo",
          "description": "The Web Animations API lets us construct animations and control their playback with JavaScript. The API opens the browser’s animation engine to developers and was designed to underlie implementations of both CSS animations and transitions, leaving the door open to …\nThe post How I Used the WAAPI to Build an Animation Library appeared first on CSS-Tricks.\nYou can support CSS-Tricks by being an MVP Supporter.",
          "link": "https://css-tricks.com/how-i-used-the-waapi-to-build-an-animation-library/",
          "publishedOn": "2021-06-16T14:26:58.000Z",
          "wordCount": 2409,
          "title": "How I Used the WAAPI to Build an Animation Library"
        }
      ]
    },
    {
      "title": "Articles on Smashing Magazine — For Web Designers And Developers",
      "feedUrl": "https://www.smashingmagazine.com/feed/",
      "siteUrl": "https://www.smashingmagazine.com/",
      "articles": [
        {
          "id": "https://smashingmagazine.com/2021/07/isr-dpr-explained/",
          "author": "hello@smashingmagazine.com (Cassidy Williams)",
          "description": "There are two strategies for incrementally building websites that are growing in popularity: Incremental Static Regeneration and Distributed Persistent Rendering. What’s the difference? Let’s figure it out.",
          "link": "https://smashingmagazine.com/2021/07/isr-dpr-explained/",
          "publishedOn": "2021-07-15T14:00:00.000Z",
          "wordCount": 1071,
          "title": "ISR vs DPR: Big Words, Quick Explanation",
          "enclosure": {
            "url": "http://cloud.netlifyusercontent.com/assets/344dbf88-fdf9-42bb-adb4-46f01eedd629/8e4090b9-8bd9-4d5a-aaed-5177c46a6803/isr-dpr-explained.jpg",
            "length": "0",
            "type": "image/jpg"
          }
        },
        {
          "id": "https://smashingmagazine.com/2021/07/javascript-data-grid-kendo-ui/",
          "author": "hello@smashingmagazine.com (Zara Cooper)",
          "description": "In this article, you’ll get to see some pretty groundbreaking things you can achieve with modern JavaScript grids and discover new ways to augment a data grid to make it engaging, responsive, and accessible. All this will be illustrated using Kendo UI Data Grids and their features.",
          "link": "https://smashingmagazine.com/2021/07/javascript-data-grid-kendo-ui/",
          "publishedOn": "2021-07-15T13:45:00.000Z",
          "wordCount": 3198,
          "title": "You Can Do That With A JavaScript Data Grid?",
          "enclosure": {
            "url": "http://cloud.netlifyusercontent.com/assets/344dbf88-fdf9-42bb-adb4-46f01eedd629/a22acbe3-8a80-4f08-95eb-d440e60c5723/kendo-ui-homepage.png",
            "length": "0",
            "type": "image/png"
          }
        },
        {
          "id": "https://smashingmagazine.com/2021/07/frustrating-design-patterns-broken-frozen-filters/",
          "author": "hello@smashingmagazine.com (Vitaly Friedman)",
          "description": "Too often dealing with filters can be frustrating. Let’s get them right. That means never freeze the UI on a single input, provide text input fallback and never auto-scroll users on a single input. Here’s why.",
          "link": "https://smashingmagazine.com/2021/07/frustrating-design-patterns-broken-frozen-filters/",
          "publishedOn": "2021-07-14T13:30:00.000Z",
          "wordCount": 5284,
          "title": "Frustrating Design Patterns: Broken Filters",
          "enclosure": {
            "url": "http://cloud.netlifyusercontent.com/assets/344dbf88-fdf9-42bb-adb4-46f01eedd629/0c5f2df3-3d78-4563-a599-8c924604e84a/7-frustrating-design-patterns.png",
            "length": "0",
            "type": "image/png"
          }
        },
        {
          "id": "https://smashingmagazine.com/2021/07/dynamic-header-intersection-observer/",
          "author": "hello@smashingmagazine.com (Michelle Barker)",
          "description": "In JavaScript, attaching an event listener to constantly fire a callback on scroll can be performance-intensive. But there is a better way with Intersection Observer.",
          "link": "https://smashingmagazine.com/2021/07/dynamic-header-intersection-observer/",
          "publishedOn": "2021-07-13T12:00:00.000Z",
          "wordCount": 3275,
          "title": "Building A Dynamic Header With Intersection Observer",
          "enclosure": {
            "url": "http://cloud.netlifyusercontent.com/assets/344dbf88-fdf9-42bb-adb4-46f01eedd629/67cc7303-3dc9-4d67-b0f4-b6f77783380f/dynamic-header-intersection-observer.jpg",
            "length": "0",
            "type": "image/jpg"
          }
        },
        {
          "id": "https://smashingmagazine.com/2021/07/migrate-jquery-nextjs/",
          "author": "hello@smashingmagazine.com (Facundo Giuliani)",
          "description": "In this article, we’re taking a closer look at different approaches and strategies on how we can migrate a web application that uses jQuery framework, and start using one of the coolest React frameworks in the market: Next.js.",
          "link": "https://smashingmagazine.com/2021/07/migrate-jquery-nextjs/",
          "publishedOn": "2021-07-13T10:30:00.000Z",
          "wordCount": 4225,
          "title": "How To Migrate From jQuery To Next.js",
          "enclosure": {
            "url": "http://cloud.netlifyusercontent.com/assets/344dbf88-fdf9-42bb-adb4-46f01eedd629/ece22577-f23c-4e9c-a41c-f9000f14ae9d/migrate-jquery-nextjs.jpg",
            "length": "0",
            "type": "image/jpg"
          }
        },
        {
          "id": "https://smashingmagazine.com/2021/07/refactoring-css-introduction-part1/",
          "author": "hello@smashingmagazine.com (Adrian Bece)",
          "description": "CSS refactoring is not an easy task — it needs to be done in a way that doesn't create problems. First we need to analyze the existing codebase, audit CSS codebase health, discover weaknesses, agree on the approach, and convince management to invest time and resources into the process.",
          "link": "https://smashingmagazine.com/2021/07/refactoring-css-introduction-part1/",
          "publishedOn": "2021-07-12T13:30:00.000Z",
          "wordCount": 3624,
          "title": "Refactoring CSS: Introduction (Part 1)",
          "enclosure": {
            "url": "http://cloud.netlifyusercontent.com/assets/344dbf88-fdf9-42bb-adb4-46f01eedd629/b8b722a7-791f-433e-8d76-f0382d387e82/refactoring-css-introduction-part1.jpg",
            "length": "0",
            "type": "image/jpg"
          }
        },
        {
          "id": "https://smashingmagazine.com/2021/07/strong-case-for-accessibility/",
          "author": "hello@smashingmagazine.com (Todd Libby)",
          "description": "Accessibility is often overlooked or bolted on to the end of a project. Let’s figure out how to implement and advocate for accessibility from the inception of a project to the release or handoff and beyond.",
          "link": "https://smashingmagazine.com/2021/07/strong-case-for-accessibility/",
          "publishedOn": "2021-07-09T10:30:00.000Z",
          "wordCount": 2948,
          "title": "Making A Strong Case For Accessibility",
          "enclosure": {
            "url": "http://cloud.netlifyusercontent.com/assets/344dbf88-fdf9-42bb-adb4-46f01eedd629/9c226eaa-3251-4d02-9ade-96a88ad759fc/strong-case-for-accessibility.jpg",
            "length": "0",
            "type": "image/jpg"
          }
        },
        {
          "id": "https://smashingmagazine.com/2021/07/tools-practices-speed-up-vuejs-development-process/",
          "author": "hello@smashingmagazine.com (Uma Victor)",
          "description": "Even though Vue.js claims to have an approachable minimalist framework that can be incrementally adaptable, it can be a little bit overwhelming when starting as a Vue.js newbie. In this article, we’re looking at ways to make writing Vue.js a breeze.",
          "link": "https://smashingmagazine.com/2021/07/tools-practices-speed-up-vuejs-development-process/",
          "publishedOn": "2021-07-08T11:00:00.000Z",
          "wordCount": 4784,
          "title": "Tools And Practices To Speed Up The Vue.js Development Process",
          "enclosure": {
            "url": "http://cloud.netlifyusercontent.com/assets/344dbf88-fdf9-42bb-adb4-46f01eedd629/83768020-8004-41f2-b9a9-14b86c18eb4d/tools-practices-speed-up-vuejs-development-process.jpg",
            "length": "0",
            "type": "image/jpg"
          }
        },
        {
          "id": "https://smashingmagazine.com/2021/07/introduction-figma-interactive-components/",
          "author": "hello@smashingmagazine.com (Emiliano Cicero)",
          "description": "Interactive Components in Figma allows designers to create a component with states (hover, active, clicked, focus) and make it interactive so that every copy of the component will inherit those same interactions by default. Let’s explore how it can reduce the time and effort needed to create interactions for your mock-ups.",
          "link": "https://smashingmagazine.com/2021/07/introduction-figma-interactive-components/",
          "publishedOn": "2021-07-07T11:00:00.000Z",
          "wordCount": 4044,
          "title": "An Introduction To Figma Interactive Components",
          "enclosure": {
            "url": "http://cloud.netlifyusercontent.com/assets/344dbf88-fdf9-42bb-adb4-46f01eedd629/1a8390d0-26c0-4476-bc00-19e8c89b60c5/introduction-figma-interactive-components.jpg",
            "length": "0",
            "type": "image/jpg"
          }
        },
        {
          "id": "https://smashingmagazine.com/2021/07/how-to-choose-a-headless-cms/",
          "author": "hello@smashingmagazine.com (Emmanuel Tissera)",
          "description": "There is an array of Headless CMSes out there. In this article, we delve into headless CMS features to satisfy your content editors, marketers and yourself as a developer. For the experience headless practitioner, this could be a checklist to see what’s new out there. For those starting out on their headless journey, this could be a guide on what to look for.",
          "link": "https://smashingmagazine.com/2021/07/how-to-choose-a-headless-cms/",
          "publishedOn": "2021-07-06T10:30:00.000Z",
          "wordCount": 4121,
          "title": "How To Choose A Headless CMS",
          "enclosure": {
            "url": "http://cloud.netlifyusercontent.com/assets/344dbf88-fdf9-42bb-adb4-46f01eedd629/0fa37a67-9079-4b4d-9489-fcd87c7c3807/how-to-choose-a-headless-cms.jpg",
            "length": "0",
            "type": "image/jpg"
          }
        },
        {
          "id": "https://smashingmagazine.com/2021/07/hsl-colors-css/",
          "author": "hello@smashingmagazine.com (Ahmad Shadeed)",
          "description": "In this article, Ahmad Shadeed explains what HSL is, how to use it, and shares some of the useful use-cases and examples that you can use right away in your current projects.",
          "link": "https://smashingmagazine.com/2021/07/hsl-colors-css/",
          "publishedOn": "2021-07-05T10:30:00.000Z",
          "wordCount": 1582,
          "title": "Using HSL Colors In CSS",
          "enclosure": {
            "url": "http://cloud.netlifyusercontent.com/assets/344dbf88-fdf9-42bb-adb4-46f01eedd629/73607a1e-fe7f-47ea-aada-df79342d823a/hsl-colors-css.jpg",
            "length": "0",
            "type": "image/jpg"
          }
        },
        {
          "id": "https://smashingmagazine.com/2021/07/email-testing-flow/",
          "author": "hello@smashingmagazine.com (Andriy Zapisotskyi)",
          "description": "With so many tools and approaches, email still has quite a few pain points, both for developers and email marketers. Email is difficult because it has too many aspects to set and a few instances with no common rules to follow.",
          "link": "https://smashingmagazine.com/2021/07/email-testing-flow/",
          "publishedOn": "2021-07-02T10:30:00.000Z",
          "wordCount": 4158,
          "title": "Email Testing Flow As It Should Be",
          "enclosure": {
            "url": "http://cloud.netlifyusercontent.com/assets/344dbf88-fdf9-42bb-adb4-46f01eedd629/57a53d31-9651-4d88-b2fe-f8de70c08da1/email-testing-flow.jpg",
            "length": "0",
            "type": "image/jpg"
          }
        },
        {
          "id": "https://smashingmagazine.com/2021/07/frontend-testing-pitfalls/",
          "author": "hello@smashingmagazine.com (Ramona Schwering)",
          "description": "When writing front-end tests, you’ll find a lot of pitfalls along the way. In sum, they can lead to lousy maintainability, slow execution time, and — in the worst case — tests you cannot trust. But it doesn’t have to be that way. In this article, I will talk about common mistakes developers make, at least in my experience, and, of course, how to avoid them. Testing doesn’t need to be painful, after all.",
          "link": "https://smashingmagazine.com/2021/07/frontend-testing-pitfalls/",
          "publishedOn": "2021-07-01T12:30:00.000Z",
          "wordCount": 4769,
          "title": "It’s A (Front-End Testing) Trap! Six Common Testing Pitfalls And How To Solve Them",
          "enclosure": {
            "url": "http://cloud.netlifyusercontent.com/assets/344dbf88-fdf9-42bb-adb4-46f01eedd629/dc1434b9-70c3-4fb2-821e-2128e3373246/frontend-testing-pitfalls.jpg",
            "length": "0",
            "type": "image/jpg"
          }
        },
        {
          "id": "https://smashingmagazine.com/2021/06/web-workers-2021/",
          "author": "hello@smashingmagazine.com (Surma)",
          "description": "The web is single-threaded. This makes it increasingly hard to write smooth and responsive apps. Workers have a bad rep, but can be an important and useful tool in any web developer's toolbelt for these kinds of problems. Let’s get up to speed on Workers on the Web!",
          "link": "https://smashingmagazine.com/2021/06/web-workers-2021/",
          "publishedOn": "2021-06-30T12:00:00.000Z",
          "wordCount": 4731,
          "title": "The State Of Web Workers In 2021",
          "enclosure": {
            "url": "http://cloud.netlifyusercontent.com/assets/344dbf88-fdf9-42bb-adb4-46f01eedd629/379e4510-b4ab-4fde-9a5d-122738be19b2/web-workers-2021.jpg",
            "length": "0",
            "type": "image/jpg"
          }
        },
        {
          "id": "https://smashingmagazine.com/2021/06/desktop-wallpaper-calendars-july-2021/",
          "author": "hello@smashingmagazine.com (Cosima Mielke)",
          "description": "Let’s welcome July with some fresh desktop wallpapers. Designed by artists and designers from around the world, they are available with and without a calendar. Enjoy!",
          "link": "https://smashingmagazine.com/2021/06/desktop-wallpaper-calendars-july-2021/",
          "publishedOn": "2021-06-30T09:30:00.000Z",
          "wordCount": 3599,
          "title": "The Many Shades Of July (2021 Desktop Wallpapers Edition)",
          "enclosure": {
            "url": "http://cloud.netlifyusercontent.com/assets/344dbf88-fdf9-42bb-adb4-46f01eedd629/814b3b6e-1510-4c12-8504-433157173355/july-21-against-the-current-preview-opt.png",
            "length": "0",
            "type": "image/png"
          }
        },
        {
          "id": "https://smashingmagazine.com/2021/06/breaking-down-bulky-builds-netlify-nextjs/",
          "author": "hello@smashingmagazine.com (Átila Fassina)",
          "description": "Static Generation is great for performance, but not until the app gets too big and build-times go through the roof. Today, we’ll have a look at how Netlify’s fresh On-Demand Builders can fix that.",
          "link": "https://smashingmagazine.com/2021/06/breaking-down-bulky-builds-netlify-nextjs/",
          "publishedOn": "2021-06-29T11:00:00.000Z",
          "wordCount": 2454,
          "title": "Breaking Down Bulky Builds With Netlify And Next.js",
          "enclosure": {
            "url": "http://cloud.netlifyusercontent.com/assets/344dbf88-fdf9-42bb-adb4-46f01eedd629/a11af025-97a1-4506-8cbe-a7786e5574c9/breaking-down-bulky-builds-netlify-nextjs.jpg",
            "length": "0",
            "type": "image/jpg"
          }
        },
        {
          "id": "https://smashingmagazine.com/2021/06/smashing-podcast-episode-40/",
          "author": "hello@smashingmagazine.com (Drew McLellan)",
          "description": "In this episode, we’re talking about Chakra UI. What is it and how can it help with your React projects? Drew McLellan talks to expert Mike Cavaliere to find out.",
          "link": "https://smashingmagazine.com/2021/06/smashing-podcast-episode-40/",
          "publishedOn": "2021-06-29T05:30:00.000Z",
          "wordCount": 6617,
          "title": "Smashing Podcast Episode 40 Mike Cavaliere: What Is Chakra UI For React?",
          "enclosure": {
            "url": "http://cloud.netlifyusercontent.com/assets/344dbf88-fdf9-42bb-adb4-46f01eedd629/e981ad2c-0679-4935-b19f-39d1ca96823e/smashing-podcast-episode-40.jpg",
            "length": "0",
            "type": "image/jpg"
          }
        },
        {
          "id": "https://smashingmagazine.com/2021/06/custom-emmet-snippets-vscode/",
          "author": "hello@smashingmagazine.com (Manuel Matuzović)",
          "description": "In this article, Manuel explains why Emmet is one of his favorite productivity tools for writing HTML and CSS, and how you can create custom Emmet snippets in Visual Studio Code to help you improve your front-end workflows even more.",
          "link": "https://smashingmagazine.com/2021/06/custom-emmet-snippets-vscode/",
          "publishedOn": "2021-06-28T10:30:00.000Z",
          "wordCount": 2513,
          "title": "Creating Custom Emmet Snippets In VS Code",
          "enclosure": {
            "url": "http://cloud.netlifyusercontent.com/assets/344dbf88-fdf9-42bb-adb4-46f01eedd629/b7ff6227-3a15-4237-8e58-aa783fc9c485/custom-emmet-snippets-vscode.jpg",
            "length": "0",
            "type": "image/jpg"
          }
        },
        {
          "id": "https://smashingmagazine.com/2021/06/creating-multi-author-blog-nextjs/",
          "author": "hello@smashingmagazine.com (Dom Habersack)",
          "description": "This article explains how we can connect different types of content in a Next.js application. With this technique, we can add any kind of one-to-one, one-to-many, or even many-to-many relationship to our projects.",
          "link": "https://smashingmagazine.com/2021/06/creating-multi-author-blog-nextjs/",
          "publishedOn": "2021-06-25T11:30:00.000Z",
          "wordCount": 5454,
          "title": "Creating A Multi-Author Blog With Next.js",
          "enclosure": {
            "url": "http://cloud.netlifyusercontent.com/assets/344dbf88-fdf9-42bb-adb4-46f01eedd629/28d0f286-9b01-4f8d-aede-01248ba3491d/creating-multi-author-blog-nextjs.jpg",
            "length": "0",
            "type": "image/jpg"
          }
        },
        {
          "id": "https://smashingmagazine.com/2021/06/ux-audit-edtech-platform-case-study/",
          "author": "hello@smashingmagazine.com (Mark Lankmilier)",
          "description": "This article is a case study of how a UX audit affects a UI. It explains how a famous educational platform can be analyzed edX against Jakob Nielsen’s usability guidelines. To get started, Mark Lankmiller shares all of the criteria and metrics he used for his UX audit.",
          "link": "https://smashingmagazine.com/2021/06/ux-audit-edtech-platform-case-study/",
          "publishedOn": "2021-06-25T10:00:00.000Z",
          "wordCount": 3522,
          "title": "How To Run A UX Audit For A Major EdTech Platform (Case Study)",
          "enclosure": {
            "url": "http://cloud.netlifyusercontent.com/assets/344dbf88-fdf9-42bb-adb4-46f01eedd629/d5116c31-3d66-47b0-aa81-1a6759c68b92/ux-audit-edtech-platform-case-study.jpg",
            "length": "0",
            "type": "image/jpg"
          }
        },
        {
          "id": "https://smashingmagazine.com/2021/06/design-thinking-problem-solving-strategy/",
          "author": "hello@smashingmagazine.com (Josh Singer)",
          "description": "In the dynamic and unpredictable environments in which we work, even the most carefully crafted solutions can have a short shelf life. When we accept that our work is impermanent and our problem-solving abilities are limited, our goal can shift from delivering full solutions to developing tools that empower our users to adaptively design for themselves.",
          "link": "https://smashingmagazine.com/2021/06/design-thinking-problem-solving-strategy/",
          "publishedOn": "2021-06-24T14:00:00.000Z",
          "wordCount": 4172,
          "title": "The Rise Of Design Thinking As A Problem Solving Strategy",
          "enclosure": {
            "url": "http://cloud.netlifyusercontent.com/assets/344dbf88-fdf9-42bb-adb4-46f01eedd629/e5ea9274-2ff4-49d8-b259-a5f0904cec77/design-thinking-problem-solving-strategy.jpg",
            "length": "0",
            "type": "image/jpg"
          }
        },
        {
          "id": "https://smashingmagazine.com/2021/06/new-smashing-online-workshops-frontend-ux-design/",
          "author": "hello@smashingmagazine.com (Iris Lješnjanin)",
          "description": "Frontend and design are remarkably complex these days. That’s why we invite kind, smart folks from the community to run [online workshops](https://smashingconf.com/online-workshops/) for all of us to learn together. And we have new ones coming up, and we’d like to kindly welcome you to join in.",
          "link": "https://smashingmagazine.com/2021/06/new-smashing-online-workshops-frontend-ux-design/",
          "publishedOn": "2021-06-23T13:30:00.000Z",
          "wordCount": 947,
          "title": "Smashing Online Workshops (July-October 2021)",
          "enclosure": {
            "url": "http://cloud.netlifyusercontent.com/assets/344dbf88-fdf9-42bb-adb4-46f01eedd629/1a95c729-8b29-4b44-90b0-d38183b367c0/online-workshops-2021-opt.png",
            "length": "0",
            "type": "image/png"
          }
        },
        {
          "id": "https://smashingmagazine.com/2021/06/automating-screen-reader-testing-macos-autovo/",
          "author": "hello@smashingmagazine.com (Cameron Cundiff)",
          "description": "Automated testing is an important part of any software project, including testing for accessibility. There are already tools for linting and integration testing accessibility, but what about end-to-end testing with real assistive technology? Since I hadn’t seen this before, I set out to build Auto VO, a driver for the VoiceOver screen reader.",
          "link": "https://smashingmagazine.com/2021/06/automating-screen-reader-testing-macos-autovo/",
          "publishedOn": "2021-06-23T09:30:00.000Z",
          "wordCount": 1350,
          "title": "Automating Screen Reader Testing On macOS Using Auto VO",
          "enclosure": {
            "url": "http://cloud.netlifyusercontent.com/assets/344dbf88-fdf9-42bb-adb4-46f01eedd629/c81018b9-c45e-4c21-9762-dff84dd2682c/automating-screen-reader-testing-macos-autovo.jpg",
            "length": "0",
            "type": "image/jpg"
          }
        },
        {
          "id": "https://smashingmagazine.com/2021/06/design-code-modern-approach-development-challenges/",
          "author": "hello@smashingmagazine.com (Mikołaj Dobrucki)",
          "description": "After years of innovation in both tools and processes, the struggle between design and development is still real. This article focuses on the best practices for improving the design to development processes and how cutting-edge solutions, such as UXPin powered by Merge technology, can help in facilitating the change.",
          "link": "https://smashingmagazine.com/2021/06/design-code-modern-approach-development-challenges/",
          "publishedOn": "2021-06-22T09:00:00.000Z",
          "wordCount": 2886,
          "title": "Designing With Code: A Modern Approach To Design (Development Challenges)",
          "enclosure": {
            "url": "http://cloud.netlifyusercontent.com/assets/344dbf88-fdf9-42bb-adb4-46f01eedd629/08546e48-5034-466a-a29c-08ce3827416e/uxpin-ui.png",
            "length": "0",
            "type": "image/png"
          }
        },
        {
          "id": "https://smashingmagazine.com/2021/06/image-text-conversion-react-tesseract-js-ocr/",
          "author": "hello@smashingmagazine.com (Ayobami Ogundiran)",
          "description": "Do you have to process data manually because it is served through images or scanned documents? An image-to-text conversion makes it possible to extract text from images to automate the processing of texts on images, videos, and scanned documents. In this article, we look at how to convert an image to text with React and Tesseract.js(OCR), preprocess images, and deal with the limitations of Tesseract (OCR).",
          "link": "https://smashingmagazine.com/2021/06/image-text-conversion-react-tesseract-js-ocr/",
          "publishedOn": "2021-06-21T14:30:00.000Z",
          "wordCount": 5363,
          "title": "Image To Text Conversion With React And Tesseract.js (OCR)",
          "enclosure": {
            "url": "http://cloud.netlifyusercontent.com/assets/344dbf88-fdf9-42bb-adb4-46f01eedd629/012f3fbe-980a-44fc-b973-a459f6d9bf1a/image-text-conversion-react-tesseract-js-ocr.jpg",
            "length": "0",
            "type": "image/jpg"
          }
        },
        {
          "id": "https://smashingmagazine.com/2021/06/alternative-voice-ui-voice-assistants/",
          "author": "hello@smashingmagazine.com (Ottomatias Peura)",
          "description": "Voice assistants are currently the most popular use case for voice user interfaces. However, due to the bad feedback loop resulting from voice assistants can only solve simple user tasks such as setting an alarm or playing music. In order for voice user interfaces to really break through, feedback to the user must be visual, not auditive.",
          "link": "https://smashingmagazine.com/2021/06/alternative-voice-ui-voice-assistants/",
          "publishedOn": "2021-06-18T15:00:00.000Z",
          "wordCount": 3412,
          "title": "An Alternative Voice UI To Voice Assistants",
          "enclosure": {
            "url": "http://cloud.netlifyusercontent.com/assets/344dbf88-fdf9-42bb-adb4-46f01eedd629/8ebd2c76-ebe5-4885-be3e-f9acc3608072/alternative-voice-ui-voice-assistants.jpg",
            "length": "0",
            "type": "image/jpg"
          }
        },
        {
          "id": "https://smashingmagazine.com/2021/06/client-side-routing-next-js/",
          "author": "hello@smashingmagazine.com (Adebiyi Adedotun)",
          "description": "Next.js has a file-based routing system in which each page automatically becomes a route based on its file name. This article will guide you through almost everything you need to know about Routing in Next.js and point you in the direction of related topics and concepts.",
          "link": "https://smashingmagazine.com/2021/06/client-side-routing-next-js/",
          "publishedOn": "2021-06-18T13:00:00.000Z",
          "wordCount": 3916,
          "title": "Client-Side Routing In Next.js",
          "enclosure": {
            "url": "http://cloud.netlifyusercontent.com/assets/344dbf88-fdf9-42bb-adb4-46f01eedd629/a51f6c83-5e1a-4535-b28a-2018310ffc3b/client-side-routing-next-js.jpg",
            "length": "0",
            "type": "image/jpg"
          }
        },
        {
          "id": "https://smashingmagazine.com/2021/06/img-alt-attribute-alternate-description-decorative/",
          "author": "hello@smashingmagazine.com (Eric Bailey)",
          "description": "Image placement on the modern web is highly intentional, helping to communicate the overall purpose of a page or view. This means that nearly every image you declare needs to have an alternate description.",
          "link": "https://smashingmagazine.com/2021/06/img-alt-attribute-alternate-description-decorative/",
          "publishedOn": "2021-06-17T10:30:00.000Z",
          "wordCount": 1636,
          "title": "Your Image Is Probably Not Decorative",
          "enclosure": {
            "url": "http://cloud.netlifyusercontent.com/assets/344dbf88-fdf9-42bb-adb4-46f01eedd629/95585fe9-52b8-4bd4-adac-a3580ef87b98/img-alt-attribute-alternate-description-decorative.jpg",
            "length": "0",
            "type": "image/jpg"
          }
        }
      ]
    },
    {
      "title": "freeCodeCamp.org",
      "feedUrl": "https://www.freecodecamp.org/news/rss/",
      "siteUrl": "https://www.freecodecamp.org/news",
      "articles": [
        {
          "id": "60e74160134ad707be00f23f",
          "author": null,
          "description": "The FARM stack is FastAPI, React, and MongoDB. It is a simpler form of the MERN stack that can make developing apps even faster. We just released a FARM stack course on the freeCodeCamp.org YouTube channel.  You will learn how to create a basic CRUD application. FastAPI is where",
          "link": "https://www.freecodecamp.org/news/learn-the-farm-stack-fastapi-reactjs-mongodb/",
          "publishedOn": "2021-07-15T13:43:01.000Z",
          "wordCount": 8503,
          "title": "Learn the FARM Stack! (FastAPI, React, MongoDB)"
        },
        {
          "id": "60ead07ee8ee9b08300ed387",
          "author": null,
          "description": "There are lots of data-storage options available today. You have to choose between managed or unmanaged, relational or NoSQL, write- or read-optimized, proprietary or open-source — and it doesn't end there. Once you begin your search, you will end up in the universe that is database marketing. All of the vendors",
          "link": "https://www.freecodecamp.org/news/the-apache-cassandra-beginner-tutorial/",
          "publishedOn": "2021-07-15T13:13:02.000Z",
          "wordCount": 7098,
          "title": "The Apache Cassandra Beginner Tutorial"
        },
        {
          "id": "60d4e7596e1a1407b6b0bb56",
          "author": null,
          "description": "Did you know that marketers (and even hackers) can use images to track you in your email inbox? Here's how so-called tracking pixels work: Someone creates an image and host it on their server. Often a transparent 1x1 \"tracking pixel\" that you don't even see.They send you an email",
          "link": "https://www.freecodecamp.org/news/stop-email-tracking-pixel-disable-images-gmail/",
          "publishedOn": "2021-07-14T17:51:43.000Z",
          "wordCount": 577,
          "title": "How to Stop Email Tracking in Gmail – Disable Images by Default"
        },
        {
          "id": "5ff5461e7af2371468bb7ece",
          "author": null,
          "description": "We're expanding freeCodeCamp's Python section into a full-blown data science curriculum. Currently, these data science skills are only taught at a few universities around the world. Our goal is for anyone, anywhere to be able to learn these advanced mathematics and machine learning concepts that data scientists use in the",
          "link": "https://www.freecodecamp.org/news/building-a-data-science-curriculum-with-advanced-math-and-machine-learning/",
          "publishedOn": "2021-07-14T16:27:00.000Z",
          "wordCount": 1574,
          "title": "We&#x27;re Building a Data Science Curriculum with Advanced Mathematics and Machine Learning"
        },
        {
          "id": "60ebb55be8ee9b08300ed731",
          "author": null,
          "description": "Websites are a critical part of almost every business or organization in the world. From your nearby florist to global brands, almost everyone uses a website as part of their branding. Unfortunately, websites are also one of the most unsecured gateways through which an attacker can exploit your company. Since",
          "link": "https://www.freecodecamp.org/news/an-introduction-to-web-server-scanning-with-nikto/",
          "publishedOn": "2021-07-14T07:18:59.000Z",
          "wordCount": 1136,
          "title": "An Introduction to Web Server Scanning With Nikto"
        },
        {
          "id": "60eb2a69e8ee9b08300ed5b3",
          "author": null,
          "description": "Redis is a type of database that can be added to your produciton level applicaiton to make it more performant.  In this article, I'll go over the Redis basics and show a real world example of Redis in action.  Here's everything we'll go over:  What is Redis? Why the Hype",
          "link": "https://www.freecodecamp.org/news/redis-crash-course/",
          "publishedOn": "2021-07-14T06:11:13.000Z",
          "wordCount": 1435,
          "title": "Redis Crash Course"
        },
        {
          "id": "60e73db9134ad707be00f206",
          "author": null,
          "description": "Branches are one of Git's most important concepts. And to master Git, it's essential to have a thorough understanding of how branches work. We just released a tutorial about Git branches on the freeCodeCamp.org YouTube channel. You will learn about the many actions you can perform around branches -",
          "link": "https://www.freecodecamp.org/news/how-git-branches-work/",
          "publishedOn": "2021-07-13T13:44:04.000Z",
          "wordCount": 4795,
          "title": "How Git Branches Work"
        },
        {
          "id": "609692d82cd0545b5e9441ab",
          "author": null,
          "description": "GraphQL is a query language for your API. It simplifies the process of requesting the server by providing convenient ways to query objects.  For instance, if you're using a REST API and you need a list of books, you might hit the GET /books/list endpoint for all books. Then",
          "link": "https://www.freecodecamp.org/news/build-graphql-server-with-laravel/",
          "publishedOn": "2021-07-13T07:54:34.000Z",
          "wordCount": 2258,
          "title": "How to Build a GraphQL Server with Laravel GraphQL and Test It with Postman"
        },
        {
          "id": "60e9c888e8ee9b08300ed212",
          "author": null,
          "description": "In this guide, you will see exactly how to use Axios.js with React using tons of real-world examples featuring React hooks.  You'll see why you should use Axios as a data fetching library, how to set it up with React, and perform every type of HTTP request with it.",
          "link": "https://www.freecodecamp.org/news/how-to-use-axios-with-react/",
          "publishedOn": "2021-07-13T07:36:28.000Z",
          "wordCount": 2519,
          "title": "How To Use Axios With React: The Definitive Guide (2021)"
        },
        {
          "id": "60e5b284134ad707be00e5e0",
          "author": null,
          "description": "Have you noticed that User Interface and User Experience design are considered different topics nowadays? Or have you ever wondered which one is better?  You're not the only one.  We live in a beautiful era of design, with new techniques and trends coming and going. Frontend development is also gaining",
          "link": "https://www.freecodecamp.org/news/ui-ux-design-guide/",
          "publishedOn": "2021-07-13T02:14:52.000Z",
          "wordCount": 2261,
          "title": "UI/UX Design Guide: What Are UI Designers, and How Are They Different Than UX Designers?"
        },
        {
          "id": "60e753aa134ad707be00f2c1",
          "author": null,
          "description": "SPSS Statistics is a software package used for interactive, or batched, statistical analysis. We just released a full course on the freeCodeCamp.org YouTube channel that will teach you how to use the popular statistical application SPSS from IBM. This course provides a concise overview of how you can use",
          "link": "https://www.freecodecamp.org/news/spss-full-course/",
          "publishedOn": "2021-07-12T13:34:03.000Z",
          "wordCount": 22122,
          "title": "Learn How to Use SPSS to Explore and Analyze Data"
        },
        {
          "id": "60e981aae8ee9b08300ed1ae",
          "author": null,
          "description": "Artificial intelligence and machine learning are two popular and often hyped terms these days. And people often use them interchangeably to describe an intelligent software or system.  But even though both AI and ML are based on statistics and mathematics, they are not the same thing. In this article, you",
          "link": "https://www.freecodecamp.org/news/ai-vs-ml-whats-the-difference/",
          "publishedOn": "2021-07-12T11:46:56.000Z",
          "wordCount": 899,
          "title": "AI vs ML – What’s the Difference Between Artificial Intelligence and Machine Learning?"
        },
        {
          "id": "60e76d88134ad707be00f347",
          "author": null,
          "description": "Gone are the days of storing your data in a CSV file or an Excel spreadsheet. If you want to quickly analyze millions of data rows in seconds, BigQuery is the way to go. In this getting started guide, we'll learn about BigQuery and how we can use it to",
          "link": "https://www.freecodecamp.org/news/google-bigquery-beginners-guide/",
          "publishedOn": "2021-07-12T11:26:39.000Z",
          "wordCount": 1208,
          "title": "Google BigQuery Beginner&#x27;s Guide – How to Analyze Large Datasets"
        },
        {
          "id": "60e8864de8ee9b08300ecc3f",
          "author": null,
          "description": "There are literally 100s of great React libraries to choose from, but which libraries do you need most for your React projects?  In this article, we're going to break down five libraries you need for your React projects. Each of them will cover virtually every major tool you need, plus",
          "link": "https://www.freecodecamp.org/news/5-react-libraries-every-project-needs/",
          "publishedOn": "2021-07-09T20:06:31.000Z",
          "wordCount": 1729,
          "title": "5 React Libraries Every Project Should Use in 2021"
        },
        {
          "id": "60e81c50134ad707be00f79f",
          "author": null,
          "description": "Hey everyone! In this article, I'm going to show you what's new in the latest of version of React – React 18 – in under 8 minutes.  First, you might be wondering whether the latest set of changes will break anything with your current setup, or whether you will have to learn",
          "link": "https://www.freecodecamp.org/news/whats-new-in-react-18/",
          "publishedOn": "2021-07-09T18:42:26.000Z",
          "wordCount": 1930,
          "title": "What&#x27;s New in React 18? Concurrency, Batching, the Transition API and More"
        },
        {
          "id": "60dcb93727f80207bcdbc17e",
          "author": null,
          "description": "When you use code snippets in Visual Studio, it can make your coding process a lot easier and faster. But what are code snippets? And how can you use them? In this article, we'll look at how you can create code snippets in C#. Just keep in mind that snippets",
          "link": "https://www.freecodecamp.org/news/how-to-automatically-generate-code-snippets-visual-studio/",
          "publishedOn": "2021-07-09T18:28:18.000Z",
          "wordCount": 3957,
          "title": "How to Automatically Generate C# Code Snippets in Visual Studio"
        },
        {
          "id": "5f9c986d740569d1a4ca1a04",
          "author": null,
          "description": "Nine years ago, universities like MIT and Stanford first opened up free online courses to the public. Today, close to 1,000 schools around the world have created thousands of free online courses. I’ve compiled this list of 760+ such free online courses that you can start this month.",
          "link": "https://www.freecodecamp.org/news/free-online-programming-cs-courses/",
          "publishedOn": "2021-07-09T18:04:00.000Z",
          "wordCount": 6787,
          "title": "760+ Free Online Programming &amp; Computer Science Courses You Can Start This July"
        },
        {
          "id": "60ae6b0d11ffb70827ef7fe6",
          "author": null,
          "description": "If you look at any website or application today, somewhere under the hood there is a database. After all, we live in the world of Big Data. And the volume of data is growing exponentially.  With so much data at hand, we need ever more sophisticated ways to store it",
          "link": "https://www.freecodecamp.org/news/how-to-create-a-nosql-database-with-ravendb/",
          "publishedOn": "2021-07-09T15:06:24.000Z",
          "wordCount": 1374,
          "title": "How to Create a NoSQL Database with RavenDB"
        },
        {
          "id": "60e59724134ad707be00e5d1",
          "author": null,
          "description": "This post will show you how to build the Feature Toggle mechanism in your Next.JS application.  We are going to use Next.JS, React, and TypeScript. We will deploy our application to Vercel to demonstrate the real-life example. You can find the code and video in the summary at",
          "link": "https://www.freecodecamp.org/news/how-to-use-feature-toggles-in-next-js-and-react/",
          "publishedOn": "2021-07-08T17:13:58.000Z",
          "wordCount": 2850,
          "title": "Build Your Own Feature Toggle with Next.js and React in Under 30 Minutes"
        },
        {
          "id": "60e3ae66134ad707be00dbdb",
          "author": null,
          "description": "Developing web pages used to involve writing HTML, CSS, and a little scripting code like JavaScript for functionality.  But over time, we've developed new and more advanced technologies and frameworks to create webpages. We now use things like reusable components, routing, and rendering to the document object model (DOM).  These",
          "link": "https://www.freecodecamp.org/news/build-accessible-vue-applications/",
          "publishedOn": "2021-07-08T16:23:19.000Z",
          "wordCount": 1935,
          "title": "How to Build Accessible Vue Applications"
        },
        {
          "id": "60df723627f80207bcdbcf36",
          "author": null,
          "description": "According to Google trends, React is the most popular JavaScript frontend framework. Unless you're in the U.S. state of Nebraska, that is. 😀 Google Trends (React vs Angular)React is a declarative, efficient, and flexible JavaScript library for building user interfaces. We just released a full React course on the",
          "link": "https://www.freecodecamp.org/news/learn-react-js-in-this-free-7-hour-course/",
          "publishedOn": "2021-07-08T15:44:30.000Z",
          "wordCount": 68137,
          "title": "Learn React JS in This Free 7-Hour Course"
        },
        {
          "id": "60e521aa134ad707be00e41d",
          "author": null,
          "description": "Objects are one of the most valuable things you can learn in Javascript. You can use them to take your programs to the next level.  An object is a collection of data – or key value pairs – which consist of variables and functions that you can access using dot notation. Now",
          "link": "https://www.freecodecamp.org/news/what-is-a-javascript-object/",
          "publishedOn": "2021-07-07T22:04:00.000Z",
          "wordCount": 761,
          "title": "What is a JavaScript Object? Key Value Pairs and Dot Notation Explained"
        },
        {
          "id": "60ccd1794dc1a607ed7b4feb",
          "author": null,
          "description": "A lot of people want to learn machine learning these days. But the daunting bottom-up curriculum that most ML teachers propose is enough discourage a lot of newcomers.  In this tutorial I flip the curriculum upside down and will outline what I think is the fastest and easiest way to",
          "link": "https://www.freecodecamp.org/news/how-to-learn-machine-learning-practical-tips-and-resources/",
          "publishedOn": "2021-07-07T17:28:00.000Z",
          "wordCount": 5411,
          "title": "How to Learn Machine Learning – Tips and Resources to Learn ML the Practical Way"
        },
        {
          "id": "60e25e17134ad707be00d947",
          "author": null,
          "description": "List comprehension is an easy to read, compact, and elegant way of creating a list from any existing iterable object. Basically, it's a simpler way to create a new list from the values in a list you already have. It is generally a single line of code enclosed in square",
          "link": "https://www.freecodecamp.org/news/list-comprehension-in-python/",
          "publishedOn": "2021-07-07T17:25:39.000Z",
          "wordCount": 1592,
          "title": "List Comprehension in Python Explained for Beginners"
        },
        {
          "id": "60c38e76d3126007592d66cd",
          "author": null,
          "description": "I've carefully gone through over 50 resources, I've been through 10 JavaScript interviews, and I've landed a job at a unicorn startup. And throughout this entire process, I started to see a pattern in the most frequently asked JS interview questions.  In this article, I have tried to list the",
          "link": "https://www.freecodecamp.org/news/javascript-interview-prep-cheatsheet/",
          "publishedOn": "2021-07-07T15:43:17.000Z",
          "wordCount": 4364,
          "title": "JavaScript Interview Prep Cheatsheet – Ace Your Coding Interviews with These Concepts"
        },
        {
          "id": "60d5ec446e1a1407b6b0bcae",
          "author": null,
          "description": "Binary search is a common algorithm used in programming languages and programs. It can be very useful for programmers to understand how it works. We just released a binary search course on the freeCodeCamp.org YouTube channel. You will learn how to implement binary search in C and C++, but",
          "link": "https://www.freecodecamp.org/news/what-is-binary-search/",
          "publishedOn": "2021-07-07T13:57:56.000Z",
          "wordCount": 13488,
          "title": "What is Binary Search?"
        },
        {
          "id": "60e16e1b134ad707be00d6bc",
          "author": null,
          "description": "In this article, I'm going to explain how to automatically upload an Android App Bundle (.aab file) to the Play Store's beta track. We'll use Android Studio and AWS as a cloud infrastructure provider.  Once we've uploaded the app bundle, we'll trigger a Slack notification.  This is a valuable use",
          "link": "https://www.freecodecamp.org/news/automatically-upload-an-android-app-bundle-to-the-play-store/",
          "publishedOn": "2021-07-06T21:08:39.000Z",
          "wordCount": 2504,
          "title": "How to Automatically Upload an Android App Bundle to the Play Store"
        },
        {
          "id": "60b22e9611ffb70827ef9547",
          "author": null,
          "description": "In this tutorial, you will learn how to authenticate users and secure endpoints in Node.js. You'll also see how to implement Cross-Origin Resource Sharing (CORS) in Node. So let's get started.  Prerequisites You'll need the following to follow along with this tutorial:  A working understanding of JavaScript. A good",
          "link": "https://www.freecodecamp.org/news/how-to-authenticate-users-and-implement-cors-in-nodejs-applications/",
          "publishedOn": "2021-07-06T16:02:13.000Z",
          "wordCount": 2286,
          "title": "How to Authenticate Users and Implement CORS in Node.js Apps"
        },
        {
          "id": "60df35f027f80207bcdbccea",
          "author": null,
          "description": "Let's look at five JavaScript tips you can use today to instantly improve your React applications.  Because React is a JavaScript library, any improvements that we make in our JavaScript skills will directly improve the applications that we build with React. For this reason, I've put together a number of",
          "link": "https://www.freecodecamp.org/news/javascript-tips-to-improve-your-react-code-today/",
          "publishedOn": "2021-07-06T15:12:00.000Z",
          "wordCount": 1570,
          "title": "5 JavaScript Tips to Improve Your React Code"
        },
        {
          "id": "60aa196411ffb70827ef5f43",
          "author": null,
          "description": "In this article, you will learn how to schedule a job in Node using node-cron.  Node-cron is a handy npm package which you can use to schedule jobs to run at specific times or intervals. It is most suitable for scheduling repetitive jobs such as email notifications, file downloads, and",
          "link": "https://www.freecodecamp.org/news/schedule-a-job-in-node-with-nodecron/",
          "publishedOn": "2021-07-06T14:27:26.000Z",
          "wordCount": 2989,
          "title": "How to Schedule a Job in Node Using node-cron"
        },
        {
          "id": "60df6dd827f80207bcdbcf06",
          "author": null,
          "description": "Earning the Certified Information Systems Security Professional (CISSP) Certification proves you have what it takes to effectively design, implement and manage a best-in-class cybersecurity program. The CISSP is one of the most valuable Cyber Security Certificates in the market today.  We just posted a 13-hour course on the freeCodeCamp.org",
          "link": "https://www.freecodecamp.org/news/get-ready-to-pass-cissp-exam/",
          "publishedOn": "2021-07-06T13:55:00.000Z",
          "wordCount": 109640,
          "title": "Get Ready to Pass CISSP Exam"
        },
        {
          "id": "60de3cf127f80207bcdbc9af",
          "author": null,
          "description": "We just published demos of several upcoming freeCodeCamp features and community initiatives. You can read about them here, and watch the entire Summit in the video embedded below. Here's what we cover in this jam-packed one hour community update.Announcement #1: Campfire ModeWe've built a new mode where you can",
          "link": "https://www.freecodecamp.org/news/freecodecamp-july-2021-summit/",
          "publishedOn": "2021-07-02T04:55:18.000Z",
          "wordCount": 641,
          "title": "freeCodeCamp July 2021 Summit – Campfire Mode, Data Science Curriculum, Chapter, and Other New Features"
        },
        {
          "id": "60dc72b527f80207bcdbbd8f",
          "author": null,
          "description": "In this article, I'm going to show you how to theme your website so users can customize certain elements to their tastes.  We'll talk about website themes, how theming works, and we'll end with a demo so you can see it in action. Let's dive in. Table of Contents:What",
          "link": "https://www.freecodecamp.org/news/website-theming-with-css-custom-properties-and-gatsbyjs/",
          "publishedOn": "2021-07-01T18:19:21.000Z",
          "wordCount": 3084,
          "title": "What is Website Theming? How to Use CSS Custom Properties and Gatsby.js to Customize Your Site"
        },
        {
          "id": "60c0897ad3126007592d5701",
          "author": null,
          "description": "Listing items on a web page is a common task you'll have to do as a web developer. You may have to list shopping cart items, the order of students based on their grades, dogs with the loudest bark – and so on. So you need to know the different ways",
          "link": "https://www.freecodecamp.org/news/html-list-how-to-use-bullet-points-ordered-and-unordered-lists/",
          "publishedOn": "2021-07-01T18:02:56.000Z",
          "wordCount": 1769,
          "title": "HTML List – How to Use Bullet Points, Ordered, and Unordered Lists"
        },
        {
          "id": "60d5e7ae6e1a1407b6b0bc5a",
          "author": null,
          "description": "The backend of a website can be written in many different programming languages. It is becoming increasingly common for to use Python for the backend of a website. We just published a full backend web development with Python course on the freeCodeCamp.org YouTube channel. This comprehensive course is for",
          "link": "https://www.freecodecamp.org/news/backend-web-development-with-python-full-course/",
          "publishedOn": "2021-07-01T16:51:30.000Z",
          "wordCount": 79275,
          "title": "Backend Web Development with Python - Full Course"
        },
        {
          "id": "60dc78e927f80207bcdbbddc",
          "author": null,
          "description": "Hello freeCodeCamp community! I'm Dilan, a PhD candidate in sociology at Boston University. I'm an absolute coding newbie, but I do know a bit about surveys. 😃 I have been working with freeCodeCamp founder Quincy Larson over the past few months to design the 2021 New Coder Survey. And I'm thrilled",
          "link": "https://www.freecodecamp.org/news/2021-new-coder-survey/",
          "publishedOn": "2021-07-01T04:36:31.000Z",
          "wordCount": 942,
          "title": "The 2021 New Coder Survey is Now Live – and Here&#x27;s How We Designed It"
        },
        {
          "id": "6063b8d69618b008528a9d79",
          "author": null,
          "description": "Today we're gonna learn how to use CSS's box-shadow property to make beautiful website components. Along the way, we'll create a button and get hands-on experience using this property. Let's get started. 🎖️ Table of Contents Why you should use the CSS box-shadow propertyThe syntax of the box-shadow propertyHow to make",
          "link": "https://www.freecodecamp.org/news/css-box-shadow-property-with-examples/",
          "publishedOn": "2021-06-30T18:49:49.000Z",
          "wordCount": 956,
          "title": "Learn the CSS Box-Shadow Property by Coding a Beautiful Button ✨"
        },
        {
          "id": "6055c55b687d62084bf68804",
          "author": null,
          "description": "This tutorial is an overview of basic concepts of the C programming language.  It goes over the history of the language, why and where it is used, the compilation process, and some very basic programming concepts that are common in most popular programming languages. It is not a complete guide",
          "link": "https://www.freecodecamp.org/news/what-is-the-c-programming-language-beginner-tutorial/",
          "publishedOn": "2021-06-30T14:25:53.000Z",
          "wordCount": 12270,
          "title": "What is The C Programming Language? A Tutorial for Beginners"
        },
        {
          "id": "60d5ea736e1a1407b6b0bc8d",
          "author": null,
          "description": "React Router is commonly used to make different routes for pages in React Applications. We just released a crash course on the freeCodeCamp.org YouTube channel that will teach you how to create routes in your React applications. Piyush Agarwal developed this course. Piyush is a prolific course creator on",
          "link": "https://www.freecodecamp.org/news/learn-react-router/",
          "publishedOn": "2021-06-30T14:01:01.000Z",
          "wordCount": 5542,
          "title": "Learn React Router"
        },
        {
          "id": "60db519527f80207bcdbb6fa",
          "author": null,
          "description": "Whether you are new to coding interviews or are already familiar with the concept of backtracking, this is the crash course for you. We will learn about an all-purpose coding template and apply it to two LeetCode hard problems. Ready to crunch your next coding interview? Let's go!",
          "link": "https://www.freecodecamp.org/news/coding-interview-backtracking-problems-crash-course/",
          "publishedOn": "2021-06-29T20:00:32.000Z",
          "wordCount": 908,
          "title": "Coding Interview Backtracking Problems Crash Course – The Only One You&#x27;ll Ever Need"
        },
        {
          "id": "604b8c6ea7946308b7687683",
          "author": null,
          "description": "Every day, developers use various applications and run commands in the terminal. These applications can include a browser, code editor, terminal, video conferencing app, or music player.  For each of these software applications that you open or commands you run, it creates a process or task. One beautiful feature of",
          "link": "https://www.freecodecamp.org/news/linux-list-processes-how-to-check-running-processes/",
          "publishedOn": "2021-06-29T19:47:13.000Z",
          "wordCount": 1079,
          "title": "Linux List Processes – How to Check Running Processes"
        },
        {
          "id": "60daf29027f80207bcdbb3fe",
          "author": null,
          "description": "Why do we need the timedelta object?When you're working with dates and times in Python, you'll often use the datetime module.  In this post, we'll see how we can use the timedelta object in the datetime module. It denotes a span of time and can help when we need",
          "link": "https://www.freecodecamp.org/news/how-to-use-timedelta-objects-in-python/",
          "publishedOn": "2021-06-29T18:25:52.000Z",
          "wordCount": 926,
          "title": "How to Use timedelta Objects in Python to Work with Dates"
        },
        {
          "id": "60d76f6f6e1a1407b6b0c521",
          "author": null,
          "description": "What is the Microsoft Security, Compliance, and Identity Fundamentals?The Microsoft Security, Compliance and Identity Fundamentals Certification is an essential entry-level certification into Azure and Microsoft Security. In recent years we've seen a significant shift in the work environment where companies allow employees to work from home.  The increase of",
          "link": "https://www.freecodecamp.org/news/microsoft-security-compliance-certification-sc-900/",
          "publishedOn": "2021-06-29T13:24:44.000Z",
          "wordCount": 684,
          "title": "Microsoft Security, Compliance, and Identity Fundamentals (SC-900) – Pass the Exam With This Free 3.5 Hour Course"
        },
        {
          "id": "60d61acc6e1a1407b6b0bd46",
          "author": null,
          "description": "In this article, you will learn how to securely access secret API keys using Netlify functions in a React app.  Netlify provides rich features that help you easily deploy Single Page Applications built using frameworks like React, Vue and Angular among others. This takes away the burden of coding and",
          "link": "https://www.freecodecamp.org/news/how-to-access-secret-api-keys-using-netlify-functions-in-a-react-app/",
          "publishedOn": "2021-06-28T21:17:02.000Z",
          "wordCount": 3681,
          "title": "How to Securely Access Secret API keys using Netlify Functions in a React App"
        },
        {
          "id": "60d9766b6e1a1407b6b0cb4f",
          "author": null,
          "description": "If you're working with Natural Language Processing, knowing how to deploy a model is one of the most important skills you'll need to have. Model deployment is the process of integrating your model into an existing production environment. The model will receive input and predict an output for decision-making for",
          "link": "https://www.freecodecamp.org/news/how-to-deploy-an-nlp-model-with-fastapi/",
          "publishedOn": "2021-06-28T20:35:12.000Z",
          "wordCount": 2818,
          "title": "How to Deploy an NLP Model with FastAPI"
        },
        {
          "id": "60d07b4578f45307fee80aef",
          "author": null,
          "description": "Every developer needs a good development enviroment, whether you're into mobile development or web apps or even if you're just learning your first programming language.  Just like any beginning developer, when I began to learn coding I needed some guidance on how to get started. And one of the most",
          "link": "https://www.freecodecamp.org/news/what-is-an-ide-in-programming-an-ide-definition-for-developers/",
          "publishedOn": "2021-06-28T20:04:28.000Z",
          "wordCount": 2258,
          "title": "What is an IDE in Programming? An IDE Definition for Developers"
        },
        {
          "id": "60d675ac6e1a1407b6b0bea1",
          "author": null,
          "description": "In JavaScript, people often confuse closures with lexical scope. Lexical scope is an important part of closures, but it is not a closure by itself. Closures are an advanced concept that is also a frequent topic of technical interviews. You should have a foundational understanding of functions before attempting to",
          "link": "https://www.freecodecamp.org/news/javascript-closure-lexical-scope/",
          "publishedOn": "2021-06-28T18:45:21.000Z",
          "wordCount": 740,
          "title": "JavaScript Closure Tutorial – How Closures and Lexical Scope Work in JS"
        },
        {
          "id": "60d4d3d86e1a1407b6b0bb25",
          "author": null,
          "description": "A design system is a set of standards, reusable components, and patterns used to create visual consistency throughout different projects and pages. Figma is a vector graphics editor and prototyping tool. We just released a course on the freeCodeCamp.org channel that will teach you how to build a design",
          "link": "https://www.freecodecamp.org/news/learn-how-to-create-a-design-system-in-figma/",
          "publishedOn": "2021-06-28T13:50:35.000Z",
          "wordCount": 67249,
          "title": "Learn How to Create a Design System in Figma"
        },
        {
          "id": "60d4ea756e1a1407b6b0bb71",
          "author": null,
          "description": "Ok. I'm not suggesting that everyone needs to become a fully-credentialed data scientist. But these days, learning core data skills may provide as much value as basic financial literacy or knowledge of a simple coding language. This isn't just about your career: data has grown far beyond the world of",
          "link": "https://www.freecodecamp.org/news/why-you-should-learn-data-analytics/",
          "publishedOn": "2021-06-28T13:44:39.000Z",
          "wordCount": 806,
          "title": "Why You Should Learn Data Analytics"
        },
        {
          "id": "60d3ee396e1a1407b6b0b6ef",
          "author": null,
          "description": "Let's go over the most common mistakes you might be making in your React code right now, plus how to fix them. If you want to create amazing React applications, it's essential to avoid many common errors along the way. In this article, we'll not only cover how to fix",
          "link": "https://www.freecodecamp.org/news/common-react-mistakes-and-how-to-fix-them/",
          "publishedOn": "2021-06-24T17:01:44.000Z",
          "wordCount": 1511,
          "title": "4 Common React Mistakes You Might Be Making – And How to Fix Them"
        },
        {
          "id": "60d4b5e96e1a1407b6b0bac4",
          "author": null,
          "description": "If you want good performance in your application, you need to collect data to figure out where to make improvements. That's where OpenTelemetry comes in. OpenTelemetry offers a single set of APIs and libraries that standardize how you collect and transfer telemetry data. OpenTelemetry provides a specification for instrumentation so",
          "link": "https://www.freecodecamp.org/news/how-to-use-opentelemetry/",
          "publishedOn": "2021-06-24T16:50:36.000Z",
          "wordCount": 9777,
          "title": "How to Use OpenTelemetry to Understand Software Performance"
        },
        {
          "id": "605abca5687d62084bf6b7cd",
          "author": null,
          "description": "Data Analysis is the process of exploring, investigating, and gathering insights from data using statistical measures and visualizations.  The objective of data analysis is to develop an understanding of data by uncovering trends, relationships, and patterns. Data analysis is both a science and an art. On the one hand it",
          "link": "https://www.freecodecamp.org/news/exploratory-data-analysis-with-numpy-pandas-matplotlib-seaborn/",
          "publishedOn": "2021-06-24T00:11:01.000Z",
          "wordCount": 8365,
          "title": "What is Data Analysis? How to Visualize Data with Python, Numpy, Pandas, Matplotlib &amp; Seaborn Tutorial"
        },
        {
          "id": "6072ffd4d5756f080ba98b27",
          "author": null,
          "description": "Over the last few years, microservices have gone from an overhyped buzzword to something you should understand as a software engineer.  According to an O'Reilly developer survey in 2020:  61% of companies have been using microservices in the last year29% say at least half of their company systems are built",
          "link": "https://www.freecodecamp.org/news/microservices-architecture-for-humans/",
          "publishedOn": "2021-06-23T21:52:08.000Z",
          "wordCount": 2975,
          "title": "Microservices Architecture – Explained in Plain English"
        },
        {
          "id": "60d36eb66e1a1407b6b0b16d",
          "author": null,
          "description": ".NET is a popular software framework developed by Microsoft. We just released a course on the freeCodeCamp.org YouTube channel that will teach you how to create a REST API end-to-end from scratch using the latest .NET 5 innovations and Visual Studio Code. The course uses the C# programming language.",
          "link": "https://www.freecodecamp.org/news/create-a-rest-api-with-dot-net-5-and-c-sharp/",
          "publishedOn": "2021-06-23T18:08:14.000Z",
          "wordCount": 60401,
          "title": "Create a REST API with .NET 5 and  C#"
        },
        {
          "id": "60a406bd906c5207e3a7dfcb",
          "author": null,
          "description": "In this article you will learn how to create a great technical video course. I run the freeCodeCamp.org YouTube channel where we post technical courses from a variety of contributors. Video courses that follow the guidelines in this article are often a good fit for freeCodeCamp's channel. How to",
          "link": "https://www.freecodecamp.org/news/how-to-create-a-great-technical-course/",
          "publishedOn": "2021-06-23T17:19:24.000Z",
          "wordCount": 2330,
          "title": "How to Create a Great Technical Course"
        },
        {
          "id": "60d2323d6e1a1407b6b0ac4f",
          "author": null,
          "description": "Web scraping lets you collect data from web pages across the internet. It's also called web crawling or web data extraction.  PHP is a widely used back-end scripting language for creating dynamic websites and web applications. And you can implement a web scraper using plain PHP code.  But since we",
          "link": "https://www.freecodecamp.org/news/web-scraping-with-php-crawl-web-pages/",
          "publishedOn": "2021-06-22T21:11:53.000Z",
          "wordCount": 2770,
          "title": "Web Scraping with PHP – How to Crawl Web Pages Using Open Source Tools"
        },
        {
          "id": "60cac8ff4dc1a607ed7b4592",
          "author": null,
          "description": "There’s a special syntax you can use in JavaScript that makes working with promises easier. It's called “async/await\", and it’s surprisingly straightforward to understand and use.  In this article, we'll discuss:  What are asynchronus functions? How promises work in JavaScript Async/Await basics How to use",
          "link": "https://www.freecodecamp.org/news/how-to-use-async-await-write-better-javascript/",
          "publishedOn": "2021-06-22T16:24:37.000Z",
          "wordCount": 1432,
          "title": "How to Use Async/Await to Write Better JavaScript Code"
        },
        {
          "id": "60c13e71d3126007592d5be2",
          "author": null,
          "description": "The 100 Days of Code challenge is very popular among new coders and developers looking to level up their skills. It's so popular that our Discord server has an entire channel dedicated to it.  By popular demand, we recently built a Discord bot that helps people track their progress in",
          "link": "https://www.freecodecamp.org/news/how-to-build-a-100-days-of-code-bot-for-discord-using-typescript-and-mongodb/",
          "publishedOn": "2021-06-22T16:20:36.000Z",
          "wordCount": 7385,
          "title": "How to Use TypeScript and MongoDB to Build a 100 Days of Code Discord Bot"
        },
        {
          "id": "60cfff5a4dc1a607ed7b5e58",
          "author": null,
          "description": "Do you have a story idea that you'd like to turn into a novel? How about adding visual appeal and interactivity to that novel?  A Visual Novel might be the game genre you are looking for. And this tutorial is here to help set you up in 10 minutes, with",
          "link": "https://www.freecodecamp.org/news/use-python-to-create-a-visual-novel/",
          "publishedOn": "2021-06-22T16:18:29.000Z",
          "wordCount": 1611,
          "title": "How to Use Python to Create a Visual Novel Game in 10 Minutes"
        },
        {
          "id": "60c81f774dc1a607ed7b2f66",
          "author": null,
          "description": "I've been using Vim since the first year I started coding. For all the IDEs/editors that I have used, the Vim plugin is always the very first plugin that I install. I know that Vim can be challenging to work in for people who are not familiar with it.",
          "link": "https://www.freecodecamp.org/news/how-to-exit-vim/",
          "publishedOn": "2021-06-21T21:52:43.000Z",
          "wordCount": 1785,
          "title": "How to Exit Vim – Vim Save and Quit Command Tutorial"
        },
        {
          "id": "60bce157acb62507dd1d9f11",
          "author": null,
          "description": "When you're working with Python lists, you often need to combine data from multiple lists. So how do you do that? In this tutorial, we'll see the different ways you can combine data from multiple lists. We'll also learn how the list methods append() and extend() work through simple examples.",
          "link": "https://www.freecodecamp.org/news/python-list-methods-append-vs-extend/",
          "publishedOn": "2021-06-21T21:25:11.000Z",
          "wordCount": 1085,
          "title": "Python List Methods – append( ) vs extend( ) in Python Explained with Code Examples"
        },
        {
          "id": "60cccd6e4dc1a607ed7b4f81",
          "author": null,
          "description": "Redux is a state management library for front end applications. Developers commonly use it with React through the react-redux package, but it can also stand alone – so you can use it in any front end framework or library, including Vanilla JavaScript.  Redux can really be intimidating at first. It might",
          "link": "https://www.freecodecamp.org/news/learn-redux-by-making-a-counter-application/",
          "publishedOn": "2021-06-21T21:01:42.000Z",
          "wordCount": 1659,
          "title": "Learn Redux by Making a Counter Application"
        },
        {
          "id": "60d0d0ff6e1a1407b6b0a506",
          "author": null,
          "description": "Today you're going to create one of the most important apps you can build for yourself: your developer portfolio. Every React developer or web developer in general needs to be able to show off what they can do to any potential client or employer. That's exactly what we're going to",
          "link": "https://www.freecodecamp.org/news/build-portfolio-website-react/",
          "publishedOn": "2021-06-21T18:15:53.000Z",
          "wordCount": 3729,
          "title": "How to Build a Portfolio Website with React"
        },
        {
          "id": "60cda7104dc1a607ed7b5588",
          "author": null,
          "description": "Figma is a powerful design tool that helps you to create anything: websites, applications, logos, and much more. By learning to use Figma, you'll take your first steps into User Interface Design and and User Experience Design. These skills are essential for building a great portfolio for yourself and potentially",
          "link": "https://www.freecodecamp.org/news/figma-crash-course/",
          "publishedOn": "2021-06-21T17:52:21.000Z",
          "wordCount": 1194,
          "title": "What is Figma? A Design Crash Course [2021 Tutorial]"
        },
        {
          "id": "60a55b37906c5207e3a7ea78",
          "author": null,
          "description": "But where do you store your application's content? Storing the content on the blockchain would be expensive and inefficient. Your blockchain application needs decentralized storage!",
          "link": "https://www.freecodecamp.org/news/technical-guide-to-ipfs-decentralized-storage-of-web3/",
          "publishedOn": "2021-06-21T16:38:36.000Z",
          "wordCount": 3575,
          "title": "A Technical Guide to IPFS – the Decentralized Storage of Web3"
        },
        {
          "id": "6063b9e19618b008528a9d9a",
          "author": null,
          "description": "Today we're gonna learn everything you need to know about the CSS position property along with examples. Let's get started 🎖️ Table of contents What is CSS Position Property?What is the Static Position in CSS?What are the Relative and Absolute Positions in CSS?What is the Fixed Position in",
          "link": "https://www.freecodecamp.org/news/css-position-property-explained/",
          "publishedOn": "2021-06-21T16:36:14.000Z",
          "wordCount": 1153,
          "title": "How the CSS Position Property Works – Explained with Code Examples"
        },
        {
          "id": "60b46dbd11ffb70827ef9dea",
          "author": null,
          "description": "What is TCP?TCP is an acronym for Transmission Control Protocol. It is a transport layer protocol that allows packets to be sent from one location to another.  TCP is a connection-oriented protocol, which means it establishes the connection before any communication between the network’s computer units. Because we",
          "link": "https://www.freecodecamp.org/news/tcp-vs-udp-which-is-faster/",
          "publishedOn": "2021-06-18T15:45:00.000Z",
          "wordCount": 1613,
          "title": "TCP vs UDP – Which Protocol is Faster?"
        },
        {
          "id": "60cc5a904dc1a607ed7b4c54",
          "author": null,
          "description": "Today, you don’t need to go to a university or a college to pursue a career in machine learning or any data-driven domain. But you do need a plan and a roadmap to guide your studies. Once you have charted your own learning roadmap with a goal in mind,",
          "link": "https://www.freecodecamp.org/news/machine-learning-specialisation-courses-for-advanced-ml-practitioners/",
          "publishedOn": "2021-06-18T15:43:56.000Z",
          "wordCount": 906,
          "title": "Machine Learning Specialisation Courses for Advanced ML Practitioners"
        },
        {
          "id": "60cca3294dc1a607ed7b4c76",
          "author": null,
          "description": "Every programming language uses sorting algorithms. While programming languages have easy-to-use sorting methods, it can be helpful to understand how they work. We just released a course on the freeCodeCamp.org YouTube channel that will teach you some of the most popular sorting algorithms! Haris Iftikhar developed this course. Haris",
          "link": "https://www.freecodecamp.org/news/understanding-sorting-algorithms/",
          "publishedOn": "2021-06-18T13:56:04.000Z",
          "wordCount": 13842,
          "title": "Understanding Sorting Algorithms"
        },
        {
          "id": "60c2aa56d3126007592d6226",
          "author": null,
          "description": "What is the Azure AI Fundamentals Certification?The Azure AI Fundamentals Certification is for those seeking a Machine Learning role such as AI Engineer or Data Scientist. In the last decade companies have been collecting vast amount of data surrounding their service and product offerings. The successful companies of the",
          "link": "https://www.freecodecamp.org/news/azure-data-fundamentals-certification-ai-900-pass-the-exam-with-this-free-4-hour-course/",
          "publishedOn": "2021-06-17T12:02:47.000Z",
          "wordCount": 566,
          "title": "Azure AI Fundamentals Certification (AI-900) – Pass the Exam With This Free 4 Hour Course"
        },
        {
          "id": "60c88bbc4dc1a607ed7b2ffa",
          "author": null,
          "description": "Bookmarklets are browser bookmarks that execute JavaScript instead of opening a webpage. They're also known as bookmark applets, favlets, or JavaScript bookmarks. Bookmarklets are natively available in all major browsers, including Mozilla Firefox and Chromium-based browsers like Chrome or Brave. Scripting with JavaScriptLearning how to write scripts provides many benefits,",
          "link": "https://www.freecodecamp.org/news/what-are-bookmarklets/",
          "publishedOn": "2021-06-17T00:53:04.000Z",
          "wordCount": 1952,
          "title": "What are Bookmarklets and How to Make Them"
        },
        {
          "id": "60c088e5d3126007592d56f1",
          "author": null,
          "description": "In general, a string represents a sequence of characters in a programming language.  Let's look at an example of a string created using a sequence of characters, \"Yes, You Can DO It!\". In JavaScript, we can create a string in a couple of ways: Using the string literal as a",
          "link": "https://www.freecodecamp.org/news/javascript-split-how-to-split-a-string-into-an-array-in-js/",
          "publishedOn": "2021-06-16T21:19:08.000Z",
          "wordCount": 1696,
          "title": "JavaScript Split – How to Split a String into an Array in JS"
        },
        {
          "id": "60b8cb0aacb62507dd1d82ea",
          "author": null,
          "description": "In this article, I'll explain two important concepts in statistics: skewness and kurtosis. And don't worry – you won't need to know very much math to understand these concepts and learn how to apply them. What are Density Curves?Let's first talk a bit about density curves, as skewness and kurtosis",
          "link": "https://www.freecodecamp.org/news/skewness-and-kurtosis-in-statistics-explained/",
          "publishedOn": "2021-06-16T20:56:49.000Z",
          "wordCount": 2502,
          "title": "Skewness and Kurtosis – Positively Skewed and Negatively Skewed Distributions in Statistics Explained"
        },
        {
          "id": "60ca25704dc1a607ed7b408c",
          "author": null,
          "description": "Here's a list of amazing tricks that you can use to improve your React applications instantly. These tips will not only make your code cleaner and more reliable, but they also aim to make your development experience easier and overall more enjoyable.  Give these techniques a try in your React",
          "link": "https://www.freecodecamp.org/news/build-better-react-apps-with-these-tricks/",
          "publishedOn": "2021-06-16T20:55:03.000Z",
          "wordCount": 1525,
          "title": "Build Better React Apps with These Simple Tricks"
        },
        {
          "id": "60ca30af4dc1a607ed7b4197",
          "author": null,
          "description": "You can learn the basics of Data Analytics with 30 days of practice.  We just released a Data Analytics course on the freeCodeCamp.org YouTube channel. The course includes a 40-minute video, as well as a website and Jupyter notebooks. If you follow the plan laid out in these course",
          "link": "https://www.freecodecamp.org/news/teach-yourself-data-analytics-in-30-days/",
          "publishedOn": "2021-06-16T17:19:31.000Z",
          "wordCount": 411,
          "title": "Teach Yourself Data Analytics in 30 Days"
        }
      ]
    }
  ],
  "cliVersion": "1.11.0"
}