{
  "sources": [
    {
      "title": "CSS-Tricks",
      "feedUrl": "https://css-tricks.com/feed/",
      "siteUrl": "https://css-tricks.com",
      "articles": [
        {
          "id": "https://css-tricks.com/?p=374775",
          "author": "Geoff Graham",
          "description": "Sacha Greif openly wondered whether CSS has gotten to be, you know, too big. With all the goodies that’ve shipped in browsers the past couple of years — container queries! relative color syntax! cascade layers! logical properties…\nWhat CSS Do You Absolutely Have to Know in 2022? originally published on CSS-Tricks, which is part of the DigitalOcean family. You should get the newsletter.",
          "link": "https://css-tricks.com/what-css-do-you-absolutely-have-to-know-in-2022/",
          "publishedOn": "2022-11-08T13:51:48.000Z",
          "wordCount": 1572,
          "title": "What CSS Do You Absolutely Have to Know in 2022?",
          "imageUrl": "https://css-tricks.com/wp-json/social-image-generator/v1/image/374775"
        },
        {
          "id": "https://css-tricks.com/?p=374910",
          "author": "Ganesh Dahal",
          "description": "The way we write CSS for WordPress themes is in the midst of sweeping changes. I recently shared a technique for adding fluid type support in WordPress by way of theme.json, a new file that WordPress has been pushing …\nManaging CSS Styles in a WordPress Block Theme originally published on CSS-Tricks, which is part of the DigitalOcean family. You should get the newsletter.",
          "link": "https://css-tricks.com/managing-css-styles-in-a-wordpress-block-theme/",
          "publishedOn": "2022-11-07T14:05:11.000Z",
          "wordCount": 4131,
          "title": "Managing CSS Styles in a WordPress Block Theme",
          "imageUrl": "https://css-tricks.com/wp-json/social-image-generator/v1/image/374910"
        },
        {
          "id": "https://css-tricks.com/?p=374894",
          "author": "Geoff Graham",
          "description": "“A change to overflow on replaced elements in CSS”:\nFrom Chrome 108, the following replaced elements respect the overflow property: img, video and canvas. In earlier versions of Chrome, this property was ignored on these elements.\nThis \n…\nA Couple Changes Coming in Chrome 108 originally published on CSS-Tricks, which is part of the DigitalOcean family. You should get the newsletter.",
          "link": "https://css-tricks.com/a-couple-changes-coming-in-chrome-108/",
          "publishedOn": "2022-11-04T13:13:08.000Z",
          "wordCount": 1282,
          "title": "A Couple Changes Coming in Chrome 108",
          "imageUrl": "https://css-tricks.com/wp-json/social-image-generator/v1/image/374894"
        },
        {
          "id": "https://css-tricks.com/?p=374731",
          "author": "Aisha Bukar",
          "description": "Web Sockets, Web Workers, Service Workers… these are terms you may have read or overheard. Maybe not all of them, but likely at least one of them. And even if you have a good handle on front-end development, there’s a …\nThe Difference Between Web Sockets, Web Workers, and Service Workers originally published on CSS-Tricks, which is part of the DigitalOcean family. You should get the newsletter.",
          "link": "https://css-tricks.com/the-difference-between-web-sockets-web-workers-and-service-workers/",
          "publishedOn": "2022-11-03T12:56:58.000Z",
          "wordCount": 2106,
          "title": "The Difference Between Web Sockets, Web Workers, and Service Workers",
          "imageUrl": "https://css-tricks.com/wp-json/social-image-generator/v1/image/374731"
        },
        {
          "id": "https://css-tricks.com/?p=374697",
          "author": "Geoff Graham",
          "description": "Every once in a while, the blogging zeitgiest seems to coalesce around a certain topic and it’s like the saved articles in my bookmarks folder are having a conversation. The conversation sitting in there now is all about CSS Gradients …\nSome Links About CSS Gradients originally published on CSS-Tricks, which is part of the DigitalOcean family. You should get the newsletter.",
          "link": "https://css-tricks.com/some-links-about-css-gradients/",
          "publishedOn": "2022-11-02T12:59:02.000Z",
          "wordCount": 1215,
          "title": "Some Links About CSS Gradients",
          "imageUrl": "https://css-tricks.com/wp-json/social-image-generator/v1/image/374697"
        },
        {
          "id": "https://css-tricks.com/?p=374381",
          "author": "Manoj Kumar",
          "description": "This is a continuation of my last article about “Rendering External API Data in WordPress Blocks on the Front End”. In that last one, we learned how to take an external API and integrate it with a block that …\nRendering External API Data in WordPress Blocks on the Back End originally published on CSS-Tricks, which is part of the DigitalOcean family. You should get the newsletter.",
          "link": "https://css-tricks.com/rendering-external-api-data-in-wordpress-blocks-on-the-back-end/",
          "publishedOn": "2022-11-01T12:57:22.000Z",
          "wordCount": 2807,
          "title": "Rendering External API Data in WordPress Blocks on the Back End",
          "imageUrl": "https://css-tricks.com/wp-json/social-image-generator/v1/image/374381"
        },
        {
          "id": "https://css-tricks.com/?p=374670",
          "author": "Preethi Selvam",
          "description": "The Media Queries Level 4 specification has introduced a new syntax for targeting a range of viewport widths using common mathematical comparison operators, like , and =, that make more sense syntactically while writing less code for responsive web design.\nThe New CSS Media Query Range Syntax originally published on CSS-Tricks, which is part of the DigitalOcean family. You should get the newsletter.",
          "link": "https://css-tricks.com/the-new-css-media-query-range-syntax/",
          "publishedOn": "2022-10-31T13:05:38.000Z",
          "wordCount": 2557,
          "title": "The New CSS Media Query Range Syntax",
          "imageUrl": "https://css-tricks.com/wp-json/social-image-generator/v1/image/374670"
        },
        {
          "id": "https://css-tricks.com/?p=374302",
          "author": "Temani Afif",
          "description": "We’ve spent the last two articles in this three-part series playing with gradients to make really neat image decorations using nothing but the <img> element. In this third and final piece, we are going to explore more techniques using the …\nFancy Image Decorations: Outlines and Complex Animations originally published on CSS-Tricks, which is part of the DigitalOcean family. You should get the newsletter.",
          "link": "https://css-tricks.com/fancy-image-decorations-outlines-and-complex-animations/",
          "publishedOn": "2022-10-28T12:45:47.000Z",
          "wordCount": 1610,
          "title": "Fancy Image Decorations: Outlines and Complex Animations",
          "imageUrl": "https://css-tricks.com/wp-json/social-image-generator/v1/image/374302"
        },
        {
          "id": "https://css-tricks.com/?p=374609",
          "author": "Bradley Kouchi",
          "description": "Simon Goellner (@simeydotme)’s collection of Holographic Trading Cards have captured our attention.\nUnder the hood there is a suite of filter(), background-blend-mode(), mix-blend-mode(), and clip-path() combinations that have been painstakingly tweaked to reach the desired effect. I …\nHolographic Trading Card Effect originally published on CSS-Tricks, which is part of the DigitalOcean family. You should get the newsletter.",
          "link": "https://css-tricks.com/holographic-trading-card-effect/",
          "publishedOn": "2022-10-26T17:05:28.000Z",
          "wordCount": 665,
          "title": "Holographic Trading Card Effect",
          "imageUrl": "https://css-tricks.com/wp-json/social-image-generator/v1/image/374609"
        },
        {
          "id": "https://css-tricks.com/?p=374690",
          "author": "Brecht De Ruyte",
          "description": "The CSS :has() pseudo class is rolling out in many browsers with Chrome and Safari already fully supporting it. It’s often referred to it as “the parent selector” — as in, we can select style a parent element from a …\nCreating Animated, Clickable Cards With the :has() Relational Pseudo Class originally published on CSS-Tricks, which is part of the DigitalOcean family. You should get the newsletter.",
          "link": "https://css-tricks.com/creating-animated-clickable-cards-with-the-has-relational-pseudo-class/",
          "publishedOn": "2022-10-25T14:15:17.000Z",
          "wordCount": 2320,
          "title": "Creating Animated, Clickable Cards With the :has() Relational Pseudo Class",
          "imageUrl": "https://css-tricks.com/wp-json/social-image-generator/v1/image/374690"
        },
        {
          "id": "https://css-tricks.com/?p=374364",
          "author": "Sacha Greif",
          "description": "As front-end developers, we’ve wished for a lot of things over the years — ways to center things in CSS, encapsulate styles, set an element’s aspect ratio, get finer-grained control over our colors, select an element based on its children’s …\nIs There Too Much CSS Now? originally published on CSS-Tricks, which is part of the DigitalOcean family. You should get the newsletter.",
          "link": "https://css-tricks.com/is-there-too-much-css-now/",
          "publishedOn": "2022-10-24T12:59:16.000Z",
          "wordCount": 2239,
          "title": "Is There Too Much CSS Now?",
          "imageUrl": "https://css-tricks.com/wp-json/social-image-generator/v1/image/374364"
        },
        {
          "id": "https://css-tricks.com/?p=374194",
          "author": "Temani Afif",
          "description": "Welcome to Part 2 of this three-part series! We are still decorating images without any extra elements and pseudo-elements. I hope you already took the time to digest Part 1 because we will continue working with a lot of gradients …\nFancy Image Decorations: Masks and Advanced Hover Effects originally published on CSS-Tricks, which is part of the DigitalOcean family. You should get the newsletter.",
          "link": "https://css-tricks.com/fancy-image-decorations-masks-and-advanced-hover-effects/",
          "publishedOn": "2022-10-21T12:46:27.000Z",
          "wordCount": 2860,
          "title": "Fancy Image Decorations: Masks and Advanced Hover Effects",
          "imageUrl": "https://css-tricks.com/wp-json/social-image-generator/v1/image/374194"
        },
        {
          "id": "https://css-tricks.com/?p=374470",
          "author": "Geoff Graham",
          "description": "I love it when there’s a sense of synergy in the blogosphere. First, I caught Nick Heer’s coverage of Meta ending support for Instant Articles, its proprietary format for stripped-down performant news articles. He also compares it to the similar …\nInstant Articles, Proprietary Syndication, and a Web Built on User Fidelity Preferences originally published on CSS-Tricks, which is part of the DigitalOcean family. You should get the newsletter.",
          "link": "https://css-tricks.com/instant-articles-proprietary-syndication-user-fidelity-preferences/",
          "publishedOn": "2022-10-20T19:59:46.000Z",
          "wordCount": 1119,
          "title": "Instant Articles, Proprietary Syndication, and a Web Built on User Fidelity Preferences",
          "imageUrl": "https://css-tricks.com/wp-json/social-image-generator/v1/image/374470"
        },
        {
          "id": "https://css-tricks.com/?p=374345",
          "author": "Cassie Evans",
          "description": "Before I career jumped into development, I did a bunch of motion graphics work in After Effects. But even with that background, I still found animating on the web pretty baffling.\nVideo graphics are designed within a specific ratio and …\nResponsive Animations for Every Screen Size and Device originally published on CSS-Tricks, which is part of the DigitalOcean family. You should get the newsletter.",
          "link": "https://css-tricks.com/responsive-animations-for-every-screen-size-and-device/",
          "publishedOn": "2022-10-20T12:42:30.000Z",
          "wordCount": 3565,
          "title": "Responsive Animations for Every Screen Size and Device",
          "imageUrl": "https://css-tricks.com/wp-json/social-image-generator/v1/image/374345"
        },
        {
          "id": "https://css-tricks.com/?p=374376",
          "author": "Preethi",
          "description": "When you put something — say a regular sheet of paper — in a manilla folder, a part of that thing might peek out of the folder a little bit. The same sort of thing with a wallet and credit …\nHow to Make a Folder “Slit” Effect With CSS originally published on CSS-Tricks, which is part of the DigitalOcean family. You should get the newsletter.",
          "link": "https://css-tricks.com/how-to-make-a-folder-slit-effect-with-css/",
          "publishedOn": "2022-10-19T12:56:37.000Z",
          "wordCount": 1419,
          "title": "How to Make a Folder “Slit” Effect With CSS",
          "imageUrl": "https://css-tricks.com/wp-json/social-image-generator/v1/image/374376"
        },
        {
          "id": "https://css-tricks.com/?p=374466",
          "author": "Geoff Graham",
          "description": "By way of a post by Manuel Matuzović which is by way of a demo by Temani Afif.\n.wrapper {\n  margin-inline: max(0px, ((100% - 64rem) / 2)); \n}\nYou’d be doing yourself a favor to read Manuel’s breakdown of …\nManuel Matuzovic: max() Trickery originally published on CSS-Tricks, which is part of the DigitalOcean family. You should get the newsletter.",
          "link": "https://css-tricks.com/manuel-matuzovic-max-trickery/",
          "publishedOn": "2022-10-18T13:54:38.000Z",
          "wordCount": 940,
          "title": "Manuel Matuzovic: max() Trickery",
          "imageUrl": "https://css-tricks.com/wp-json/social-image-generator/v1/image/374466"
        },
        {
          "id": "https://css-tricks.com/?p=373600",
          "author": "Lu Wang",
          "description": "Are you a Bezier curve lover like I am?\nCodePen Embed Fallback\nBesides being elegant, Bezier curves have nice mathematical properties due to their definition and construction. No wonder they are widely used in so many areas:\nAs a \n…\nPure CSS Bezier Curve Motion Paths originally published on CSS-Tricks, which is part of the DigitalOcean family. You should get the newsletter.",
          "link": "https://css-tricks.com/pure-css-bezier-curve-motion-paths/",
          "publishedOn": "2022-10-17T15:30:05.000Z",
          "wordCount": 2406,
          "title": "Pure CSS Bezier Curve Motion Paths",
          "imageUrl": "https://css-tricks.com/wp-json/social-image-generator/v1/image/373600"
        },
        {
          "id": "https://css-tricks.com/?p=374393",
          "author": "Haley Mills",
          "description": "Well, hey, welcome back to Behind the CSScenes! These posts are like little check-ins we’re doing each month to give you a peek behind what we’re doing here at CSS-Tricks, as well as a chance for us to pause …\nBehind the CSScenes, October 2022 originally published on CSS-Tricks, which is part of the DigitalOcean family. You should get the newsletter.",
          "link": "https://css-tricks.com/behind-the-csscenes-october-2022/",
          "publishedOn": "2022-10-14T21:40:26.000Z",
          "wordCount": 1627,
          "title": "Behind the CSScenes, October 2022",
          "imageUrl": "https://css-tricks.com/wp-json/social-image-generator/v1/image/374393"
        },
        {
          "id": "https://css-tricks.com/?p=373965",
          "author": "Temani Afif",
          "description": "As the title says, we are going to decorate images! There’s a bunch of other articles out there that talk about this, but what we’re covering here is quite a bit different because it’s more of a challenge. The challenge? …\nFancy Image Decorations: Single Element Magic originally published on CSS-Tricks, which is part of the DigitalOcean family. You should get the newsletter.",
          "link": "https://css-tricks.com/fancy-image-decorations-single-element-magic/",
          "publishedOn": "2022-10-14T15:37:28.000Z",
          "wordCount": 3232,
          "title": "Fancy Image Decorations: Single Element Magic",
          "imageUrl": "https://css-tricks.com/wp-json/social-image-generator/v1/image/373965"
        },
        {
          "id": "https://css-tricks.com/?p=374401",
          "author": "Geoff Graham",
          "description": "An Event Apart 2022 Denver wrapped up yesterday. And while I was unable to make it to all three days this time, I did catch yesterday’s action — and it was awesome. I’m not very social or outgoing, but …\nSome Things I Took Away From An Event Apart 2022 in Denver originally published on CSS-Tricks, which is part of the DigitalOcean family. You should get the newsletter.",
          "link": "https://css-tricks.com/some-things-i-took-away-from-an-event-apart-2022-in-denver/",
          "publishedOn": "2022-10-13T20:01:00.000Z",
          "wordCount": 1872,
          "title": "Some Things I Took Away From An Event Apart 2022 in Denver",
          "imageUrl": "https://css-tricks.com/wp-json/social-image-generator/v1/image/374401"
        },
        {
          "id": "https://css-tricks.com/?p=373508",
          "author": "Krzysztof Gonciarz",
          "description": "Oftentimes in the past, I needed to figure out how to add styles to all elements inside the container but not the hovered one.\nDemo of the expected “fade-out” effect on siblings to let users “focus” on a particular element.…\nA Pure CSS Gallery Focus Effect with :not originally published on CSS-Tricks, which is part of the DigitalOcean family. You should get the newsletter.",
          "link": "https://css-tricks.com/a-pure-css-gallery-focus-effect-with-not/",
          "publishedOn": "2022-10-13T15:10:15.000Z",
          "wordCount": 1454,
          "title": "A Pure CSS Gallery Focus Effect with :not",
          "imageUrl": "https://css-tricks.com/wp-json/social-image-generator/v1/image/373508"
        },
        {
          "id": "https://css-tricks.com/?p=374330",
          "author": "Geoff Graham",
          "description": "We’re still in suuuuuper early days with container queries. Too early for broad browser support, but Chromium already supports it, Safari started supporting it in version 16, and Firefox is presumably not far behind.\nMost early days conversations …\nEarly Days of Container Style Queries originally published on CSS-Tricks, which is part of the DigitalOcean family. You should get the newsletter.",
          "link": "https://css-tricks.com/early-days-of-container-style-queries/",
          "publishedOn": "2022-10-12T13:06:46.000Z",
          "wordCount": 1400,
          "title": "Early Days of Container Style Queries",
          "imageUrl": "https://css-tricks.com/wp-json/social-image-generator/v1/image/374330"
        },
        {
          "id": "https://css-tricks.com/?p=373952",
          "author": "Manoj Kumar",
          "description": "There’ve been some new tutorials popping here on CSS-Tricks for working with WordPress blocks. One of them is an introduction to WordPress block development and it’s a good place to learn what blocks are and to register them in WordPress …\nRendering External API Data in WordPress Blocks on the Front End originally published on CSS-Tricks, which is part of the DigitalOcean family. You should get the newsletter.",
          "link": "https://css-tricks.com/rendering-external-api-data-in-wordpress-blocks-on-the-front-end/",
          "publishedOn": "2022-10-11T16:15:48.000Z",
          "wordCount": 2967,
          "title": "Rendering External API Data in WordPress Blocks on the Front End",
          "imageUrl": "https://css-tricks.com/wp-json/social-image-generator/v1/image/373952"
        }
      ]
    },
    {
      "title": "Articles on Smashing Magazine — For Web Designers And Developers",
      "feedUrl": "https://www.smashingmagazine.com/feed/",
      "siteUrl": "https://www.smashingmagazine.com/",
      "articles": [
        {
          "id": "https://smashingmagazine.com/2022/11/design-systems-inspiration-resources-case-studies/",
          "author": "hello@smashingmagazine.com (Cosima Mielke)",
          "description": "Everything design systems on accessibility, enterprise design systems, Figma kits, data visualization, motion design, multi-lingual design, naming, ROI calculator and UX writing.",
          "link": "https://smashingmagazine.com/2022/11/design-systems-inspiration-resources-case-studies/",
          "publishedOn": "2022-11-09T07:00:00.000Z",
          "wordCount": 5636,
          "title": "Design Systems: Useful Examples and Resources",
          "enclosure": {
            "url": "http://cloud.netlifyusercontent.com/assets/344dbf88-fdf9-42bb-adb4-46f01eedd629/02e0d4d1-43d3-4d9d-8d3d-ad10bcc22b2c/design-systems-inspiration-resources-case-studies.jpg",
            "length": "0",
            "type": "image/jpg"
          },
          "imageUrl": "http://cloud.netlifyusercontent.com/assets/344dbf88-fdf9-42bb-adb4-46f01eedd629/02e0d4d1-43d3-4d9d-8d3d-ad10bcc22b2c/design-systems-inspiration-resources-case-studies.jpg"
        },
        {
          "id": "https://smashingmagazine.com/2022/11/whats-new-nextjs-13/",
          "author": "hello@smashingmagazine.com (Atila Fassina)",
          "description": "Let’s talk about Next.js, one of the most well-known React frameworks used for production. From new components to font optimization, Atila shares a quick overview and invites you to join his [Advanced Next.js Masterclass](https://smashingconf.com/online-workshops/workshops/advanced-nextjs-atila-fassina) taking place later this month.",
          "link": "https://smashingmagazine.com/2022/11/whats-new-nextjs-13/",
          "publishedOn": "2022-11-07T14:00:00.000Z",
          "wordCount": 4009,
          "title": "What’s New In Next.js 13?",
          "enclosure": {
            "url": "http://cloud.netlifyusercontent.com/assets/344dbf88-fdf9-42bb-adb4-46f01eedd629/48e8a36f-2bd6-4fdf-8a56-acec206c23c8/whats-new-nextjs-13.jpg",
            "length": "0",
            "type": "image/jpg"
          },
          "imageUrl": "http://cloud.netlifyusercontent.com/assets/344dbf88-fdf9-42bb-adb4-46f01eedd629/48e8a36f-2bd6-4fdf-8a56-acec206c23c8/whats-new-nextjs-13.jpg"
        },
        {
          "id": "https://smashingmagazine.com/2022/11/practical-steps-build-transparency-remote-business/",
          "author": "hello@smashingmagazine.com (Siobhan McKeown)",
          "description": "Transparency is part of the fabric of many remote businesses. It doesn’t, however, come naturally to everyone, especially if you’ve only recently become remote. In this article, Siobhan takes you through some of the practical ways that you can build transparency within your organization.",
          "link": "https://smashingmagazine.com/2022/11/practical-steps-build-transparency-remote-business/",
          "publishedOn": "2022-11-04T09:00:00.000Z",
          "wordCount": 6369,
          "title": "Practical Steps To Build Transparency In Your Remote Business",
          "enclosure": {
            "url": "http://cloud.netlifyusercontent.com/assets/344dbf88-fdf9-42bb-adb4-46f01eedd629/c9ac3481-4133-40fb-bb5c-6ddf9fe04c03/practical-steps-build-transparency-remote-business.jpg",
            "length": "0",
            "type": "image/jpg"
          },
          "imageUrl": "http://cloud.netlifyusercontent.com/assets/344dbf88-fdf9-42bb-adb4-46f01eedd629/c9ac3481-4133-40fb-bb5c-6ddf9fe04c03/practical-steps-build-transparency-remote-business.jpg"
        },
        {
          "id": "https://smashingmagazine.com/2022/11/new-frontend-coding-ux-online-workshops/",
          "author": "hello@smashingmagazine.com (Iris Lješnjanin)",
          "description": "What’s the state of HTML Email, Vue.js and Next.js? Would you like to level up with modern CSS? What are new, smart interface design patterns we could use? Let’s figure it all out together with our [brand new online workshops](https://smashingconf.com/online-workshops/) alongside our free community meetups.",
          "link": "https://smashingmagazine.com/2022/11/new-frontend-coding-ux-online-workshops/",
          "publishedOn": "2022-11-03T07:00:00.000Z",
          "wordCount": 3276,
          "title": "New Smashing Front-End & UX Workshops",
          "enclosure": {
            "url": "http://cloud.netlifyusercontent.com/assets/344dbf88-fdf9-42bb-adb4-46f01eedd629/4f0edf42-4421-4e65-9a71-0a8bf3dc41b0/online-workshops-2022.png",
            "length": "0",
            "type": "image/png"
          },
          "imageUrl": "http://cloud.netlifyusercontent.com/assets/344dbf88-fdf9-42bb-adb4-46f01eedd629/4f0edf42-4421-4e65-9a71-0a8bf3dc41b0/online-workshops-2022.png"
        },
        {
          "id": "https://smashingmagazine.com/2022/11/navigation-design-mobile-ux/",
          "author": "hello@smashingmagazine.com (Vitaly Friedman)",
          "description": "When designing navigation on mobile, we don’t have to rely on slide-in-menus or nested accordions. We can also use the curtain design pattern, and show multiple levels of navigation at once.",
          "link": "https://smashingmagazine.com/2022/11/navigation-design-mobile-ux/",
          "publishedOn": "2022-11-02T14:00:00.000Z",
          "wordCount": 5887,
          "title": "Designing The Perfect Mobile Navigation UX",
          "enclosure": {
            "url": "http://cloud.netlifyusercontent.com/assets/344dbf88-fdf9-42bb-adb4-46f01eedd629/f4f71534-99d6-4c67-866b-808017f4c3a5/navigation-design-mobile-ux.jpg",
            "length": "0",
            "type": "image/jpg"
          },
          "imageUrl": "http://cloud.netlifyusercontent.com/assets/344dbf88-fdf9-42bb-adb4-46f01eedd629/f4f71534-99d6-4c67-866b-808017f4c3a5/navigation-design-mobile-ux.jpg"
        },
        {
          "id": "https://smashingmagazine.com/2022/11/graph-neo4j-graphql-library/",
          "author": "hello@smashingmagazine.com (William Lyon)",
          "description": "If building a GraphQL API backed by a native graph database sounds interesting or at all helpful for the problems you’re trying to solve as a developer, perhaps you’d like to give the open-source [Neo4j GraphQL Library](https://srv.buysellads.com/ads/long/x/TCZPLYDDTTTTTTFR6JINCTTTTTTGVUIVKKTTTTTTCT2NTYYTTTTTTI4BVH7U4JBCKQ466IDGV2IUWESGCV7WALL5QYYE) a try. Let’s take a closer look at the reasons why!",
          "link": "https://smashingmagazine.com/2022/11/graph-neo4j-graphql-library/",
          "publishedOn": "2022-11-01T11:00:00.000Z",
          "wordCount": 4667,
          "title": "Putting The Graph In GraphQL With The Neo4j GraphQL Library",
          "enclosure": {
            "url": "http://cloud.netlifyusercontent.com/assets/344dbf88-fdf9-42bb-adb4-46f01eedd629/7b065dae-2f88-4864-bd8e-db6c92b7beea/open-source-neo4j-graphql-library.jpg",
            "length": "0",
            "type": "image/jpg"
          },
          "imageUrl": "http://cloud.netlifyusercontent.com/assets/344dbf88-fdf9-42bb-adb4-46f01eedd629/7b065dae-2f88-4864-bd8e-db6c92b7beea/open-source-neo4j-graphql-library.jpg"
        },
        {
          "id": "https://smashingmagazine.com/2022/10/desktop-wallpaper-calendars-november-2022/",
          "author": "hello@smashingmagazine.com (Cosima Mielke)",
          "description": "November is just around the corner, and with it, a new collection of desktop wallpapers to celebrate the beginning of the month. Designed by creatives from all across the globe, they come in versions with and without a calendar. Let’s make November colorful!",
          "link": "https://smashingmagazine.com/2022/10/desktop-wallpaper-calendars-november-2022/",
          "publishedOn": "2022-10-31T09:00:00.000Z",
          "wordCount": 4895,
          "title": "On The Edge Of November (2022 Desktop Wallpapers Edition)",
          "enclosure": {
            "url": "http://cloud.netlifyusercontent.com/assets/344dbf88-fdf9-42bb-adb4-46f01eedd629/f9072044-e74a-4259-8b19-291d3382050a/nov-22-anbani-preview-opt.png",
            "length": "0",
            "type": "image/png"
          },
          "imageUrl": "http://cloud.netlifyusercontent.com/assets/344dbf88-fdf9-42bb-adb4-46f01eedd629/f9072044-e74a-4259-8b19-291d3382050a/nov-22-anbani-preview-opt.png"
        },
        {
          "id": "https://smashingmagazine.com/2022/10/advanced-animations-css/",
          "author": "hello@smashingmagazine.com (Yosra Emad)",
          "description": "In this article, Yosra Emad explains how to create a rollercoaster path that a ball follows using cubic beziers and CSS transitions. You’ll also learn how the cubic-bezier function in CSS works in detail and how to stack multiple simple animations to create one complex one.",
          "link": "https://smashingmagazine.com/2022/10/advanced-animations-css/",
          "publishedOn": "2022-10-29T12:00:00.000Z",
          "wordCount": 4628,
          "title": "How To Create Advanced Animations With CSS",
          "enclosure": {
            "url": "http://cloud.netlifyusercontent.com/assets/344dbf88-fdf9-42bb-adb4-46f01eedd629/a6ff543a-4e47-4649-8e1d-fda5435d9a53/4-advanced-animations-using-css.png",
            "length": "0",
            "type": "image/png"
          },
          "imageUrl": "http://cloud.netlifyusercontent.com/assets/344dbf88-fdf9-42bb-adb4-46f01eedd629/a6ff543a-4e47-4649-8e1d-fda5435d9a53/4-advanced-animations-using-css.png"
        },
        {
          "id": "https://smashingmagazine.com/2022/10/motion-controls-browser/",
          "author": "hello@smashingmagazine.com (Yaphi Berhanu)",
          "description": "If you've ever wanted to build a web app that you can control with hand gestures as if by magic, this article is for you. With a couple of APIs and some JavaScript, you can build apps that behave like sorcery.",
          "link": "https://smashingmagazine.com/2022/10/motion-controls-browser/",
          "publishedOn": "2022-10-28T14:00:00.000Z",
          "wordCount": 4891,
          "title": "Motion Controls In The Browser",
          "enclosure": {
            "url": "http://res.cloudinary.com/indysigner/image/upload/v1666964645/motion-controls-browser_eenha4.jpg",
            "length": "0",
            "type": "image/jpg"
          },
          "imageUrl": "http://res.cloudinary.com/indysigner/image/upload/v1666964645/motion-controls-browser_eenha4.jpg"
        },
        {
          "id": "https://smashingmagazine.com/2022/10/typographic-hierarchies/",
          "author": "hello@smashingmagazine.com (Alma Hoffmann)",
          "description": "In this article, Alma Hoffmann discusses six basic variables to establish a typographic hierarchy, explains how to look at each differently, and in turn, designs pieces by intentionally modifying each variable to create a typographic hierarchy effectively.",
          "link": "https://smashingmagazine.com/2022/10/typographic-hierarchies/",
          "publishedOn": "2022-10-26T15:00:00.000Z",
          "wordCount": 8402,
          "title": "Typographic Hierarchies",
          "enclosure": {
            "url": "http://cloud.netlifyusercontent.com/assets/344dbf88-fdf9-42bb-adb4-46f01eedd629/8ed9186f-f287-412d-a930-0cd2ae7ae196/typographic-hierarchies.jpg",
            "length": "0",
            "type": "image/jpg"
          },
          "imageUrl": "http://cloud.netlifyusercontent.com/assets/344dbf88-fdf9-42bb-adb4-46f01eedd629/8ed9186f-f287-412d-a930-0cd2ae7ae196/typographic-hierarchies.jpg"
        },
        {
          "id": "https://smashingmagazine.com/2022/10/state-css-survey-2022/",
          "author": "hello@smashingmagazine.com (Lea Verou)",
          "description": "The annual survey for anyone who writes CSS, [State of CSS](https://stateofcss.com/), is nearing the end of its response period for 2022. The survey is available in many different languages while all questions are optional, i.e. reaching 100% completion is not required. Please do make sure to [join in](https://stateofcss.com/) — it will only take a few minutes.",
          "link": "https://smashingmagazine.com/2022/10/state-css-survey-2022/",
          "publishedOn": "2022-10-24T19:00:00.000Z",
          "wordCount": 3093,
          "title": "State Of CSS Survey: Influence The Future Of CSS",
          "enclosure": {
            "url": "http://cloud.netlifyusercontent.com/assets/344dbf88-fdf9-42bb-adb4-46f01eedd629/72b32b88-9b48-4c44-95f3-d51b26923bde/state-css-survey-2022.jpg",
            "length": "0",
            "type": "image/jpg"
          },
          "imageUrl": "http://cloud.netlifyusercontent.com/assets/344dbf88-fdf9-42bb-adb4-46f01eedd629/72b32b88-9b48-4c44-95f3-d51b26923bde/state-css-survey-2022.jpg"
        },
        {
          "id": "https://smashingmagazine.com/2022/10/futuristic-css/",
          "author": "hello@smashingmagazine.com (Sacha Greif)",
          "description": "In this article, Sacha Greif tries to anticipate future CSS trends and takes a look at some far-fetched and futuristic CSS features that might one day make their way to the browser.",
          "link": "https://smashingmagazine.com/2022/10/futuristic-css/",
          "publishedOn": "2022-10-21T12:00:00.000Z",
          "wordCount": 4506,
          "title": "Futuristic CSS",
          "enclosure": {
            "url": "http://cloud.netlifyusercontent.com/assets/344dbf88-fdf9-42bb-adb4-46f01eedd629/57790dc2-f3f7-474d-b84e-531a37a1aa5e/futuristic-css.jpg",
            "length": "0",
            "type": "image/jpg"
          },
          "imageUrl": "http://cloud.netlifyusercontent.com/assets/344dbf88-fdf9-42bb-adb4-46f01eedd629/57790dc2-f3f7-474d-b84e-531a37a1aa5e/futuristic-css.jpg"
        },
        {
          "id": "https://smashingmagazine.com/2022/10/devtools-updates-halloween-edition/",
          "author": "hello@smashingmagazine.com (Patrick Brosset)",
          "description": "In this article, Patrick Brosset gives an update on the most impactful new features that are now available in DevTools, across Firefox, Chrome, Safari, and Edge.",
          "link": "https://smashingmagazine.com/2022/10/devtools-updates-halloween-edition/",
          "publishedOn": "2022-10-20T14:00:00.000Z",
          "wordCount": 4954,
          "title": "What’s New In DevTools: Halloween Edition 🎃",
          "enclosure": {
            "url": "http://cloud.netlifyusercontent.com/assets/344dbf88-fdf9-42bb-adb4-46f01eedd629/dbfdc666-af60-48cf-9c7c-c9a1eb8ecb34/devtools-updates-oct-2022.jpg",
            "length": "0",
            "type": "image/jpg"
          },
          "imageUrl": "http://cloud.netlifyusercontent.com/assets/344dbf88-fdf9-42bb-adb4-46f01eedd629/dbfdc666-af60-48cf-9c7c-c9a1eb8ecb34/devtools-updates-oct-2022.jpg"
        },
        {
          "id": "https://smashingmagazine.com/2022/10/understanding-privacy-book-release/",
          "author": "hello@smashingmagazine.com (Vitaly Friedman)",
          "description": "Meet Understanding Privacy, our brand new Smashing Book to make sense of privacy, and learn how to create inclusive, safe and privacy-aware digital experiences. eBook now available, print shipping in November.",
          "link": "https://smashingmagazine.com/2022/10/understanding-privacy-book-release/",
          "publishedOn": "2022-10-19T12:45:00.000Z",
          "wordCount": 3841,
          "title": "Understanding Privacy: A New Smashing Book Is Here",
          "enclosure": {
            "url": "http://cloud.netlifyusercontent.com/assets/344dbf88-fdf9-42bb-adb4-46f01eedd629/3509bd84-1307-4bb5-a00f-1b9da09b8acb/understanding-privacy-banner-opt.png",
            "length": "0",
            "type": "image/png"
          },
          "imageUrl": "http://cloud.netlifyusercontent.com/assets/344dbf88-fdf9-42bb-adb4-46f01eedd629/3509bd84-1307-4bb5-a00f-1b9da09b8acb/understanding-privacy-banner-opt.png"
        },
        {
          "id": "https://smashingmagazine.com/2022/10/wordpress-full-site-editing/",
          "author": "hello@smashingmagazine.com (Nick Schäferhoff)",
          "description": "In this article, Nick Schäferhoff will take a deep dive into WordPress Full-Site Editing, examine the tools it provides for theme development, and provide a tutorial on how to use it to make changes to your site.",
          "link": "https://smashingmagazine.com/2022/10/wordpress-full-site-editing/",
          "publishedOn": "2022-10-17T12:00:00.000Z",
          "wordCount": 8369,
          "title": "WordPress Full-Site Editing: A Deep Dive Into The New Feature",
          "enclosure": {
            "url": "http://cloud.netlifyusercontent.com/assets/344dbf88-fdf9-42bb-adb4-46f01eedd629/e92a7c2c-7748-4eb9-8ab8-6a534ad201e0/wordpress-full-site-editing.jpg",
            "length": "0",
            "type": "image/jpg"
          },
          "imageUrl": "http://cloud.netlifyusercontent.com/assets/344dbf88-fdf9-42bb-adb4-46f01eedd629/e92a7c2c-7748-4eb9-8ab8-6a534ad201e0/wordpress-full-site-editing.jpg"
        },
        {
          "id": "https://smashingmagazine.com/2022/10/effective-communication-everyday-meetings/",
          "author": "hello@smashingmagazine.com (Andrii Zhdan)",
          "description": "In this article about conducting productive meetings, Andrii Zhdan will give you a step-by-step guide on preparing a solid meeting structure that will let you follow the original plan and reach the meeting goals, and he will also share a few tips based on his design experience.",
          "link": "https://smashingmagazine.com/2022/10/effective-communication-everyday-meetings/",
          "publishedOn": "2022-10-13T15:00:00.000Z",
          "wordCount": 6170,
          "title": "Effective Communication For Everyday Meetings",
          "enclosure": {
            "url": "http://cloud.netlifyusercontent.com/assets/344dbf88-fdf9-42bb-adb4-46f01eedd629/e3c62052-4769-4a7d-8473-828a3e05ff74/effective-communication-everyday-meetings.jpg",
            "length": "0",
            "type": "image/jpg"
          },
          "imageUrl": "http://cloud.netlifyusercontent.com/assets/344dbf88-fdf9-42bb-adb4-46f01eedd629/e3c62052-4769-4a7d-8473-828a3e05ff74/effective-communication-everyday-meetings.jpg"
        },
        {
          "id": "https://smashingmagazine.com/2022/10/sustainable-web-development-strategies-organization/",
          "author": "hello@smashingmagazine.com (Michelle Barker)",
          "description": "Climate change and sustainability are increasing concerns for digital organizations, as well as individuals working in tech. In this article we’ll explore some of the ways we can raise awareness and effect change within an organization, to create a more positive environmental impact.",
          "link": "https://smashingmagazine.com/2022/10/sustainable-web-development-strategies-organization/",
          "publishedOn": "2022-10-11T15:30:00.000Z",
          "wordCount": 4997,
          "title": "Sustainable Web Development Strategies Within An Organization",
          "enclosure": {
            "url": "http://cloud.netlifyusercontent.com/assets/344dbf88-fdf9-42bb-adb4-46f01eedd629/9507c0d1-3621-43ae-9996-0f85fe77dbef/sustainable-web-development-strategies-organization.jpg",
            "length": "0",
            "type": "image/jpg"
          },
          "imageUrl": "http://cloud.netlifyusercontent.com/assets/344dbf88-fdf9-42bb-adb4-46f01eedd629/9507c0d1-3621-43ae-9996-0f85fe77dbef/sustainable-web-development-strategies-organization.jpg"
        }
      ]
    },
    {
      "title": "freeCodeCamp.org",
      "feedUrl": "https://www.freecodecamp.org/news/rss/",
      "siteUrl": "https://www.freecodecamp.org/news/",
      "articles": [
        {
          "id": "https://www.freecodecamp.org/news/aws-lambda-rds/",
          "author": "Mugilan Ragupathi",
          "description": "In this article, we're going to learn about how to communicate with AWS RDS from AWS Lambda.  In this tutorial, we'll be using AWS CDK. It's an open source software development framework that lets you define cloud infrastructure.  AWS CDK supports many languages including TypeScript, Python, C#, Java",
          "link": "https://www.freecodecamp.org/news/aws-lambda-rds/",
          "publishedOn": "2022-11-09T23:22:38.000Z",
          "wordCount": 3131,
          "title": "How to Connect to AWS RDS from AWS Lambda",
          "imageUrl": "https://www.freecodecamp.org/news/content/images/2022/11/AWS-Lambda-RDS-Proxy-1.png"
        },
        {
          "id": "https://www.freecodecamp.org/news/solid-principles-for-programming-and-software-design/",
          "author": "Joel Olawanle",
          "description": "Robert C. Martin [https://en.wikipedia.org/wiki/Robert_C._Martin] – also known as Uncle Bob – is a well-known American software engineer. He's the author of the bestselling books Clean Code and Clean Architecture. In 2000, he wrote a paper titled Design Principles and Design Patterns [https://web.archive.org/web/20150906155800/http:/www.objectmentor.com/resources/articles/Principles_and_Patterns.pdf]  where he introduced some principles to help",
          "link": "https://www.freecodecamp.org/news/solid-principles-for-programming-and-software-design/",
          "publishedOn": "2022-11-09T22:43:45.000Z",
          "wordCount": 3283,
          "title": "SOLID Principles for Programming and Software Design",
          "imageUrl": "https://www.freecodecamp.org/news/content/images/2022/11/Untitled1.drawio--1-.png"
        },
        {
          "id": "https://www.freecodecamp.org/news/how-to-download-application-fast-on-manjaro-linux/",
          "author": "Md. Fahim Bin Amin",
          "description": "If you are running Linux OS, you've likely already heard about mirror repositories. According to Quora, > In Linux, a mirror is a copy of programs available for download. If you are close (in networking terms, maybe or maybe not geographically) to one of the mirror sites listed, you might",
          "link": "https://www.freecodecamp.org/news/how-to-download-application-fast-on-manjaro-linux/",
          "publishedOn": "2022-11-09T18:57:33.000Z",
          "wordCount": 1411,
          "title": "How to Download Applications Fast Using Mirrors On Manjaro Linux",
          "imageUrl": "https://www.freecodecamp.org/news/content/images/2022/11/1631592932_Manjaro-Linux-211-with-fresh-desktop-environments.png"
        },
        {
          "id": "https://www.freecodecamp.org/news/improve-you-cybersecurity-command-line-skills-bandit-overthewire-game-walkthrough/",
          "author": "Beau Carnes",
          "description": "CTFs and Wargames can help people their improve command line and hacking skills.  The Bandit wargame from OverTheWire is aimed at absolute beginners. It is a game you connect to through SSH that will help you will improve your command line skills, your linux skills, and you hacker skills.",
          "link": "https://www.freecodecamp.org/news/improve-you-cybersecurity-command-line-skills-bandit-overthewire-game-walkthrough/",
          "publishedOn": "2022-11-09T16:17:46.000Z",
          "wordCount": 993,
          "title": "Improve Your Cybersecurity Command Line Skills – Bandit OverTheWire Game Walkthrough",
          "imageUrl": "https://www.freecodecamp.org/news/content/images/2022/11/new.png"
        },
        {
          "id": "https://www.freecodecamp.org/news/microservices-and-software-system-design-course/",
          "author": "Beau Carnes",
          "description": "A microservices architecture is a type of application architecture where the application is developed as a collection of services. We just published a course on the freeCodeCamp.org YouTube channel that will teach you about microservice architecture and distributed systems using a hands-on approach.  Georgio from Kantan Coding teaches this",
          "link": "https://www.freecodecamp.org/news/microservices-and-software-system-design-course/",
          "publishedOn": "2022-11-09T15:59:58.000Z",
          "wordCount": 811,
          "title": "Microservices and Software System Design Course",
          "imageUrl": "https://www.freecodecamp.org/news/content/images/2022/11/microservices.png"
        },
        {
          "id": "https://www.freecodecamp.org/news/error-cannot-find-module-node-npm-error-solved/",
          "author": "Kolade Chris",
          "description": "If you’re a developer that works with Node JS and JavaScript libraries and frameworks like React, Vue, and Angular, then you might have encountered the \"Error: cannot find module\" error. In this article, I’m going to show you how to fix the error. Why the \"Error: cannot find module\" Occurs",
          "link": "https://www.freecodecamp.org/news/error-cannot-find-module-node-npm-error-solved/",
          "publishedOn": "2022-11-09T15:37:57.000Z",
          "wordCount": 1058,
          "title": "Error: cannot find module [Node npm Error Solved]",
          "imageUrl": "https://www.freecodecamp.org/news/content/images/2022/11/factory-4757647_1280.jpg"
        },
        {
          "id": "https://www.freecodecamp.org/news/how-to-write-unit-tests-in-react-redux/",
          "author": "Matthes Bär",
          "description": "In this step-by-step tutorial, you'll learn how to easily start with Unit Tests in React. You'll learn how to write tests for Redux states as well as fundamental Redux slice tests using the React Testing Library and Jest. 🔐 Here's What We'll Cover  * You'll see how easy it",
          "link": "https://www.freecodecamp.org/news/how-to-write-unit-tests-in-react-redux/",
          "publishedOn": "2022-11-09T15:32:10.000Z",
          "wordCount": 8161,
          "title": "How to Write Unit Tests in React – Basic Redux Toolkit Testing Included",
          "imageUrl": "https://www.freecodecamp.org/news/content/images/2022/11/pexels-scott-webb-1527893.jpg"
        },
        {
          "id": "https://www.freecodecamp.org/news/generate-images-using-react-and-dall-e-api-react-and-openai-api-tutorial/",
          "author": "Nishant Kumar",
          "description": "Hey everyone! OpenAI just released its DALL-E API where users can generate custom images by just typing in a query.  So in this tutorial, you'll learn how to integrate the OpenAI DALL-E 2 API with a React app. But First, How Does Dall-E Work? So as you already know,",
          "link": "https://www.freecodecamp.org/news/generate-images-using-react-and-dall-e-api-react-and-openai-api-tutorial/",
          "publishedOn": "2022-11-08T20:22:16.000Z",
          "wordCount": 1834,
          "title": "How to Generate Images using React and the Dall-E 2 API – React and OpenAI API Tutorial",
          "imageUrl": "https://www.freecodecamp.org/news/content/images/2022/11/Important-Concepts-and-questions--1-.png"
        },
        {
          "id": "https://www.freecodecamp.org/news/how-to-learn-linux-terminal-as-a-beginner/",
          "author": "Arunachalam B",
          "description": "In 2017, I bought a new laptop and switched to Linux. I started off with Ubuntu (but jumped to Elementary [https://elementary.io/] later), as most people suggested it was beginner friendly.  People also suggested that I should get used to using the keyboard and terminal over a mouse to enjoy",
          "link": "https://www.freecodecamp.org/news/how-to-learn-linux-terminal-as-a-beginner/",
          "publishedOn": "2022-11-07T21:25:11.000Z",
          "wordCount": 2715,
          "title": "How to Learn the Linux Terminal as a Beginner – Tips and Examples",
          "imageUrl": "https://www.freecodecamp.org/news/content/images/2022/10/10.-Linux-basic-commands---Brief.png"
        },
        {
          "id": "https://www.freecodecamp.org/news/toggle-elements-in-react-using-hooks/",
          "author": "Deji Adesoga",
          "description": "When building a web application, toggling an element is one of the key features you are likely to come across and may need to implement in your project. There are various ways you can toggle an element. In this article, we will take a look at how we can implement",
          "link": "https://www.freecodecamp.org/news/toggle-elements-in-react-using-hooks/",
          "publishedOn": "2022-11-07T18:26:54.000Z",
          "wordCount": 2588,
          "title": "How to Toggle an Element in React using React Hooks",
          "imageUrl": "https://www.freecodecamp.org/news/content/images/2022/11/Copy-of-Coffee-Tutorial-YouTube-Thumbnail--1-.png"
        },
        {
          "id": "https://www.freecodecamp.org/news/learn-css/",
          "author": "Jessica Wilkins",
          "description": "Cascading Style Sheets (CSS) represents the design for a web page. But when you are learning this information for the first time, it can be hard to keep track of all of the different CSS properties. In this article, I have created a study guide for the freeCodeCamp curriculum's entire",
          "link": "https://www.freecodecamp.org/news/learn-css/",
          "publishedOn": "2022-11-07T18:24:20.000Z",
          "wordCount": 4762,
          "title": "Learn CSS – Responsive Web Design Study Guide",
          "imageUrl": "https://www.freecodecamp.org/news/content/images/2022/07/kobu-agency-ipARHaxETRk-unsplash.jpg"
        },
        {
          "id": "https://www.freecodecamp.org/news/high-availability-fault-tolerance-and-disaster-recovery-explained/",
          "author": "Daniel Adetunji",
          "description": "High availability, fault tolerance and disaster recovery are important things to consider when designing a system.  These terms are sometimes used interchangeably by architects and developers. They are not, however, the same thing – and understanding the differences can save you many headaches, as well as time and money.",
          "link": "https://www.freecodecamp.org/news/high-availability-fault-tolerance-and-disaster-recovery-explained/",
          "publishedOn": "2022-11-07T17:10:24.000Z",
          "wordCount": 3341,
          "title": "High Availability vs Fault Tolerance vs Disaster Recovery – Explained with an Analogy",
          "imageUrl": "https://www.freecodecamp.org/news/content/images/2022/11/Slide6.JPG"
        },
        {
          "id": "https://www.freecodecamp.org/news/coercion-and-type-conversion-in-javascript/",
          "author": "Dillion Megida",
          "description": "Coercion is an automatic type conversion that occurs in JavaScript when you want to perform certain operations. I'll explain what coercion is in this article. What is Type Conversion? As the name implies, type conversion is the process of converting a value from one type to another. Values in JavaScript",
          "link": "https://www.freecodecamp.org/news/coercion-and-type-conversion-in-javascript/",
          "publishedOn": "2022-11-07T17:03:46.000Z",
          "wordCount": 2109,
          "title": "Coercion and Type Conversion in JavaScript – Explained with Code Examples",
          "imageUrl": "https://www.freecodecamp.org/news/content/images/2022/11/4.-coercion.png"
        },
        {
          "id": "https://www.freecodecamp.org/news/typeerror-module-object-is-not-callable-python-error-solved/",
          "author": "Ihechikara Vincent Abba",
          "description": "In this article, we'll talk about the \"TypeError: 'module' object is not callable\" error in Python.  We'll start by defining some of the keywords found in the error message — module  and callable.  You'll then see some examples that raise the error, and how to fix it.",
          "link": "https://www.freecodecamp.org/news/typeerror-module-object-is-not-callable-python-error-solved/",
          "publishedOn": "2022-11-04T22:17:35.000Z",
          "wordCount": 1477,
          "title": "TypeError: module object is not callable [Python Error Solved]",
          "imageUrl": "https://www.freecodecamp.org/news/content/images/2022/11/brett-jordan-XWar9MbNGUY-unsplash--1-.jpg"
        },
        {
          "id": "https://www.freecodecamp.org/news/tailwind-css-landing-pages-and-themes-for-busy-developers/",
          "author": "Edan Ben-Atar",
          "description": "Developers across all levels of experience spend hours hunched over their computers, trying to translate the UI designer's ideas into a functional website or application. Considering that you're reading this, chances are that this is a pretty relatable scenario for you. And you know all too well just how tedious",
          "link": "https://www.freecodecamp.org/news/tailwind-css-landing-pages-and-themes-for-busy-developers/",
          "publishedOn": "2022-11-04T21:44:34.000Z",
          "wordCount": 2120,
          "title": "Tailwind CSS Landing Page Themes for Busy Developers",
          "imageUrl": "https://www.freecodecamp.org/news/content/images/2022/11/pexels-gdtography-911758.jpg"
        },
        {
          "id": "https://www.freecodecamp.org/news/sql-case-statement/",
          "author": "Sule-Balogun Olanrewaju Ganiu",
          "description": "Writing SQL with multiple conditions can be an arduous task, especially if you need to make numerous checks.  For example, an if () else if () else {} check case expression handles all SQL conditionals. If the first condition is satisfied, the query stops executing with a return value.",
          "link": "https://www.freecodecamp.org/news/sql-case-statement/",
          "publishedOn": "2022-11-04T14:28:57.000Z",
          "wordCount": 2097,
          "title": "How to Use the SQL CASE Statement – with Example Challenge",
          "imageUrl": "https://www.freecodecamp.org/news/content/images/2022/10/Sql-case-banner.jpg"
        },
        {
          "id": "https://www.freecodecamp.org/news/how-to-convert-a-string-to-an-integer-in-java/",
          "author": "Ihechikara Vincent Abba",
          "description": "When working with a programming language, you may want to convert strings to integers. An example would be performing a mathematical operation using the value of a string variable.  In this article, you'll learn how to convert a string to an integer in Java using two methods of the",
          "link": "https://www.freecodecamp.org/news/how-to-convert-a-string-to-an-integer-in-java/",
          "publishedOn": "2022-11-03T22:02:07.000Z",
          "wordCount": 1069,
          "title": "String to Int in Java – How to Convert a String to an Integer",
          "imageUrl": "https://www.freecodecamp.org/news/content/images/2022/11/marcel-eberle-rendLSpkDtY-unsplash.jpg"
        },
        {
          "id": "https://www.freecodecamp.org/news/how-to-lowercase-python-string/",
          "author": "Tantoluwa Heritage Alabi",
          "description": "A string is a datatype that consists of characters wrapped in quotation marks. These characters can be letters, symbols, or numbers.  In Python, there are different ways of working with strings. These methods are built-in functions that change the results of the string.  For instance, if I want",
          "link": "https://www.freecodecamp.org/news/how-to-lowercase-python-string/",
          "publishedOn": "2022-11-03T16:16:15.000Z",
          "wordCount": 3000,
          "title": "Python lower() – How to Lowercase a Python String with the tolower Function Equivalent",
          "imageUrl": "https://www.freecodecamp.org/news/content/images/2022/11/pexels-pixabay-278881.jpg"
        },
        {
          "id": "https://www.freecodecamp.org/news/how-to-format-number-as-currency-in-javascript-one-line-of-code/",
          "author": "Joel Olawanle",
          "description": "When you're working with data from an API or an external resource, you'll get these data in some general format. For example, if you are building a store, you might have data like price. This price data might be in the form of a general number such as 14340 or",
          "link": "https://www.freecodecamp.org/news/how-to-format-number-as-currency-in-javascript-one-line-of-code/",
          "publishedOn": "2022-11-03T15:29:55.000Z",
          "wordCount": 1618,
          "title": "How to Format a Number as Currency in JavaScript",
          "imageUrl": "https://www.freecodecamp.org/news/content/images/2022/11/cover-template--2-.jpeg"
        },
        {
          "id": "https://www.freecodecamp.org/news/typescript-for-react-developers/",
          "author": "Daniel Asta",
          "description": "If you've been using React for a while, you may have noticed times when the freedom and wild nature of JavaScript works against you (and not because of JS 😄). This can be especially true if you're working in a team. You may not know it, but you need TypeScript",
          "link": "https://www.freecodecamp.org/news/typescript-for-react-developers/",
          "publishedOn": "2022-11-03T15:00:03.000Z",
          "wordCount": 10125,
          "title": "TypeScript for React Developers – Why TypeScript is Useful and How it Works",
          "imageUrl": "https://www.freecodecamp.org/news/content/images/2022/10/typescript-cover.jpg"
        },
        {
          "id": "https://www.freecodecamp.org/news/quick-sort-algorithm-time-complexity-with-cpp-and-java-code/",
          "author": "Ihechikara Vincent Abba",
          "description": "In this article, you'll learn about one of the most commonly used programming algorithms – the quick sort algorithm.  You'll get to know how the algorithm works with the help of visual guides. You'll also see some code examples that will help you implement the algorithm in C++ and",
          "link": "https://www.freecodecamp.org/news/quick-sort-algorithm-time-complexity-with-cpp-and-java-code/",
          "publishedOn": "2022-11-03T00:43:11.000Z",
          "wordCount": 2528,
          "title": "Quick Sort – Algorithm Time Complexity with C++ and Java Code Example",
          "imageUrl": "https://www.freecodecamp.org/news/content/images/2022/11/kelly-sikkema-377gw1wN0Ic-unsplash.jpg"
        },
        {
          "id": "https://www.freecodecamp.org/news/javascript-minify-minifying-js-with-a-minifier-or-jsmin/",
          "author": "Dillion Megida",
          "description": "You might be wondering – what is minification and how does it improve your JavaScript applications? What tools can you use to minify your JS? I'll answer these questions in this article. What is Minification? Minification is the process of \"minimizing\" code by removing the irrelevant parts of the code.",
          "link": "https://www.freecodecamp.org/news/javascript-minify-minifying-js-with-a-minifier-or-jsmin/",
          "publishedOn": "2022-11-02T23:50:39.000Z",
          "wordCount": 1624,
          "title": "JavaScript Minify – Minifying JS with a Minifier or jsmin",
          "imageUrl": "https://www.freecodecamp.org/news/content/images/2022/11/3.-minifying-js.png"
        },
        {
          "id": "https://www.freecodecamp.org/news/typeerror-builtin-function-or-method-object-is-not-subscriptable-python-error-solved/",
          "author": "Kolade Chris",
          "description": "As the name suggests, the error TypeError: builtin_function_or_method object is not subscriptable is a “typeerror” that occurs when you try to call a built-in function the wrong way. When a \"typeerror\" occurs, the program is telling you that you’re mixing up types. That means, for example, you might be concatenating",
          "link": "https://www.freecodecamp.org/news/typeerror-builtin-function-or-method-object-is-not-subscriptable-python-error-solved/",
          "publishedOn": "2022-11-02T23:43:20.000Z",
          "wordCount": 1131,
          "title": "TypeError: builtin_function_or_method object is not subscriptable Python Error [SOLVED]",
          "imageUrl": "https://www.freecodecamp.org/news/content/images/2022/11/built_in_not_subable.png"
        },
        {
          "id": "https://www.freecodecamp.org/news/customer-segmentation-python-machine-learning/",
          "author": "Ibrahim Abayomi Ogunbiyi",
          "description": "Before I get into what this post is all about, I'd like to share the motivation that prompted me to write it.  I'm writing this article because I recall the first time I learned about customer segmentation or clustering. I didn't fully grasp what I was doing back then.",
          "link": "https://www.freecodecamp.org/news/customer-segmentation-python-machine-learning/",
          "publishedOn": "2022-11-02T18:56:39.000Z",
          "wordCount": 3363,
          "title": "How to Perform Customer Segmentation in Python – Machine Learning Tutorial",
          "imageUrl": "https://www.freecodecamp.org/news/content/images/2022/11/-GetPaidStock.com--635e3fa0c561f.jpg"
        },
        {
          "id": "https://www.freecodecamp.org/news/destructure-object-properties-using-array-map-in-react/",
          "author": "Caleb Olojo",
          "description": "One of the methods frontend developers use the most in JavaScript is the  Array.prototype.map() method.  From having to render a list of items in the DOM to looping through a series of blog posts – and many more – the usefulness goes on and on. Say you have",
          "link": "https://www.freecodecamp.org/news/destructure-object-properties-using-array-map-in-react/",
          "publishedOn": "2022-11-02T17:07:58.000Z",
          "wordCount": 1432,
          "title": "How to Destructure Object Properties Using array.map() in React",
          "imageUrl": "https://www.freecodecamp.org/news/content/images/2022/11/pexels-pixabay-276502.jpg"
        },
        {
          "id": "https://www.freecodecamp.org/news/build-an-effective-cyber-tabletop-exercise/",
          "author": "Aaron Katz",
          "description": "What is a cybersecurity tabletop exercise (TTX)? Cybersecurity breaches are resulting in an increasing number of losses ($4.2 million in 2021 [https://purplesec.us/resources/cyber-security-statistics/#Cybercrime]). So it's important to do as much as possible to prepare and train before experiencing a potential incident yourself.  A cybersecurity tabletop exercise (TTX) is one of",
          "link": "https://www.freecodecamp.org/news/build-an-effective-cyber-tabletop-exercise/",
          "publishedOn": "2022-11-02T16:41:13.000Z",
          "wordCount": 2389,
          "title": "How to Build an Effective Cyber Tabletop Exercise",
          "imageUrl": "https://www.freecodecamp.org/news/content/images/2022/11/pexels-fauxels-3183197.jpg"
        },
        {
          "id": "https://www.freecodecamp.org/news/typeerror-cant-multiply-sequence-by-non-int-of-type-float-solved-python-error/",
          "author": "Dionysia Lemonaki",
          "description": "In this article, you will learn what the Python error TypeError: can't multiply sequence by non-int of type float means. Firstly, I will explain why this error gets raised. You will also learn how to solve the error and how to avoid it in the first place. Here is what",
          "link": "https://www.freecodecamp.org/news/typeerror-cant-multiply-sequence-by-non-int-of-type-float-solved-python-error/",
          "publishedOn": "2022-11-02T16:36:15.000Z",
          "wordCount": 1534,
          "title": "TypeError: can't multiply sequence by non-int of type float [Solved Python Error]",
          "imageUrl": "https://www.freecodecamp.org/news/content/images/2022/10/pexels-pixabay-355948.jpg"
        },
        {
          "id": "https://www.freecodecamp.org/news/what-i-learned-as-a-hacktoberfest-repo-maintainer/",
          "author": "Jessica Wilkins",
          "description": "Hacktoberfest is a month long celebration of open source. And this year I participated as a maintainer for freeCodeCamp's Developer Quiz Site [https://github.com/freeCodeCamp/Developer_Quiz_Site]. I merged a total of 356 pull requests and helped a lot of new contributors get started with open source. We were able to add a total",
          "link": "https://www.freecodecamp.org/news/what-i-learned-as-a-hacktoberfest-repo-maintainer/",
          "publishedOn": "2022-11-02T16:17:06.000Z",
          "wordCount": 2431,
          "title": "What I Learned from Maintaining a Repo During Hacktoberfest and Merging 356 PRs",
          "imageUrl": "https://www.freecodecamp.org/news/content/images/2022/11/Screen-Shot-2022-10-31-at-5.56.25-PM.png"
        },
        {
          "id": "https://www.freecodecamp.org/news/microsoft-365-fundamentals-certification-ms-900-course/",
          "author": "Andrew Brown",
          "description": "You can learn everything you need to know to earn the Microsoft 365 Fundamentals Certification by completing this free 4-hour course. What is the Microsoft 365 Fundamentals? The Microsoft 365 Fundamentals is an entry level Microsoft certification into a broad amount of Microsoft Software-as-a-Service (SaaS) products. These Microsoft SaaS products",
          "link": "https://www.freecodecamp.org/news/microsoft-365-fundamentals-certification-ms-900-course/",
          "publishedOn": "2022-11-02T14:10:44.000Z",
          "wordCount": 1047,
          "title": "Microsoft 365 Fundamentals Certification (MS-900) – Pass the Exam With This Free 4-Hour Course",
          "imageUrl": "https://www.freecodecamp.org/news/content/images/2022/11/ms900.png"
        },
        {
          "id": "https://www.freecodecamp.org/news/event-delegation-javascript/",
          "author": "Dillion Megida",
          "description": "Event Delegation is a pattern based upon the concept of Event Bubbling [/news/event-bubbling-in-javascript/]. It is an event-handling pattern that allows you to handle events at a higher level in the DOM tree other than the level where the event was first received. There's a video version of this topic [https://www.youtube.com/watch?v=aZ3JWv0ofuA]",
          "link": "https://www.freecodecamp.org/news/event-delegation-javascript/",
          "publishedOn": "2022-11-01T17:58:39.000Z",
          "wordCount": 1381,
          "title": "Event Delegation in JavaScript –Explained with an Example",
          "imageUrl": "https://www.freecodecamp.org/news/content/images/2022/10/2.-event-delegation-js.png"
        },
        {
          "id": "https://www.freecodecamp.org/news/learn-full-stack-development-html-css-javascript-node-js-mongodb/",
          "author": "Beau Carnes",
          "description": "Full stack development is a term used to describe the process of developing a complete website or application from start to finish. A full stack developer is a web developer who can work on all parts of a website or application, from the back-end code that powers the site to",
          "link": "https://www.freecodecamp.org/news/learn-full-stack-development-html-css-javascript-node-js-mongodb/",
          "publishedOn": "2022-11-01T16:57:54.000Z",
          "wordCount": 1246,
          "title": "Learn Full Stack Development – HTML, CSS, JavaScript, Node.js, MongoDB",
          "imageUrl": "https://www.freecodecamp.org/news/content/images/2022/11/webdev.png"
        },
        {
          "id": "https://www.freecodecamp.org/news/how-to-handle-errors-in-python/",
          "author": "P S Mohammed Ali",
          "description": "> “It’s hard enough to find an error in your code when you’re looking for it; it’s even harder when you’ve assumed your code is error-free.” ― Steve McConnell Errors are inevitable in a programmer's life. In fact, while writing programs, errors can be really helpful in identifying the logic",
          "link": "https://www.freecodecamp.org/news/how-to-handle-errors-in-python/",
          "publishedOn": "2022-11-01T14:53:34.000Z",
          "wordCount": 1829,
          "title": "How to Handle Errors in Python – the try, except, else, and finally Keywords Explained",
          "imageUrl": "https://www.freecodecamp.org/news/content/images/2022/10/11.jpg"
        },
        {
          "id": "https://www.freecodecamp.org/news/event-bubbling-in-javascript/",
          "author": "Dillion Megida",
          "description": "HTML elements receive different types of events, from click, to blur, to scroll, and so on. One behavior these events have in common is Event Bubbling. I'll explain what this behavior means in this article. I also made a video version of this article which you can watch here [https://www.youtube.com/watch?v=KaHZdW02Tg0].",
          "link": "https://www.freecodecamp.org/news/event-bubbling-in-javascript/",
          "publishedOn": "2022-10-31T21:04:17.000Z",
          "wordCount": 1877,
          "title": "Event Bubbling in JavaScript – How Event Propagation Works with Examples",
          "imageUrl": "https://www.freecodecamp.org/news/content/images/2022/10/1.-event-bubbling-js.png"
        },
        {
          "id": "https://www.freecodecamp.org/news/python-typeerror-int-object-not-subscriptable-solved/",
          "author": "Kolade Chris",
          "description": "The Python error \"TypeError: 'int' object is not subscriptable\" occurs when you try to treat an integer like a subscriptable object. In Python, a subscriptable object is one you can “subscript” or iterate over. Why the \"TypeError: 'int' object is not subscriptable Error\" Occurs You can iterate over a string,",
          "link": "https://www.freecodecamp.org/news/python-typeerror-int-object-not-subscriptable-solved/",
          "publishedOn": "2022-10-31T17:37:23.000Z",
          "wordCount": 1298,
          "title": "TypeError: 'int' object is not subscriptable [Solved Python Error]",
          "imageUrl": "https://www.freecodecamp.org/news/content/images/2022/10/in_not_subable.png"
        },
        {
          "id": "https://www.freecodecamp.org/news/how-to-implement-infrastructure-as-code-with-aws/",
          "author": "Kayode Adeniyi",
          "description": "Infrastructure as code is the process of provisioning and managing your cloud resources by writing a template file that is both human-readable and machine consumable.  For AWS cloud development, the built-in choice for infrastructure as code is AWS CloudFormation. Using IaC, developers can manage a project’s infrastructure efficiently, allowing",
          "link": "https://www.freecodecamp.org/news/how-to-implement-infrastructure-as-code-with-aws/",
          "publishedOn": "2022-10-31T17:07:04.000Z",
          "wordCount": 1999,
          "title": "How to Implement Infrastructure as Code with AWS",
          "imageUrl": "https://www.freecodecamp.org/news/content/images/2022/10/network-g381392bcb_1280.jpg"
        },
        {
          "id": "https://www.freecodecamp.org/news/javascript-proxy-object/",
          "author": "Keyur Paralkar",
          "description": "In this tutorial, you are going to learn what a proxy object is, along with its limitations. We will also look into some of the use cases that demonstrate how you can use proxy objects to solve various problems. Without further ado, let’s get started. Table of Contents  *",
          "link": "https://www.freecodecamp.org/news/javascript-proxy-object/",
          "publishedOn": "2022-10-31T14:56:30.000Z",
          "wordCount": 2718,
          "title": "How JavaScript's Proxy Object Works – Explained with Example Use Cases",
          "imageUrl": "https://www.freecodecamp.org/news/content/images/2022/10/Image-defs.001-1.jpeg"
        },
        {
          "id": "https://www.freecodecamp.org/news/use-firebase-authentication-in-a-react-app/",
          "author": "Edeh Israel Chidera",
          "description": "Almost every web application requires some form of authentication. This prevents unauthorized users from having access to the app's inner workings.  In this tutorial, you will learn how to authenticate your React app with the Firebase SDK. How to Authenticate with Firebase Authenticating with Firebase makes things easy for",
          "link": "https://www.freecodecamp.org/news/use-firebase-authentication-in-a-react-app/",
          "publishedOn": "2022-10-31T14:54:20.000Z",
          "wordCount": 2360,
          "title": "How to Use Firebase Authentication in a React App",
          "imageUrl": "https://www.freecodecamp.org/news/content/images/2022/10/ferenc-almasi-tvHtIGbbjMo-unsplash.jpg"
        },
        {
          "id": "https://www.freecodecamp.org/news/tips-to-boost-your-seo/",
          "author": "Edan Ben-Atar",
          "description": "SEO (Search Engine Optimization) is essential for your online marketing strategy. It's the process of optimizing your site and content to help you get as much traffic as you can from search engines. Reaching top positions in the search engine results pages (SERPs) with your website is one of the",
          "link": "https://www.freecodecamp.org/news/tips-to-boost-your-seo/",
          "publishedOn": "2022-10-29T00:09:34.000Z",
          "wordCount": 2809,
          "title": "SEO Tips for Developers",
          "imageUrl": "https://www.freecodecamp.org/news/content/images/2022/04/10-Tips-to-Boost-Your-SEO.jpg"
        },
        {
          "id": "https://www.freecodecamp.org/news/learn-julia-by-coding-7-projects/",
          "author": "Logan Kilpatrick",
          "description": "The Julia programming language is used for a lot of really impactful and interesting challenges like Machine Learning and Data Science.  But before you can get to the complex stuff, it is worth exploring the basics to develop a solid foundation.  In this tutorial, we will go over",
          "link": "https://www.freecodecamp.org/news/learn-julia-by-coding-7-projects/",
          "publishedOn": "2022-10-28T23:54:26.000Z",
          "wordCount": 3824,
          "title": "Learn Julia by Coding 7 Projects – Hands-On Programming Tutorial",
          "imageUrl": "https://www.freecodecamp.org/news/content/images/2022/10/7-projects-1.png"
        },
        {
          "id": "https://www.freecodecamp.org/news/device-descriptor-request-failed-windows-error-solved/",
          "author": "Gavin Lon",
          "description": "Recently my uncle, who lives in Australia, sent my parents, who live in South Africa, a flash drive that was full of pictures of our Australian family getting up to various Australian activities.  But it was very frustrating for my poor Mom when her laptop would not recognise the",
          "link": "https://www.freecodecamp.org/news/device-descriptor-request-failed-windows-error-solved/",
          "publishedOn": "2022-10-28T23:49:33.000Z",
          "wordCount": 1962,
          "title": "Device Descriptor Request Failed – How to Fix Unknown USB Device Error in Windows 10",
          "imageUrl": "https://www.freecodecamp.org/news/content/images/2022/10/Screenshot1.jpg"
        },
        {
          "id": "https://www.freecodecamp.org/news/the-best-programming-language-to-learn-beginners-guide-to-coding/",
          "author": "Dionysia Lemonaki",
          "description": "Technology is changing how we live. We use and rely on web applications and electronic devices daily to complete various tasks. And behind these modern-day software programs are thousands of lines of code. Coding is one of the most valuable skills to learn today. You can not only build any",
          "link": "https://www.freecodecamp.org/news/the-best-programming-language-to-learn-beginners-guide-to-coding/",
          "publishedOn": "2022-10-28T21:03:55.000Z",
          "wordCount": 3278,
          "title": "The Best Programming Language to Learn – Beginners Guide to Coding",
          "imageUrl": "https://www.freecodecamp.org/news/content/images/2022/10/pexels-christina-morillo-1181677.jpg"
        },
        {
          "id": "https://www.freecodecamp.org/news/css-flexbox-complete-guide/",
          "author": "Oluwatobi Sofela",
          "description": "CSS Flexbox gives you the tools to create basic and advanced website layouts in flexible and responsive ways. This tutorial discusses everything you need to know to use Flexbox like a pro. Table of Contents  1.  What Is Flexbox?  2.  Flex Container vs. Flex Item: What's",
          "link": "https://www.freecodecamp.org/news/css-flexbox-complete-guide/",
          "publishedOn": "2022-10-28T14:28:24.000Z",
          "wordCount": 4454,
          "title": "CSS Flexbox Explained – Complete Guide to Flexible Containers and Flex Items",
          "imageUrl": "https://www.freecodecamp.org/news/content/images/2022/10/css-flexbox-complete-guide-codesweetly-pexels-chris-f-6664375.jpg"
        },
        {
          "id": "https://www.freecodecamp.org/news/how-to-set-up-a-github-oauth-application/",
          "author": "Naomi Carrigan",
          "description": "GitHub is an incredibly useful OAuth provider, especially if you are building an application targeted toward developers.  In this article, we will give you a quick rundown of how to set up a GitHub OAuth application. Create Your Application Begin by navigating to your GitHub settings (make sure you",
          "link": "https://www.freecodecamp.org/news/how-to-set-up-a-github-oauth-application/",
          "publishedOn": "2022-10-27T21:31:36.000Z",
          "wordCount": 857,
          "title": "How to Set Up a GitHub OAuth Application",
          "imageUrl": "https://www.freecodecamp.org/news/content/images/2022/10/pexels-george-becker-333837--1-.jpg"
        },
        {
          "id": "https://www.freecodecamp.org/news/how-to-create-forms-in-react-using-react-hook-form/",
          "author": "Yogesh Chavan",
          "description": "Creating forms in React is a complex task. It involves handling all the input states and their changes and validating that input when the form gets submitted. For simple forms, things are generally manageable. But as your form gets more complex and you need to add various validations, it becomes",
          "link": "https://www.freecodecamp.org/news/how-to-create-forms-in-react-using-react-hook-form/",
          "publishedOn": "2022-10-27T19:47:23.000Z",
          "wordCount": 4468,
          "title": "How to Create Forms in React using react-hook-form",
          "imageUrl": "https://www.freecodecamp.org/news/content/images/2022/10/cover.jpg"
        },
        {
          "id": "https://www.freecodecamp.org/news/how-to-open-an-xml-file/",
          "author": "Joel Olawanle",
          "description": "XML stands for eXtensible Markup Language. XML files are readable files that describe the structure of data. You store XML files with the .xml extension. An XML file contains tags that specify how the document should be structured and how it should be stored and transmitted over the internet. It",
          "link": "https://www.freecodecamp.org/news/how-to-open-an-xml-file/",
          "publishedOn": "2022-10-27T18:58:02.000Z",
          "wordCount": 1283,
          "title": "How to Open an XML File",
          "imageUrl": "https://www.freecodecamp.org/news/content/images/2022/10/cover-template--18-.png"
        },
        {
          "id": "https://www.freecodecamp.org/news/how-to-write-unit-tests-for-python-functions/",
          "author": "Bala Priya C",
          "description": "This guide will teach you how to write unit tests for Python functions. But why should you consider writing unit tests at all? Well, when working on a large project, you'll often have to update certain modules and refactor code as needed. But such changes can have unintended consequences on",
          "link": "https://www.freecodecamp.org/news/how-to-write-unit-tests-for-python-functions/",
          "publishedOn": "2022-10-27T18:53:00.000Z",
          "wordCount": 2214,
          "title": "How to Write Unit Tests for Python Functions",
          "imageUrl": "https://www.freecodecamp.org/news/content/images/2022/10/cover-image-unit-tests-python.png"
        },
        {
          "id": "https://www.freecodecamp.org/news/learn-python-book/",
          "author": "Fatos Morina",
          "description": "Python is one of the most popular programming languages in the world today. It was created in 1991 by Guido van Rossum. According to van Rossum, Python is a: > “high-level programming language, and its core design philosophy is all about code readability and a syntax which allows programmers to",
          "link": "https://www.freecodecamp.org/news/learn-python-book/",
          "publishedOn": "2022-10-27T16:38:20.000Z",
          "wordCount": 21253,
          "title": "Learn Python Programming – Everything You Need to Know (Free Book)",
          "imageUrl": "https://www.freecodecamp.org/news/content/images/2022/10/pexels-christina-morillo-1181359--4-.jpg"
        },
        {
          "id": "https://www.freecodecamp.org/news/how-hub-switch-work-and-how-to-protect-them/",
          "author": "Omer Rosenbaum",
          "description": "In a previous post [/news/the-complete-guide-to-the-ethernet-protocol/] I described every bit and byte of the Ethernet protocol. In this post you will learn about two network devices, how they work, and how this knowledge may be used by hackers. How Classic Ethernet Works Before describing the network devices, consider a network without",
          "link": "https://www.freecodecamp.org/news/how-hub-switch-work-and-how-to-protect-them/",
          "publishedOn": "2022-10-27T14:30:00.000Z",
          "wordCount": 3856,
          "title": "Network Devices – How Hubs and Switches Work and How to Secure Them",
          "imageUrl": "https://www.freecodecamp.org/news/content/images/2022/10/Computer-Networks-Hub-Switch.png"
        },
        {
          "id": "https://www.freecodecamp.org/news/learn-kotlin-complete-course/",
          "author": "Beau Carnes",
          "description": "Kotlin is the most popular programming language for building Android apps and it can also be can be used for any kind of development. We just published a full Kotlin course for beginners on the freeCodeCamp.org YouTube channel. Alex Cristian developed this course. Alex is an experienced developer who has",
          "link": "https://www.freecodecamp.org/news/learn-kotlin-complete-course/",
          "publishedOn": "2022-10-27T14:21:20.000Z",
          "wordCount": 890,
          "title": "Learn Kotlin in 14 Hours",
          "imageUrl": "https://www.freecodecamp.org/news/content/images/2022/10/kotlin.png"
        },
        {
          "id": "https://www.freecodecamp.org/news/find-meeting-time-schedule-meeting-microsoft-365/",
          "author": "Waldek Mastykarz",
          "description": "A common functionality that many work apps have is letting users schedule a meeting with others in their organization. Here's how to do it on Microsoft 365. Work Apps Need Work Data If your organization uses Microsoft 365, it should consider integrating it with apps that it uses for work.",
          "link": "https://www.freecodecamp.org/news/find-meeting-time-schedule-meeting-microsoft-365/",
          "publishedOn": "2022-10-26T21:34:19.000Z",
          "wordCount": 1600,
          "title": "How to Find a Meeting Time and Schedule a Meeting on Microsoft 365",
          "imageUrl": "https://www.freecodecamp.org/news/content/images/2022/10/Screenshot-2022-10-25-at-13.03.43.png"
        },
        {
          "id": "https://www.freecodecamp.org/news/how-devsecops-can-improve-cloud-security/",
          "author": "Andrej Kovacevic",
          "description": "There’s no doubt that DevSecOps is on the rise, as the need for fast but highly secure application delivery increases. A report by Emergen Research [https://www.prnewswire.com/news-releases/devsecops-market-size-to-reach-usd-23-42-billion-in-2028--rising-need-for-repeatable-and-adaptive-processes-and-increasing-need-for-custom-code-security-are-key-factors-driving-industry-demand-says-emergen-research-301481508.html]  shows that the DevSecOps market is set to reach a $23.42 billion value in 202",
          "link": "https://www.freecodecamp.org/news/how-devsecops-can-improve-cloud-security/",
          "publishedOn": "2022-10-26T21:28:20.000Z",
          "wordCount": 1712,
          "title": "How Can DevSecOps Improve Cloud Security?",
          "imageUrl": "https://www.freecodecamp.org/news/content/images/2022/10/devsecops-role-guide.jpg"
        },
        {
          "id": "https://www.freecodecamp.org/news/how-to-set-an-environment-variable-in-linux/",
          "author": "Zaira Hira",
          "description": "In programming, you use variables to store information like strings and numbers temporarily.  Variables can be used repeatedly throughout the code or by your operating system to provide values. You can edit them, overwrite them, and delete them. In this tutorial, I'll teach you what environment variables are and",
          "link": "https://www.freecodecamp.org/news/how-to-set-an-environment-variable-in-linux/",
          "publishedOn": "2022-10-26T18:38:21.000Z",
          "wordCount": 1449,
          "title": "How to Set an Environment Variable in Linux",
          "imageUrl": "https://www.freecodecamp.org/news/content/images/2022/10/Copy-of-Copy-of-read-write-files-python--3-.png"
        },
        {
          "id": "https://www.freecodecamp.org/news/improve-website-accessibility-with-these-tips/",
          "author": "Tooba Jamal",
          "description": "An accessible website is designed in such a way that anyone can use it without difficulty.  During the website development process, you want to make sure that the end user has the best user experience. And that includes people with disabilities or those who faces challenges when using a",
          "link": "https://www.freecodecamp.org/news/improve-website-accessibility-with-these-tips/",
          "publishedOn": "2022-10-26T18:09:18.000Z",
          "wordCount": 2193,
          "title": "How to Improve Website Accessibility – 7 Helpful Tips",
          "imageUrl": "https://www.freecodecamp.org/news/content/images/2022/10/website_accessibility-1.png"
        },
        {
          "id": "https://www.freecodecamp.org/news/computer-science-vs-information-technology-whats-the-difference/",
          "author": "Kolade Chris",
          "description": "To the average person, computer science and information technology might just seem like different names for the same thing. Well, computer science and information technology are related, but in the actual sense, they are two distinct fields when it comes to studying and choosing a career path. In this article,",
          "link": "https://www.freecodecamp.org/news/computer-science-vs-information-technology-whats-the-difference/",
          "publishedOn": "2022-10-26T16:24:40.000Z",
          "wordCount": 1735,
          "title": "Computer Science VS Information Technology – What's the Difference Between CS and IT?",
          "imageUrl": "https://www.freecodecamp.org/news/content/images/2022/10/science-ge752bcd42_1280.jpg"
        },
        {
          "id": "https://www.freecodecamp.org/news/learn-how-graph-algorithms-work/",
          "author": "Beau Carnes",
          "description": "Graph algorithms and data structures are used to solve many real-word problems and are commonly needed to solve coding challenges. A graph data structures is a non-linear data structure consisting of vertices and edges. We just published a course on the freeCodeCamp.org YouTube channel that will help you learn how",
          "link": "https://www.freecodecamp.org/news/learn-how-graph-algorithms-work/",
          "publishedOn": "2022-10-26T13:42:09.000Z",
          "wordCount": 808,
          "title": "Learn How Graph Algorithms Work",
          "imageUrl": "https://www.freecodecamp.org/news/content/images/2022/10/graphalgs2.png"
        },
        {
          "id": "https://www.freecodecamp.org/news/python-lambda-function-explained/",
          "author": "Ibrahim Abayomi Ogunbiyi",
          "description": "One of the beautiful things about Python is that it is generally one of the most intuitive programming languages out there. Still, certain concepts can be difficult to grasp and comprehend. The lambda function is one of them.  I've been there. When I first started learning Python, I skipped",
          "link": "https://www.freecodecamp.org/news/python-lambda-function-explained/",
          "publishedOn": "2022-10-25T20:37:45.000Z",
          "wordCount": 1725,
          "title": "How the Python Lambda Function Works – Explained with Examples",
          "imageUrl": "https://www.freecodecamp.org/news/content/images/2022/10/pexels-pixabay-45246--1-.jpg"
        },
        {
          "id": "https://www.freecodecamp.org/news/how-to-build-a-ecommerce-website-using-next-js-and-planetscale/",
          "author": "Sharvin Shah",
          "description": "Hello, welcome to this tutorial. Today we're going to build a production-ready eCommerce website using ReactJS, TailwindCSS, PlanetScale, and Stripe. Before we begin, you should be familiar with the basics of React.js and Next.js to get the most out of this guide. If you're not and need to brush up,",
          "link": "https://www.freecodecamp.org/news/how-to-build-a-ecommerce-website-using-next-js-and-planetscale/",
          "publishedOn": "2022-10-25T16:30:14.000Z",
          "wordCount": 6999,
          "title": "How to Build a Production Ready eCommerce Website with ReactJS, TailwindCSS, PlanetScale and Stripe",
          "imageUrl": "https://www.freecodecamp.org/news/content/images/2022/10/Add-a-heading.png"
        },
        {
          "id": "https://www.freecodecamp.org/news/freecodecamp-math-computer-science-degree-update/",
          "author": "Quincy Larson",
          "description": "Happy birthday to the global freeCodeCamp community. 8 years ago, we started this grass-roots community of learners. Back then, freeCodeCamp sounded like an improbable dream. But we all rolled up our sleeves and got to work making it a reality. Today, more than a million people use freeCodeCamp each day.",
          "link": "https://www.freecodecamp.org/news/freecodecamp-math-computer-science-degree-update/",
          "publishedOn": "2022-10-25T13:52:49.000Z",
          "wordCount": 2035,
          "title": "freeCodeCamp Turns 8 Years Old: Data Science Courses + University Degrees Update",
          "imageUrl": "https://www.freecodecamp.org/news/content/images/2022/10/freeCodeCamp-Data-Science-Courses-and-Degrees.jpg"
        },
        {
          "id": "https://www.freecodecamp.org/news/payment-request-api-javascript/",
          "author": "Atta ✨",
          "description": "The Payment Request API provides a cross-browser standard that lets you collect payments, addresses, and contact information from your customers. You can then use this info to process their order. It also facilitates the exchange of this information between the browser and the website. The fundamental idea behind this is",
          "link": "https://www.freecodecamp.org/news/payment-request-api-javascript/",
          "publishedOn": "2022-10-24T22:40:51.000Z",
          "wordCount": 1958,
          "title": "How to Use the Payment Request API in JavaScript",
          "imageUrl": "https://www.freecodecamp.org/news/content/images/2022/10/js-payment-request.png"
        },
        {
          "id": "https://www.freecodecamp.org/news/how-to-contribute-to-open-source-for-technical-writers/",
          "author": "Valentine Gatwiri",
          "description": "Contributing to open source can be a daunting prospect, especially if you haven't done so before, or if you're used to working on documentation rather than code. This guide will help technical writers get started contributing to open-source projects, and outline some of the common pitfalls you might encounter when",
          "link": "https://www.freecodecamp.org/news/how-to-contribute-to-open-source-for-technical-writers/",
          "publishedOn": "2022-10-24T21:20:33.000Z",
          "wordCount": 2030,
          "title": "How to Contribute to Open Source – a Guide for Technical Writers",
          "imageUrl": "https://www.freecodecamp.org/news/content/images/2022/10/pexels-william-fortunato-6393024.jpg"
        },
        {
          "id": "https://www.freecodecamp.org/news/the-swift-handbook/",
          "author": "Flavio Copes",
          "description": "Introduction to Swift The Swift programming language was created by Apple in 2014. It's the official language that works with the whole Apple Operating Systems lineup: iOS, iPadOS, watchOS, macOS, and tvOS. Swift is an open source, general purpose, compiled programming language that's statically typed. Every value has a type",
          "link": "https://www.freecodecamp.org/news/the-swift-handbook/",
          "publishedOn": "2022-10-24T21:04:27.000Z",
          "wordCount": 6746,
          "title": "The Swift Handbook – Learn Swift for Beginners",
          "imageUrl": "https://www.freecodecamp.org/news/content/images/2022/10/pexels-quang-nguyen-vinh-6131283.jpg"
        },
        {
          "id": "https://www.freecodecamp.org/news/sql-select-statement-and-query-examples/",
          "author": "Joel Olawanle",
          "description": "Structured Query Language (SQL) is a programming language that you use to manage data in relational databases. You can use SQL to create, read, update, and delete (CRUD) data in a relational database. You can write SQL queries to insert data with INSERT, read data with SELECT, update with UPDATE,",
          "link": "https://www.freecodecamp.org/news/sql-select-statement-and-query-examples/",
          "publishedOn": "2022-10-24T18:07:46.000Z",
          "wordCount": 1724,
          "title": "SQL Select – Statement and Query Examples",
          "imageUrl": "https://www.freecodecamp.org/news/content/images/2022/10/cover-template--17-.png"
        },
        {
          "id": "https://www.freecodecamp.org/news/how-to-monetize-your-website/",
          "author": "Beau Carnes",
          "description": "Web Monetization means that you can get money for every person that visits your website. Sounds good right? But how does it work?  We just published a course on the freeCodeCamp.org YouTube channel that will teach you how to monetize your website using microtransactions and the Interledger Protocol.",
          "link": "https://www.freecodecamp.org/news/how-to-monetize-your-website/",
          "publishedOn": "2022-10-24T15:37:44.000Z",
          "wordCount": 881,
          "title": "How to Monetize Your Website with Microtransactions",
          "imageUrl": "https://www.freecodecamp.org/news/content/images/2022/08/maxresdefault-2.jpeg"
        },
        {
          "id": "https://www.freecodecamp.org/news/how-to-use-the-firebase-database-in-react/",
          "author": "Edeh Israel Chidera",
          "description": "Firebase provides some great services like NoSQL databases, authentication, cloud storage, and much more. In this tutorial, we will learn how to use your React application to read and add data to your Firebase database.  To demonstrate this, we will learn how to build a Todo app using React",
          "link": "https://www.freecodecamp.org/news/how-to-use-the-firebase-database-in-react/",
          "publishedOn": "2022-10-24T15:08:06.000Z",
          "wordCount": 2412,
          "title": "How to Use Cloud Firestore in a React App",
          "imageUrl": "https://www.freecodecamp.org/news/content/images/2022/10/lautaro-andreani-xkBaqlcqeb4-unsplash.jpg"
        },
        {
          "id": "https://www.freecodecamp.org/news/gradient-descent-machine-learning-algorithm-example/",
          "author": "Salim Oyinlola",
          "description": "What is the Gradient Descent Algorithm? Gradient descent is probably the most popular machine learning algorithm. At its core, the algorithm exists to minimize errors as much as possible.  The aim of gradient descent as an algorithm is to minimize the cost function of a model. We can tell",
          "link": "https://www.freecodecamp.org/news/gradient-descent-machine-learning-algorithm-example/",
          "publishedOn": "2022-10-24T13:53:51.000Z",
          "wordCount": 1916,
          "title": "Gradient Descent – Machine Learning Algorithm Example",
          "imageUrl": "https://www.freecodecamp.org/news/content/images/2022/10/pexels-pixabay-159751.jpg"
        },
        {
          "id": "https://www.freecodecamp.org/news/upload-files-to-azure-using-nestjs-and-typeorm-with-mysql/",
          "author": "Destiny Erhabor",
          "description": "Images and videos are examples of huge files that might be stored in your database. And this might impact the performance of your applications because of the amount of space that those files can take up.  Also, it expands the database, which makes backups larger and slower. Because of",
          "link": "https://www.freecodecamp.org/news/upload-files-to-azure-using-nestjs-and-typeorm-with-mysql/",
          "publishedOn": "2022-10-21T23:13:08.000Z",
          "wordCount": 3173,
          "title": "How to Upload Files to Azure using NestJS and typeORM with MySQL",
          "imageUrl": "https://www.freecodecamp.org/news/content/images/2022/10/pexels-panumas-nikhomkhai-1148820.jpg"
        },
        {
          "id": "https://www.freecodecamp.org/news/web-layouts-use-css-grid-and-flex-to-create-responsive-webpages/",
          "author": "Ophy Boamah",
          "description": "Your web layout is to your website what a floor plan is to a building. Without them, you’re just building castles in the air.  The first thing to do when you have a website or application to build or design is to decide on the layout. This is important",
          "link": "https://www.freecodecamp.org/news/web-layouts-use-css-grid-and-flex-to-create-responsive-webpages/",
          "publishedOn": "2022-10-21T23:12:52.000Z",
          "wordCount": 3971,
          "title": "Web Layouts – How to Use CSS Grid and Flex to Create a Responsive Web Page",
          "imageUrl": "https://www.freecodecamp.org/news/content/images/2022/10/WebLayouts-1.png"
        },
        {
          "id": "https://www.freecodecamp.org/news/what-is-an-orm-the-meaning-of-object-relational-mapping-database-tools/",
          "author": "Ihechikara Vincent Abba",
          "description": "Object Relational Mapping (ORM) is a technique used in creating a \"bridge\" between object-oriented programs and, in most cases, relational databases [/news/what-is-a-relational-database-rdbms-definition/]. Put another way, you can see the ORM as the layer that connects object oriented programming [/news/four-pillars-of-object-oriented-programming/] (OOP) to relational databases.  When interacting with a database using",
          "link": "https://www.freecodecamp.org/news/what-is-an-orm-the-meaning-of-object-relational-mapping-database-tools/",
          "publishedOn": "2022-10-21T18:18:25.000Z",
          "wordCount": 1465,
          "title": "What is an ORM – The Meaning of Object Relational Mapping Database Tools",
          "imageUrl": "https://www.freecodecamp.org/news/content/images/2022/09/markus-winkler-gLdJnQFcIXE-unsplash.jpg"
        },
        {
          "id": "https://www.freecodecamp.org/news/the-complete-guide-to-the-ethernet-protocol/",
          "author": "Omer Rosenbaum",
          "description": "Whether you’ve been aware of it or not, you’ve probably used the Ethernet in the past. Does this cable look familiar? (Source: Wikipedia [https://en.wikipedia.org/wiki/Ethernet_physical_layer#/media/File:EthernetCableYellow3.jpg] )Ethernet is extremely popular, and is the most widely used Data Link Layer protocol, at least where the devices are linked by physical cables (rather than",
          "link": "https://www.freecodecamp.org/news/the-complete-guide-to-the-ethernet-protocol/",
          "publishedOn": "2022-10-21T17:12:40.000Z",
          "wordCount": 4888,
          "title": "How the Ethernet Protocol Works – A Complete Guide",
          "imageUrl": "https://www.freecodecamp.org/news/content/images/2022/10/Computer-Networks-Ethernet--1-.png"
        },
        {
          "id": "https://www.freecodecamp.org/news/crash-course-object-oriented-programming-in-python/",
          "author": "Lane Wagner",
          "description": "Object Oriented programming, or \"OOP\" for short, is a way of writing code that relies on the concepts of classes and objects.  The main benefit of writing your code in an object-oriented way is to structure your program into simple, reusable pieces of code. Stick with me through this",
          "link": "https://www.freecodecamp.org/news/crash-course-object-oriented-programming-in-python/",
          "publishedOn": "2022-10-20T22:24:35.000Z",
          "wordCount": 4556,
          "title": "Object Oriented Programming in Python – Full Crash Course",
          "imageUrl": "https://www.freecodecamp.org/news/content/images/2022/10/udaXTUR.png"
        },
        {
          "id": "https://www.freecodecamp.org/news/crud-operations-crud-definition-in-programming/",
          "author": "Joel Olawanle",
          "description": "When interacting with a database or working with an API, you'll often encounter the term CRUD. It is a popular acronym for the four basic operations or functions that a model (in the case of an API) or a database management system uses. This is an acronym everyone learning computer",
          "link": "https://www.freecodecamp.org/news/crud-operations-crud-definition-in-programming/",
          "publishedOn": "2022-10-20T21:54:52.000Z",
          "wordCount": 1798,
          "title": "CRUD Operations – Crud Definition in Programming",
          "imageUrl": "https://www.freecodecamp.org/news/content/images/2022/10/cover-template--16-.png"
        },
        {
          "id": "https://www.freecodecamp.org/news/computer-programmer-salary-how-much-do-coders-make/",
          "author": "Dionysia Lemonaki",
          "description": "Coding is one of the most popular and in-demand careers. There are many reasons why people choose a career in coding and computer science. The technology field offers promising and diverse job prospects in several industries, job security, a generally comfortable starting salary, and increased high-earning potential as developers gain",
          "link": "https://www.freecodecamp.org/news/computer-programmer-salary-how-much-do-coders-make/",
          "publishedOn": "2022-10-20T19:34:20.000Z",
          "wordCount": 2921,
          "title": "Computer Programmer Salary – How Much Do Coders Make?",
          "imageUrl": "https://www.freecodecamp.org/news/content/images/2022/10/pexels-maitree-rimthong-1602726.jpg"
        },
        {
          "id": "https://www.freecodecamp.org/news/tableau-vs-power-bi-whats-the-difference/",
          "author": "Kolade Chris",
          "description": "Tableau and Power BI are both data visualization and business intelligence tools. You can extract data with both tools, visualize the data, analyze it, and turn it into a piece of actionable information. In this article, you will learn what both Power BI and Tableau are in detail. I will",
          "link": "https://www.freecodecamp.org/news/tableau-vs-power-bi-whats-the-difference/",
          "publishedOn": "2022-10-20T17:48:45.000Z",
          "wordCount": 1533,
          "title": "Tableau VS Power BI – What's the Difference?",
          "imageUrl": "https://www.freecodecamp.org/news/content/images/2022/10/tableauvPowerBi.png"
        },
        {
          "id": "https://www.freecodecamp.org/news/code-google-docs-with-flutter/",
          "author": "Beau Carnes",
          "description": "Creating a Google Docs clone will help you learn a lot of new concepts. We just published a full course on the freeCodeCamp.org YouTube channel that will teach you how to use Flutter to create a Google Docs clone. Rivaan Ranawat created this course. Rivaan has created many popular technical",
          "link": "https://www.freecodecamp.org/news/code-google-docs-with-flutter/",
          "publishedOn": "2022-10-20T14:15:37.000Z",
          "wordCount": 869,
          "title": "Code Google Docs with Flutter",
          "imageUrl": "https://www.freecodecamp.org/news/content/images/2022/10/flutter-3.png"
        },
        {
          "id": "https://www.freecodecamp.org/news/git-reverting-to-previous-commit-how-to-revert-to-last-commit/",
          "author": "Ihechikara Vincent Abba",
          "description": "Git [/news/git-and-github-for-beginners/] is a great tool for version control. It also makes collaborating with others more efficient. In this article, you'll learn how to revert to previous commits when tracking your project with Git. The two commands we'll discuss in this article are git reset and git revert. These commands",
          "link": "https://www.freecodecamp.org/news/git-reverting-to-previous-commit-how-to-revert-to-last-commit/",
          "publishedOn": "2022-10-19T22:55:44.000Z",
          "wordCount": 1713,
          "title": "Git Reverting to Previous Commit – How to Revert to Last Commit",
          "imageUrl": "https://www.freecodecamp.org/news/content/images/2022/10/roman-synkevych-wX2L8L-fGeA-unsplash.jpg"
        },
        {
          "id": "https://www.freecodecamp.org/news/harvard-cs50/",
          "author": "Beau Carnes",
          "description": "Harvard University's CS50 is one of the most popular beginner computer science courses in the world.  We just released the entire CS50 course–all 25 hours–on the freeCodeCamp.org YouTube channel. David J. Malan is widely considered to be one of the best computer science instructors. He teaches this course. This",
          "link": "https://www.freecodecamp.org/news/harvard-cs50/",
          "publishedOn": "2022-10-19T14:07:23.000Z",
          "wordCount": 858,
          "title": "Harvard CS50 – Free Computer Science University Course",
          "imageUrl": "https://www.freecodecamp.org/news/content/images/2022/10/cs502.png"
        },
        {
          "id": "https://www.freecodecamp.org/news/linux-command-line-tutorial/",
          "author": "Destiny Erhabor",
          "description": "An operating system is a set of software layers between you and your computer's hardware.  The operating system (or OS) is a piece of software that controls all other application programs and helps you manage the hardware and software of your computer. Examples of popular operating systems are Windows,",
          "link": "https://www.freecodecamp.org/news/linux-command-line-tutorial/",
          "publishedOn": "2022-10-18T23:33:44.000Z",
          "wordCount": 3584,
          "title": "Linux Command Line Tutorial – How to Use Common Terminal Commands",
          "imageUrl": "https://www.freecodecamp.org/news/content/images/2022/10/pexels-sora-shimazaki-5935794--3-.jpg"
        },
        {
          "id": "https://www.freecodecamp.org/news/wi-fi-hacking-101/",
          "author": "Daniel Iwugo",
          "description": "Welcome to the world of Wi-Fi hacking, everybody. 💻. In my previous article [/news/linux-basics/], we talked about some basic Linux skills and tricks. In this article you are going to learn a basic Wi-Fi hacking procedure using those skills. You'll learn things such as how to:  1. Monitor Wi-Fi",
          "link": "https://www.freecodecamp.org/news/wi-fi-hacking-101/",
          "publishedOn": "2022-10-18T20:37:37.000Z",
          "wordCount": 3012,
          "title": "Wi-Fi Hacking 101 – How to Hack WPA2 and Defend Against These Attacks",
          "imageUrl": "https://www.freecodecamp.org/news/content/images/2022/10/image-74-1.png"
        },
        {
          "id": "https://www.freecodecamp.org/news/append-a-string-in-python-str-appending/",
          "author": "Ihechikara Vincent Abba",
          "description": "In this article, you'll learn the different methods of appending strings in Python.  Another term commonly used when talking about appending strings is concatenation. So you'll often see these terms — append and concatenate — used interchangeably.  Either way, to append or concatenate strings means to add or",
          "link": "https://www.freecodecamp.org/news/append-a-string-in-python-str-appending/",
          "publishedOn": "2022-10-18T19:33:59.000Z",
          "wordCount": 1417,
          "title": "Append a String in Python – STR Appending",
          "imageUrl": "https://www.freecodecamp.org/news/content/images/2022/10/alex-chumak-zGuBURGGmdY-unsplash.jpg"
        },
        {
          "id": "https://www.freecodecamp.org/news/go-beginners-handbook/",
          "author": "Flavio Copes",
          "description": "Golang is an awesome, simple, modern, and fast programming language. It’s compiled, open source, and strongly typed. Golang – also called Go – was created by Google engineers with these main goals:  * make their projects compile (and run) faster  * be simple so people can pick it",
          "link": "https://www.freecodecamp.org/news/go-beginners-handbook/",
          "publishedOn": "2022-10-18T18:35:37.000Z",
          "wordCount": 5845,
          "title": "The Go Handbook – Learn Golang for Beginners",
          "imageUrl": "https://www.freecodecamp.org/news/content/images/2022/10/pexels-christina-morillo-1181290.jpg"
        },
        {
          "id": "https://www.freecodecamp.org/news/build-a-cross-platform-app-with-next-and-tauri/",
          "author": "Rajdeep Singh",
          "description": "Tauri is a new Rust-based framework that builds an x86_64 cross-platform application for Windows, macOS, and Linux.  In this tutorial, we'll use Tauri and Next.js to build a desktop-based cross-platform application and publish it to the Snap store and AppImage. So why is building a cross-platform app, that works",
          "link": "https://www.freecodecamp.org/news/build-a-cross-platform-app-with-next-and-tauri/",
          "publishedOn": "2022-10-18T16:38:44.000Z",
          "wordCount": 5058,
          "title": "How to Build a Cross-Platform Application with Next.js and Tauri",
          "imageUrl": "https://www.freecodecamp.org/news/content/images/2022/10/Tauri-and-nextjs--1-.png"
        },
        {
          "id": "https://www.freecodecamp.org/news/github-search-tips/",
          "author": "Hillary Nyakundi",
          "description": "When I was a beginner to open-source contributions, one of my greatest challenge was finding the correct projects/issues to work on. For the longest time I relied on resources curated by different writers on the internet (which were good, by the way). But I always wanted to find a way",
          "link": "https://www.freecodecamp.org/news/github-search-tips/",
          "publishedOn": "2022-10-17T19:27:10.000Z",
          "wordCount": 2159,
          "title": "GitHub Search Tips – How to Search Issues, Repos, and More Effectively on GitHub",
          "imageUrl": "https://www.freecodecamp.org/news/content/images/2022/10/Search--2-.png"
        },
        {
          "id": "https://www.freecodecamp.org/news/php-explode-how-to-split-a-string-into-an-array/",
          "author": "Kolade Chris",
          "description": "The PHP explode() function converts a string to an array. Each of the characters in the string is given an index that starts from 0. Like the built-in imlode()  function, the explode function does not modify the data (string). Syntax of the explode() Function The explode() function takes in",
          "link": "https://www.freecodecamp.org/news/php-explode-how-to-split-a-string-into-an-array/",
          "publishedOn": "2022-10-17T17:19:46.000Z",
          "wordCount": 1114,
          "title": "PHP Explode – How to Split a String into an Array",
          "imageUrl": "https://www.freecodecamp.org/news/content/images/2022/10/explode.png"
        },
        {
          "id": "https://www.freecodecamp.org/news/how-to-show-upcoming-meetings-for-a-microsoft-365-user/",
          "author": "Waldek Mastykarz",
          "description": "If you're a web developer and you work with an organization that uses Microsoft 365, you probably use it to manage your meetings. In this tutorial, you'll learn how you can build a simple personal assistant in under 10 minutes that'll show a Microsoft 365 user the meetings they have",
          "link": "https://www.freecodecamp.org/news/how-to-show-upcoming-meetings-for-a-microsoft-365-user/",
          "publishedOn": "2022-10-17T17:08:26.000Z",
          "wordCount": 2674,
          "title": "How to Show Upcoming Meetings for a Microsoft 365 User",
          "imageUrl": "https://www.freecodecamp.org/news/content/images/2022/10/Screenshot-2022-10-17-at-14.47.26.png"
        },
        {
          "id": "https://www.freecodecamp.org/news/how-to-architect-a-blockchain-on-kubernetes-k8s-microservice-tutorial/",
          "author": "Kayode Adeniyi",
          "description": "In this article, I will describe how to use microservices architecture and Kubernetes to build a blockchain.  The technologies usually used for blockchains are purpose-driven, and you can use them for other projects as well. The examples in this article can readily handle heavy loads and remain responsive and",
          "link": "https://www.freecodecamp.org/news/how-to-architect-a-blockchain-on-kubernetes-k8s-microservice-tutorial/",
          "publishedOn": "2022-10-17T16:02:43.000Z",
          "wordCount": 2894,
          "title": "How to Architect a Blockchain on Kubernetes – K8S Microservice Tutorial",
          "imageUrl": "https://www.freecodecamp.org/news/content/images/2022/10/Screenshot-2022-10-01-at-07.39.09.png"
        },
        {
          "id": "https://www.freecodecamp.org/news/how-to-lowercase-a-string-in-javascript-tolowercase-in-js/",
          "author": "Ilenia Magoni",
          "description": "Strings are a fundamental part of working with JavaScript. And the toLowerCase()  method is one of the many integrated methods that you can use to work with strings. In this article, we'll see how to make strings lowercase with the toLowerCase()  method in Python. What is a String?",
          "link": "https://www.freecodecamp.org/news/how-to-lowercase-a-string-in-javascript-tolowercase-in-js/",
          "publishedOn": "2022-10-17T15:51:50.000Z",
          "wordCount": 1358,
          "title": "How to Lowercase a String in JavaScript – toLowerCase() in JS",
          "imageUrl": "https://www.freecodecamp.org/news/content/images/2022/10/pexels-magda-ehlers-1337382.jpg"
        },
        {
          "id": "https://www.freecodecamp.org/news/learn-svelte-complete-course/",
          "author": "Beau Carnes",
          "description": "Svelte is a front-end JavaScript framework for making interactive webpages. Svelte has grown in popularity quite a bit over the last few years. We just published a free 23-hour course on the freeCodeCamp.org YouTube channel that will teach you how to use Svelte. Li Hau Tan developed this course. Li",
          "link": "https://www.freecodecamp.org/news/learn-svelte-complete-course/",
          "publishedOn": "2022-10-17T15:14:47.000Z",
          "wordCount": 955,
          "title": "Learn Svelte in 23 Hours",
          "imageUrl": "https://www.freecodecamp.org/news/content/images/2022/10/svelte-1.png"
        },
        {
          "id": "https://www.freecodecamp.org/news/interpret-black-box-model-using-lime/",
          "author": "Josua Antonius Naiborhu",
          "description": "Machine learning models are black box models. By giving input to these models, we can get output based on the particular model we're using.  The way humans interpret things is different from how machines interpret them. So it's helpful to use tools that can turn the output from certain",
          "link": "https://www.freecodecamp.org/news/interpret-black-box-model-using-lime/",
          "publishedOn": "2022-10-17T15:12:31.000Z",
          "wordCount": 2391,
          "title": "How to Interpret Black Box Models using LIME (Local Interpretable Model-Agnostic Explanations)",
          "imageUrl": "https://www.freecodecamp.org/news/content/images/2022/10/LIME.jpeg"
        },
        {
          "id": "https://www.freecodecamp.org/news/what-is-python-beginners-guide/",
          "author": "Michael Lee",
          "description": "In this article, I am going to explain what Python is and how the Python interpreter works. Then you'll write your first \"Hello World\" program. What is Python? Python is a high-level programming language designed to do many tasks. It's based on the CPython interpreter which translates the Python code",
          "link": "https://www.freecodecamp.org/news/what-is-python-beginners-guide/",
          "publishedOn": "2022-10-17T13:38:18.000Z",
          "wordCount": 1696,
          "title": "What is Python? How the Interpreter Works and How to Write \"Hello World\" in Python",
          "imageUrl": "https://www.freecodecamp.org/news/content/images/2022/10/python-img.jpg"
        },
        {
          "id": "https://www.freecodecamp.org/news/the-five-layers-model-explained/",
          "author": "Omer Rosenbaum",
          "description": "Computer Networks are a beautiful, amazing topic. Networks involve so much knowledge from different fields, from physics to algorithms.  When dealing with Computer Networks, there is one framework that puts everything into place – and that is the layers model.  In this post you'll learn why we need",
          "link": "https://www.freecodecamp.org/news/the-five-layers-model-explained/",
          "publishedOn": "2022-10-17T13:37:19.000Z",
          "wordCount": 3944,
          "title": "What is the Five Layers Model? The Framework of the Internet Explained",
          "imageUrl": "https://www.freecodecamp.org/news/content/images/2022/10/d.png"
        },
        {
          "id": "https://www.freecodecamp.org/news/find-vs-filter-javascript/",
          "author": "Aman Kalra",
          "description": "A common interview question that JavaScript developers often get asked is to explain the difference between the find() and filter() methods.  In this tutorial today, I'll walk you through what these methods are and when you should use them. What is the filter() method? This method returns all the",
          "link": "https://www.freecodecamp.org/news/find-vs-filter-javascript/",
          "publishedOn": "2022-10-14T22:22:22.000Z",
          "wordCount": 1174,
          "title": "find() vs filter() in JavaScript – Differences Explained with Examples",
          "imageUrl": "https://www.freecodecamp.org/news/content/images/2022/10/Logo.jpg"
        },
        {
          "id": "https://www.freecodecamp.org/news/copy-text-to-clipboard-javascript/",
          "author": "Joel Olawanle",
          "description": "When you're building advanced web pages and applications, you'll sometimes want to add the copy feature. This lets your users simply click a button or icon to copy text rather than highlighting the text and clicking a couple of buttons on the keyboard. This feature is mostly used when someone",
          "link": "https://www.freecodecamp.org/news/copy-text-to-clipboard-javascript/",
          "publishedOn": "2022-10-14T21:18:48.000Z",
          "wordCount": 1263,
          "title": "How to Copy Text to the Clipboard with JavaScript",
          "imageUrl": "https://www.freecodecamp.org/news/content/images/2022/10/cover-template--14-.png"
        },
        {
          "id": "https://www.freecodecamp.org/news/javascript-add-to-an-array-js-append/",
          "author": "Ihechikara Vincent Abba",
          "description": "You can use arrays in JavaScript to store a group of variables, often referred to as elements or items of the array. Each of these elements will have an index number assigned to them starting from zero.  By default, you can use the index of an element in an",
          "link": "https://www.freecodecamp.org/news/javascript-add-to-an-array-js-append/",
          "publishedOn": "2022-10-14T18:29:54.000Z",
          "wordCount": 1555,
          "title": "JavaScript Add to an Array – JS Append",
          "imageUrl": "https://www.freecodecamp.org/news/content/images/2022/10/kelly-sikkema--1_RZL8BGBM-unsplash.jpg"
        },
        {
          "id": "https://www.freecodecamp.org/news/ux-vs-ui-whats-the-difference-definition-and-meaning/",
          "author": "Dionysia Lemonaki",
          "description": "When designing a website or an app, the finished product needs to be functional, intuitive, and aesthetically pleasing. This is where UX and UI design come in. UX and UI design are two technical terms that can often be confusing. Many people may use these two terms interchangeably, incorrectly, or",
          "link": "https://www.freecodecamp.org/news/ux-vs-ui-whats-the-difference-definition-and-meaning/",
          "publishedOn": "2022-10-14T16:15:57.000Z",
          "wordCount": 3296,
          "title": "UX vs UI – What's the Difference? Definition and Meaning",
          "imageUrl": "https://www.freecodecamp.org/news/content/images/2022/10/pexels-picjumbocom-196644.jpg"
        },
        {
          "id": "https://www.freecodecamp.org/news/developer-journey/",
          "author": "Jalmari Ikävalko",
          "description": "Hi everyone, I'm Jalmari Ikävalko, a software developer in my early 30s. In this article, I’ll share my whole journey from my first contact with code to becoming the professional developer I am today.  I'll start from my childhood when I first got interested in programming. My Introduction to",
          "link": "https://www.freecodecamp.org/news/developer-journey/",
          "publishedOn": "2022-10-14T16:01:31.000Z",
          "wordCount": 3915,
          "title": "My Developer Journey – How I Learned to Code with Dyslexia and ADHD",
          "imageUrl": "https://www.freecodecamp.org/news/content/images/2022/10/1.jpg"
        },
        {
          "id": "https://www.freecodecamp.org/news/avoid-prop-drilling-with-react-context-api/",
          "author": "Edeh Israel Chidera",
          "description": "The React Context API provides a way to pass data through multiple nested levels of components without having to manually pass that data to each level.  React context is one sure way of globally managing your data in your app, and it's a good way to avoid prop drilling.",
          "link": "https://www.freecodecamp.org/news/avoid-prop-drilling-with-react-context-api/",
          "publishedOn": "2022-10-13T16:52:03.000Z",
          "wordCount": 1243,
          "title": "How to Avoid Prop Drilling with the React Context API",
          "imageUrl": "https://www.freecodecamp.org/news/content/images/2022/10/ferenc-almasi-c8h0n7fSTqs-unsplash.jpg"
        },
        {
          "id": "https://www.freecodecamp.org/news/code-a-project-three-different-ways-javascript-rest-api-database/",
          "author": "Beau Carnes",
          "description": "When you code a similar project using different methods it helps you understand each method more. We just published a course on the freeCodeCamp.org YouTube channel that will teach you how to code a flight widget in JavaScript using multiple methods. First you will learn to create the project using",
          "link": "https://www.freecodecamp.org/news/code-a-project-three-different-ways-javascript-rest-api-database/",
          "publishedOn": "2022-10-13T14:06:09.000Z",
          "wordCount": 852,
          "title": "Code a project three different ways (JavaScript + REST API + Database)",
          "imageUrl": "https://www.freecodecamp.org/news/content/images/2022/10/maxresdefault.jpeg"
        },
        {
          "id": "https://www.freecodecamp.org/news/how-to-build-a-machine-learning-model-in-rust/",
          "author": "Chigozie Oduah",
          "description": "Machine learning is a really interesting concept in computer programming. It involves using data to train a computer program to carry out tasks.  During the process, the program learns from data by discovering patterns. This reduces the need for programmers to hard code rules in some applications. Languages like",
          "link": "https://www.freecodecamp.org/news/how-to-build-a-machine-learning-model-in-rust/",
          "publishedOn": "2022-10-12T22:31:25.000Z",
          "wordCount": 2706,
          "title": "How to Build a Machine Learning Model in Rust",
          "imageUrl": "https://www.freecodecamp.org/news/content/images/2022/10/guerrillabuzz-crypto-pr-IlUq1ruyv0Q-unsplash.jpg"
        },
        {
          "id": "https://www.freecodecamp.org/news/email-alias-set-up-a-professional-email-for-free/",
          "author": "Eamonn Cottrell",
          "description": "I needed to log in to AWS. But my main email address was rejected. Apparently I'd done this in the past and the account had been irreversibly deleted.  No reset option – just a message saying the account was permanently deleted: There are about a million ways to get",
          "link": "https://www.freecodecamp.org/news/email-alias-set-up-a-professional-email-for-free/",
          "publishedOn": "2022-10-12T22:26:51.000Z",
          "wordCount": 1490,
          "title": "Email Alias – How to Set Up a Professional Email for Free",
          "imageUrl": "https://www.freecodecamp.org/news/content/images/2022/10/Email-Alias-with-Gmail.png"
        },
        {
          "id": "https://www.freecodecamp.org/news/data-visualization-tools-guide/",
          "author": "Ihechikara Vincent Abba",
          "description": "Data visualization is the process of interpreting or representing data graphically. Generally, it is the graphical or visual representation of data using charts, tables, histograms, and other info-graphics.  Data plays a major role in any type of organization. Data visualization helps us understand certain trends and insights, and make",
          "link": "https://www.freecodecamp.org/news/data-visualization-tools-guide/",
          "publishedOn": "2022-10-12T17:45:21.000Z",
          "wordCount": 2031,
          "title": "Data Visualization Tools – 2022 Guide",
          "imageUrl": "https://www.freecodecamp.org/news/content/images/2022/10/luke-chesser-JKUTrJ4vK00-unsplash.jpg"
        },
        {
          "id": "https://www.freecodecamp.org/news/learn-docker-and-kubernetes-hands-on-course/",
          "author": "Beau Carnes",
          "description": "Docker and Kubernetes are important technologies that can help you scale your applications. Docker is a platform for packaging, deploying, and running applications in containers. Kubernetes is a system for managing containerized applications across a cluster of nodes. It provides basic mechanisms for deployment, maintenance, and scaling of applications. We",
          "link": "https://www.freecodecamp.org/news/learn-docker-and-kubernetes-hands-on-course/",
          "publishedOn": "2022-10-12T14:22:50.000Z",
          "wordCount": 1119,
          "title": "Learn Docker and Kubernetes – Free Hands-On Course",
          "imageUrl": "https://www.freecodecamp.org/news/content/images/2022/10/docker.png"
        },
        {
          "id": "https://www.freecodecamp.org/news/how-to-implement-whitelist-in-smartcontracts-erc-721-nft-erc-1155-and-others/",
          "author": "Igor Gaponov",
          "description": "In this article I will show you three ways you can create a whitelist in a smart contract. Here's what we'll discuss:  * On-chain whitelists  * Digital signatures  * Merkle trees All methods are available in the repo here [https://github.com/gapon2401/smartcontract-whitelist]. A whitelist is useful if you want",
          "link": "https://www.freecodecamp.org/news/how-to-implement-whitelist-in-smartcontracts-erc-721-nft-erc-1155-and-others/",
          "publishedOn": "2022-10-12T14:12:02.000Z",
          "wordCount": 2642,
          "title": "How to Implement a Whitelist in Smart Contracts (ERC-721 NFT, ERC-1155, and others)",
          "imageUrl": "https://www.freecodecamp.org/news/content/images/2022/10/whitelist-1.jpg"
        },
        {
          "id": "https://www.freecodecamp.org/news/how-web-storage-works/",
          "author": "Tooba Jamal",
          "description": "Anyone who works with the web needs to store data for a later use. Backend developers have some powerful databases in their toolkit. But if you are a frontend developer, you can still store and process data using web storage. In this article, you'll learn what is a web storage,",
          "link": "https://www.freecodecamp.org/news/how-web-storage-works/",
          "publishedOn": "2022-10-12T14:08:46.000Z",
          "wordCount": 1568,
          "title": "How Web Storage Works – Local vs Session Storage Explained",
          "imageUrl": "https://www.freecodecamp.org/news/content/images/2022/10/webstorage-1-1.png"
        },
        {
          "id": "https://www.freecodecamp.org/news/dbms-and-sql-basics/",
          "author": "Bikash Daga (Jain)",
          "description": "Database Management Systems and SQL are two of the most important and widely used tools on the internet today.  You use a Database Management System (DBMS) to store the data you collect from various sources, and SQL to manipulate and access the particular data you want in an efficient",
          "link": "https://www.freecodecamp.org/news/dbms-and-sql-basics/",
          "publishedOn": "2022-10-12T13:57:35.000Z",
          "wordCount": 3446,
          "title": "Database Management Systems and SQL – Tutorial for Beginners",
          "imageUrl": "https://www.freecodecamp.org/news/content/images/2022/09/FreeCodeCamp.png"
        },
        {
          "id": "https://www.freecodecamp.org/news/branding-for-developer-freelancers/",
          "author": "Juan Cruz Martinez",
          "description": "You probably didn’t get into freelance development to become a marketer.  You got into freelancing so you could work when you want, make more money, and control your life. But, if you haven’t realized it yet, building a career as a freelancer requires you to embrace more than just",
          "link": "https://www.freecodecamp.org/news/branding-for-developer-freelancers/",
          "publishedOn": "2022-10-12T13:52:08.000Z",
          "wordCount": 2977,
          "title": "How to Build Your Personal Brand as a Freelance Developer",
          "imageUrl": "https://www.freecodecamp.org/news/content/images/2022/10/Standard-Blog-Post.png"
        },
        {
          "id": "https://www.freecodecamp.org/news/build-a-webshop-with-angular-node-js-typescript-stripe/",
          "author": "Beau Carnes",
          "description": "Learn how to build a webshop from scratch! We just published a course on the freeCodeCamp.org YouTube channel that will teach you how to build a webshop or e-commerce store using Angular/TypeScript, Express.js, and Stripe.  You will learn how to use Angular material and Tailwind to structure the UI",
          "link": "https://www.freecodecamp.org/news/build-a-webshop-with-angular-node-js-typescript-stripe/",
          "publishedOn": "2022-10-12T13:46:34.000Z",
          "wordCount": 809,
          "title": "Build a Webshop with Angular, Node.js, TypeScript, & Stripe",
          "imageUrl": "https://www.freecodecamp.org/news/content/images/2022/10/webshop.png"
        },
        {
          "id": "https://www.freecodecamp.org/news/how-to-recognize-phishing-email/",
          "author": "Jose Vicente Nunez",
          "description": "You know the drill: you open your email client and there is it an email saying that you will be in trouble if you do not follow certain instructions in short time, no questions asked. All it takes is a single click, and you're in trouble. This kind of email",
          "link": "https://www.freecodecamp.org/news/how-to-recognize-phishing-email/",
          "publishedOn": "2022-10-12T00:52:32.000Z",
          "wordCount": 1630,
          "title": "How to Recognize a Phishing Email – And What to Do When You Get One",
          "imageUrl": "https://www.freecodecamp.org/news/content/images/2022/10/five_hours_until_the_bombing_run-1.JPG"
        },
        {
          "id": "https://www.freecodecamp.org/news/fix-typeerror-cannot-read-property-push-of-undefined-in-javascript/",
          "author": "Joel Olawanle",
          "description": "When working with JavaScript arrays, you have to be careful that you are not calling the push(), pop(), shift(), unShift(), or splice() methods on a variable that is meant to be an array but has a value of undefined. If you mistakenly do this, you'll get this error: If you",
          "link": "https://www.freecodecamp.org/news/fix-typeerror-cannot-read-property-push-of-undefined-in-javascript/",
          "publishedOn": "2022-10-11T23:18:26.000Z",
          "wordCount": 1487,
          "title": "How to Fix TypeError: Cannot read Property 'push' of Undefined in JavaScript",
          "imageUrl": "https://www.freecodecamp.org/news/content/images/2022/10/cover-template--13-.png"
        },
        {
          "id": "https://www.freecodecamp.org/news/best-resources-to-learn-golang-for-free/",
          "author": "Avdhoot Fulsundar",
          "description": "Golang has been around for a while now, and it's become quite popular among developers. It is a simple yet compelling programming language that's well-loved because of its powerful features like concurrency and the fact that it is developed by Google. Golang is a server-side language that's used in many",
          "link": "https://www.freecodecamp.org/news/best-resources-to-learn-golang-for-free/",
          "publishedOn": "2022-10-11T23:11:17.000Z",
          "wordCount": 1317,
          "title": "Best Free Resources to Learn Golang – Go Coding Courses",
          "imageUrl": "https://www.freecodecamp.org/news/content/images/2022/10/Gradient-Modern-Digital-Marketing-Facebook-Cover--36-.png"
        },
        {
          "id": "https://www.freecodecamp.org/news/python-programming-tips/",
          "author": "David Fagbuyiro",
          "description": "Python is one of the most popular programming languages out there today. Its simplicity and readability make it a favorite among many programmers. So in this tutorial, I'm sharing a few pointers and strategies to help you improve your Python programming skills. How to Reverse a String in Python In",
          "link": "https://www.freecodecamp.org/news/python-programming-tips/",
          "publishedOn": "2022-10-11T19:47:25.000Z",
          "wordCount": 1539,
          "title": "Python Programming Tips to Help You Level Up Your Code",
          "imageUrl": "https://www.freecodecamp.org/news/content/images/2022/10/pexels-ankush-rathi-925067.jpg"
        }
      ]
    }
  ],
  "cliVersion": "1.15.1"
}