{
  "sources": [
    {
      "title": "CSS-Tricks",
      "feedUrl": "https://css-tricks.com/feed/",
      "siteUrl": "https://css-tricks.com",
      "articles": [
        {
          "id": "https://css-tricks.com/?p=374466",
          "author": "Geoff Graham",
          "description": "By way of a post by Manuel Matuzović which is by way of a demo by Temani Afif.\n.wrapper {\n  margin-inline: max(0px, ((100% - 64rem) / 2)); \n}\nYou’d be doing yourself a favor to read Manuel’s breakdown of …\nManuel Matuzovic: max() Trickery originally published on CSS-Tricks, which is part of the DigitalOcean family. You should get the newsletter.",
          "link": "https://css-tricks.com/manuel-matuzovic-max-trickery/",
          "publishedOn": "2022-10-18T13:54:38.000Z",
          "wordCount": 940,
          "title": "Manuel Matuzovic: max() Trickery",
          "imageUrl": "https://css-tricks.com/wp-json/social-image-generator/v1/image/374466"
        },
        {
          "id": "https://css-tricks.com/?p=373600",
          "author": "Lu Wang",
          "description": "Are you a Bezier curve lover like I am?\nCodePen Embed Fallback\nBesides being elegant, Bezier curves have nice mathematical properties due to their definition and construction. No wonder they are widely used in so many areas:\nAs a \n…\nPure CSS Bezier Curve Motion Paths originally published on CSS-Tricks, which is part of the DigitalOcean family. You should get the newsletter.",
          "link": "https://css-tricks.com/pure-css-bezier-curve-motion-paths/",
          "publishedOn": "2022-10-17T15:30:05.000Z",
          "wordCount": 2406,
          "title": "Pure CSS Bezier Curve Motion Paths",
          "imageUrl": "https://css-tricks.com/wp-json/social-image-generator/v1/image/373600"
        },
        {
          "id": "https://css-tricks.com/?p=374393",
          "author": "Haley Mills",
          "description": "Well, hey, welcome back to Behind the CSScenes! These posts are like little check-ins we’re doing each month to give you a peek behind what we’re doing here at CSS-Tricks, as well as a chance for us to pause …\nBehind the CSScenes, October 2022 originally published on CSS-Tricks, which is part of the DigitalOcean family. You should get the newsletter.",
          "link": "https://css-tricks.com/behind-the-csscenes-october-2022/",
          "publishedOn": "2022-10-14T21:40:26.000Z",
          "wordCount": 1627,
          "title": "Behind the CSScenes, October 2022",
          "imageUrl": "https://css-tricks.com/wp-json/social-image-generator/v1/image/374393"
        },
        {
          "id": "https://css-tricks.com/?p=373965",
          "author": "Temani Afif",
          "description": "As the title says, we are going to decorate images! There’s a bunch of other articles out there that talk about this, but what we’re covering here is quite a bit different because it’s more of a challenge. The challenge? …\nFancy Image Decorations: Single Element Magic originally published on CSS-Tricks, which is part of the DigitalOcean family. You should get the newsletter.",
          "link": "https://css-tricks.com/fancy-image-decorations-single-element-magic/",
          "publishedOn": "2022-10-14T15:37:28.000Z",
          "wordCount": 3232,
          "title": "Fancy Image Decorations: Single Element Magic",
          "imageUrl": "https://css-tricks.com/wp-json/social-image-generator/v1/image/373965"
        },
        {
          "id": "https://css-tricks.com/?p=374401",
          "author": "Geoff Graham",
          "description": "An Event Apart 2022 Denver wrapped up yesterday. And while I was unable to make it to all three days this time, I did catch yesterday’s action — and it was awesome. I’m not very social or outgoing, but …\nSome Things I Took Away From An Event Apart 2022 in Denver originally published on CSS-Tricks, which is part of the DigitalOcean family. You should get the newsletter.",
          "link": "https://css-tricks.com/some-things-i-took-away-from-an-event-apart-2022-in-denver/",
          "publishedOn": "2022-10-13T20:01:00.000Z",
          "wordCount": 1872,
          "title": "Some Things I Took Away From An Event Apart 2022 in Denver",
          "imageUrl": "https://css-tricks.com/wp-json/social-image-generator/v1/image/374401"
        },
        {
          "id": "https://css-tricks.com/?p=373508",
          "author": "Krzysztof Gonciarz",
          "description": "Oftentimes in the past, I needed to figure out how to add styles to all elements inside the container but not the hovered one.\nDemo of the expected “fade-out” effect on siblings to let users “focus” on a particular element.…\nA Pure CSS Gallery Focus Effect with :not originally published on CSS-Tricks, which is part of the DigitalOcean family. You should get the newsletter.",
          "link": "https://css-tricks.com/a-pure-css-gallery-focus-effect-with-not/",
          "publishedOn": "2022-10-13T15:10:15.000Z",
          "wordCount": 1454,
          "title": "A Pure CSS Gallery Focus Effect with :not",
          "imageUrl": "https://css-tricks.com/wp-json/social-image-generator/v1/image/373508"
        },
        {
          "id": "https://css-tricks.com/?p=374330",
          "author": "Geoff Graham",
          "description": "We’re still in suuuuuper early days with container queries. Too early for broad browser support, but Chromium already supports it, Safari started supporting it in version 16, and Firefox is presumably not far behind.\nMost early days conversations …\nEarly Days of Container Style Queries originally published on CSS-Tricks, which is part of the DigitalOcean family. You should get the newsletter.",
          "link": "https://css-tricks.com/early-days-of-container-style-queries/",
          "publishedOn": "2022-10-12T13:06:46.000Z",
          "wordCount": 1400,
          "title": "Early Days of Container Style Queries",
          "imageUrl": "https://css-tricks.com/wp-json/social-image-generator/v1/image/374330"
        },
        {
          "id": "https://css-tricks.com/?p=373952",
          "author": "Manoj Kumar",
          "description": "There’ve been some new tutorials popping here on CSS-Tricks for working with WordPress blocks. One of them is an introduction to WordPress block development and it’s a good place to learn what blocks are and to register them in WordPress …\nRendering External API Data in WordPress Blocks on the Front End originally published on CSS-Tricks, which is part of the DigitalOcean family. You should get the newsletter.",
          "link": "https://css-tricks.com/rendering-external-api-data-in-wordpress-blocks-on-the-front-end/",
          "publishedOn": "2022-10-11T16:15:48.000Z",
          "wordCount": 2967,
          "title": "Rendering External API Data in WordPress Blocks on the Front End",
          "imageUrl": "https://css-tricks.com/wp-json/social-image-generator/v1/image/373952"
        },
        {
          "id": "https://css-tricks.com/?p=373905",
          "author": "Ganesh Dahal",
          "description": "Fluid typography is a fancy way of “describing font properties, such as size or line height, that scale fluidly according to the size of the viewport”. It’s also known by other names, like responsive typography, flexible type, fluid type, …\nAdding Fluid Typography Support to WordPress Block Themes originally published on CSS-Tricks, which is part of the DigitalOcean family. You should get the newsletter.",
          "link": "https://css-tricks.com/fluid-typography-wordpress-block-themes/",
          "publishedOn": "2022-10-07T13:19:23.000Z",
          "wordCount": 3088,
          "title": "Adding Fluid Typography Support to WordPress Block Themes",
          "imageUrl": "https://css-tricks.com/wp-json/social-image-generator/v1/image/373905"
        },
        {
          "id": "https://css-tricks.com/?p=373798",
          "author": "Lorenzo Bonannella",
          "description": "Spammers are a huge deal nowadays. If you want to share your contact information without getting overwhelmed by spam email you need a solution. I run into this problem a few months ago. While I was researching how to solve …\nHow to Safely Share Your Email Address on a Website originally published on CSS-Tricks, which is part of the DigitalOcean family. You should get the newsletter.",
          "link": "https://css-tricks.com/how-to-safely-share-your-email-address-on-a-website/",
          "publishedOn": "2022-10-06T12:54:53.000Z",
          "wordCount": 2194,
          "title": "How to Safely Share Your Email Address on a Website",
          "imageUrl": "https://css-tricks.com/wp-json/social-image-generator/v1/image/373798"
        },
        {
          "id": "https://css-tricks.com/?p=373787",
          "author": "Adam Rackis",
          "description": "In my previous post we looked at Shoelace, which is a component library with a full suite of UX components that are beautiful, accessible, and — perhaps unexpectedly — built with Web Components. This means they can be used …\nUsing Web Components With Next (or Any SSR Framework) originally published on CSS-Tricks, which is part of the DigitalOcean family. You should get the newsletter.",
          "link": "https://css-tricks.com/using-web-components-with-next-or-any-ssr-framework/",
          "publishedOn": "2022-10-05T13:05:43.000Z",
          "wordCount": 2287,
          "title": "Using Web Components With Next (or Any SSR Framework)",
          "imageUrl": "https://css-tricks.com/wp-json/social-image-generator/v1/image/373787"
        },
        {
          "id": "https://css-tricks.com/?p=374217",
          "author": "Geoff Graham",
          "description": "The State of CSS survey recently opened up. Last year, the survey confirmed everyone’s assumptions that TailwindCSS is super popular and CSS variables are mainstream. It also codified what many of us want from CSS, from Container Queries to …\nState of CSS 2022 Survey Now Open originally published on CSS-Tricks, which is part of the DigitalOcean family. You should get the newsletter.",
          "link": "https://css-tricks.com/state-of-css-2022-survey-now-open/",
          "publishedOn": "2022-10-04T18:35:09.000Z",
          "wordCount": 828,
          "title": "State of CSS 2022 Survey Now Open",
          "imageUrl": "https://css-tricks.com/wp-json/social-image-generator/v1/image/374217"
        },
        {
          "id": "https://css-tricks.com/?p=373703",
          "author": "Adam Rackis",
          "description": "This is a post about Shoelace, a component library by Cory LaViska, but with a twist. It defines all your standard UX components: tabs, modals, accordions, auto-completes, and much, much more. They look beautiful out of the …\nIntroducing Shoelace, a Framework-Independent Component-Based UX Library originally published on CSS-Tricks, which is part of the DigitalOcean family. You should get the newsletter.",
          "link": "https://css-tricks.com/shoelace-component-frameowrk-introduction/",
          "publishedOn": "2022-10-04T13:01:53.000Z",
          "wordCount": 2755,
          "title": "Introducing Shoelace, a Framework-Independent Component-Based UX Library",
          "imageUrl": "https://css-tricks.com/wp-json/social-image-generator/v1/image/373703"
        },
        {
          "id": "https://css-tricks.com/?p=373732",
          "author": "Arjun Singh",
          "description": "Let’s acknowledge that developing for WordPress is weird right now. Whether you’re new to WordPress or have worked with it for eons, the introduction of “Full-Site Editing” (FSE) features, including the Block Editor (WordPress 5.0) and the Site Editor (WordPress …\nGetting Started With WordPress Block Development originally published on CSS-Tricks, which is part of the DigitalOcean family. You should get the newsletter.",
          "link": "https://css-tricks.com/getting-started-with-wordpress-block-development/",
          "publishedOn": "2022-09-30T13:04:56.000Z",
          "wordCount": 5402,
          "title": "Getting Started With WordPress Block Development",
          "imageUrl": "https://css-tricks.com/wp-json/social-image-generator/v1/image/373732"
        },
        {
          "id": "https://css-tricks.com/?p=373484",
          "author": "Ollie Williams",
          "description": "So you want an auto-playing looping video without sound? In popular vernacular this is the very meaning of the word GIF. The word has stuck around but the image format itself is ancient and obsolete. Twitter, for example, has …\nGIFs Without the .gif: The Most Performant Image and Video Options Right Now originally published on CSS-Tricks, which is part of the DigitalOcean family. You should get the newsletter.",
          "link": "https://css-tricks.com/gifs-without-the-gif-the-most-performant-image-and-video-options-right-now/",
          "publishedOn": "2022-09-28T13:09:11.000Z",
          "wordCount": 4034,
          "title": "GIFs Without the .gif: The Most Performant Image and Video Options Right Now",
          "imageUrl": "https://css-tricks.com/wp-json/social-image-generator/v1/image/373484"
        },
        {
          "id": "https://css-tricks.com/?p=373209",
          "author": "Matteo Mazzarolo",
          "description": "Did you know that DOM elements with IDs are accessible in JavaScript as global variables? It’s one of those things that’s been around, like, forever but I’m really digging into it for the first time.\nIf this is the first …\nNamed Element IDs Can Be Referenced as JavaScript Globals originally published on CSS-Tricks, which is part of the DigitalOcean family. You should get the newsletter.",
          "link": "https://css-tricks.com/named-element-ids-can-be-referenced-as-javascript-globals/",
          "publishedOn": "2022-09-27T12:58:21.000Z",
          "wordCount": 2450,
          "title": "Named Element IDs Can Be Referenced as JavaScript Globals",
          "imageUrl": "https://css-tricks.com/wp-json/social-image-generator/v1/image/373209"
        },
        {
          "id": "https://css-tricks.com/?p=373403",
          "author": "Temani Afif",
          "description": "The wave is probably one of the most difficult shapes to make in CSS. We always try to approximate it with properties like border-radius and lots of magic numbers until we get something that feels kinda close. And that’s before …\nHow to Create Wavy Shapes & Patterns in CSS originally published on CSS-Tricks, which is part of the DigitalOcean family. You should get the newsletter.",
          "link": "https://css-tricks.com/how-to-create-wavy-shapes-patterns-in-css/",
          "publishedOn": "2022-09-26T13:13:30.000Z",
          "wordCount": 4304,
          "title": "How to Create Wavy Shapes & Patterns in CSS",
          "imageUrl": "https://css-tricks.com/wp-json/social-image-generator/v1/image/373403"
        },
        {
          "id": "https://css-tricks.com/?p=373057",
          "author": "Ganesh Dahal",
          "description": "If we browse the WordPress theme directory, a majority of themes showcase cover images. It is a feature in popular demand. The cover page trend is true even in the block theme directory screenshots as well.\nLet’s consider the …\nHow To Customize WordPress Block Theme Cover Templates with Dynamic Post Feature Images originally published on CSS-Tricks, which is part of the DigitalOcean family. You should get the newsletter.",
          "link": "https://css-tricks.com/how-to-customize-wordpress-block-theme-cover-templates-with-dynamic-post-feature-images/",
          "publishedOn": "2022-09-23T16:15:19.000Z",
          "wordCount": 3482,
          "title": "How To Customize WordPress Block Theme Cover Templates with Dynamic Post Feature Images",
          "imageUrl": "https://css-tricks.com/wp-json/social-image-generator/v1/image/373057"
        },
        {
          "id": "https://css-tricks.com/?p=373652",
          "author": "Geoff Graham",
          "description": "The video of Chris Coyier’s talk at CascadiaJS 2022 is now available. It’s his first in-person talk in more than two years, so it’s great to see our good friend back on stage slinging gems on what makes the web …\nThe Web is Good Now originally published on CSS-Tricks, which is part of the DigitalOcean family. You should get the newsletter.",
          "link": "https://css-tricks.com/the-web-is-good-now/",
          "publishedOn": "2022-09-22T22:07:22.000Z",
          "wordCount": 900,
          "title": "The Web is Good Now",
          "imageUrl": "https://css-tricks.com/wp-json/social-image-generator/v1/image/373652"
        },
        {
          "id": "https://css-tricks.com/?p=373111",
          "author": "Louis Hoebregts",
          "description": "SVG is the best format for icons on a website, there is no doubt about that. It allows you to have sharp icons no matter the screen pixel density, you can change the styles of the SVG on hover …\nHow I Made an Icon System Out of CSS Custom Properties originally published on CSS-Tricks, which is part of the DigitalOcean family. You should get the newsletter.",
          "link": "https://css-tricks.com/how-i-made-an-icon-system-out-of-css-custom-properties/",
          "publishedOn": "2022-09-22T15:17:21.000Z",
          "wordCount": 2123,
          "title": "How I Made an Icon System Out of CSS Custom Properties",
          "imageUrl": "https://css-tricks.com/wp-json/social-image-generator/v1/image/373111"
        },
        {
          "id": "https://css-tricks.com/?p=373639",
          "author": "Geoff Graham",
          "description": "The latest spec:\nA style rule is a qualified rule that associates a selector list with a list of property declarations and possibly a list of nested rules. They are also called rule sets in CSS2.\nLouis Lazaris:\nAs the above quote from W3C indicates, it seems \n…\nCSS Rules vs. CSS Rulesets originally published on CSS-Tricks, which is part of the DigitalOcean family. You should get the newsletter.",
          "link": "https://css-tricks.com/css-rules-vs-css-rulesets/",
          "publishedOn": "2022-09-21T21:53:44.000Z",
          "wordCount": 922,
          "title": "CSS Rules vs. CSS Rulesets",
          "imageUrl": "https://css-tricks.com/wp-json/social-image-generator/v1/image/373639"
        },
        {
          "id": "https://css-tricks.com/?p=373167",
          "author": "Preethi",
          "description": "On one hand, creating simple checkered backgrounds with CSS is easy. On the other hand, though, unless we are one of the CSS-gradient-ninjas, we are kind of stuck with basic patterns.\nAt least that’s what I thought while staring at …\nCSS Checkerboard Background… But With Rounded Corners and Hover Styles originally published on CSS-Tricks, which is part of the DigitalOcean family. You should get the newsletter.",
          "link": "https://css-tricks.com/css-checkerboard-background-but-with-rounded-corners-and-hover-styles/",
          "publishedOn": "2022-09-20T13:19:24.000Z",
          "wordCount": 1515,
          "title": "CSS Checkerboard Background… But With Rounded Corners and Hover Styles",
          "imageUrl": "https://css-tricks.com/wp-json/social-image-generator/v1/image/373167"
        }
      ]
    },
    {
      "title": "Articles on Smashing Magazine — For Web Designers And Developers",
      "feedUrl": "https://www.smashingmagazine.com/feed/",
      "siteUrl": "https://www.smashingmagazine.com/",
      "articles": [
        {
          "id": "https://smashingmagazine.com/2022/10/wordpress-full-site-editing/",
          "author": "hello@smashingmagazine.com (Nick Schäferhoff)",
          "description": "In this article, Nick Schäferhoff will take a deep dive into WordPress Full-Site Editing, examine the tools it provides for theme development, and provide a tutorial on how to use it to make changes to your site.",
          "link": "https://smashingmagazine.com/2022/10/wordpress-full-site-editing/",
          "publishedOn": "2022-10-17T12:00:00.000Z",
          "wordCount": 8369,
          "title": "WordPress Full-Site Editing: A Deep Dive Into The New Feature",
          "enclosure": {
            "url": "http://cloud.netlifyusercontent.com/assets/344dbf88-fdf9-42bb-adb4-46f01eedd629/e92a7c2c-7748-4eb9-8ab8-6a534ad201e0/wordpress-full-site-editing.jpg",
            "length": "0",
            "type": "image/jpg"
          },
          "imageUrl": "http://cloud.netlifyusercontent.com/assets/344dbf88-fdf9-42bb-adb4-46f01eedd629/e92a7c2c-7748-4eb9-8ab8-6a534ad201e0/wordpress-full-site-editing.jpg"
        },
        {
          "id": "https://smashingmagazine.com/2022/10/effective-communication-everyday-meetings/",
          "author": "hello@smashingmagazine.com (Andrii Zhdan)",
          "description": "In this article about conducting productive meetings, Andrii Zhdan will give you a step-by-step guide on preparing a solid meeting structure that will let you follow the original plan and reach the meeting goals, and he will also share a few tips based on his design experience.",
          "link": "https://smashingmagazine.com/2022/10/effective-communication-everyday-meetings/",
          "publishedOn": "2022-10-13T15:00:00.000Z",
          "wordCount": 6170,
          "title": "Effective Communication For Everyday Meetings",
          "enclosure": {
            "url": "http://cloud.netlifyusercontent.com/assets/344dbf88-fdf9-42bb-adb4-46f01eedd629/e3c62052-4769-4a7d-8473-828a3e05ff74/effective-communication-everyday-meetings.jpg",
            "length": "0",
            "type": "image/jpg"
          },
          "imageUrl": "http://cloud.netlifyusercontent.com/assets/344dbf88-fdf9-42bb-adb4-46f01eedd629/e3c62052-4769-4a7d-8473-828a3e05ff74/effective-communication-everyday-meetings.jpg"
        },
        {
          "id": "https://smashingmagazine.com/2022/10/sustainable-web-development-strategies-organization/",
          "author": "hello@smashingmagazine.com (Michelle Barker)",
          "description": "Climate change and sustainability are increasing concerns for digital organizations, as well as individuals working in tech. In this article we’ll explore some of the ways we can raise awareness and effect change within an organization, to create a more positive environmental impact.",
          "link": "https://smashingmagazine.com/2022/10/sustainable-web-development-strategies-organization/",
          "publishedOn": "2022-10-11T15:30:00.000Z",
          "wordCount": 4997,
          "title": "Sustainable Web Development Strategies Within An Organization",
          "enclosure": {
            "url": "http://cloud.netlifyusercontent.com/assets/344dbf88-fdf9-42bb-adb4-46f01eedd629/9507c0d1-3621-43ae-9996-0f85fe77dbef/sustainable-web-development-strategies-organization.jpg",
            "length": "0",
            "type": "image/jpg"
          },
          "imageUrl": "http://cloud.netlifyusercontent.com/assets/344dbf88-fdf9-42bb-adb4-46f01eedd629/9507c0d1-3621-43ae-9996-0f85fe77dbef/sustainable-web-development-strategies-organization.jpg"
        },
        {
          "id": "https://smashingmagazine.com/2022/10/ui-animations-shared-element-transitions-api-part2/",
          "author": "hello@smashingmagazine.com (Adrian Bece)",
          "description": "In this article, Adrian Bece will show how to create same-document page transitions for Single Page Apps using Shared Element Transitions API and check out its future implementation and potential for creating cross-document transitions in Multi-Page Apps.",
          "link": "https://smashingmagazine.com/2022/10/ui-animations-shared-element-transitions-api-part2/",
          "publishedOn": "2022-10-10T09:00:00.000Z",
          "wordCount": 5513,
          "title": "Delightful UI Animations With Shared Element Transitions API (Part 2)",
          "enclosure": {
            "url": "http://cloud.netlifyusercontent.com/assets/344dbf88-fdf9-42bb-adb4-46f01eedd629/24c75fda-847f-4fc5-b9c2-9118523bda6b/ui-animations-shared-element-transitions-api.jpg",
            "length": "0",
            "type": "image/jpg"
          },
          "imageUrl": "http://cloud.netlifyusercontent.com/assets/344dbf88-fdf9-42bb-adb4-46f01eedd629/24c75fda-847f-4fc5-b9c2-9118523bda6b/ui-animations-shared-element-transitions-api.jpg"
        },
        {
          "id": "https://smashingmagazine.com/2022/10/roadmap-building-business-chatbot/",
          "author": "hello@smashingmagazine.com (Devansh Bansal)",
          "description": "Owing to tremendous advancements in Machine Learning and other technologies, chatbots have increased in popularity in the past few years. This article will show you, step by step, how to build a chatbot that meets your business goals.",
          "link": "https://smashingmagazine.com/2022/10/roadmap-building-business-chatbot/",
          "publishedOn": "2022-10-07T08:00:00.000Z",
          "wordCount": 5753,
          "title": "A Roadmap For Building A Business Chatbot",
          "enclosure": {
            "url": "http://cloud.netlifyusercontent.com/assets/344dbf88-fdf9-42bb-adb4-46f01eedd629/2bd63d9c-b78d-4900-8a7c-3539bf497433/roadmap-building-business-chatbot.jpg",
            "length": "0",
            "type": "image/jpg"
          },
          "imageUrl": "http://cloud.netlifyusercontent.com/assets/344dbf88-fdf9-42bb-adb4-46f01eedd629/2bd63d9c-b78d-4900-8a7c-3539bf497433/roadmap-building-business-chatbot.jpg"
        },
        {
          "id": "https://smashingmagazine.com/2022/10/nodejs-authentication-twilio-verify/",
          "author": "hello@smashingmagazine.com (Alexander Godwin)",
          "description": "Integrate two-factor authentication into your Express.js app by building an application that authenticates users using password-based authentication and OTPs powered by the Twilio Verify service.",
          "link": "https://smashingmagazine.com/2022/10/nodejs-authentication-twilio-verify/",
          "publishedOn": "2022-10-07T06:00:00.000Z",
          "wordCount": 7895,
          "title": "Node.js Authentication With Twilio Verify",
          "enclosure": {
            "url": "http://cloud.netlifyusercontent.com/assets/344dbf88-fdf9-42bb-adb4-46f01eedd629/e77a7ee4-c2ed-4b4c-a147-16df351a6b31/nodejs-authentication-twilio-verify-sharing-card.jpg",
            "length": "0",
            "type": "image/jpg"
          },
          "imageUrl": "http://cloud.netlifyusercontent.com/assets/344dbf88-fdf9-42bb-adb4-46f01eedd629/e77a7ee4-c2ed-4b4c-a147-16df351a6b31/nodejs-authentication-twilio-verify-sharing-card.jpg"
        },
        {
          "id": "https://smashingmagazine.com/2022/10/fluid-typography-clamp-sass-functions/",
          "author": "hello@smashingmagazine.com (Brecht De Ruyte)",
          "description": "We can use the `clamp()` method today because of the great browser support. In this article, Brecht De Ruyte explains how it can be a beautiful addition to your upcoming project or as an upgrade to a previous one.",
          "link": "https://smashingmagazine.com/2022/10/fluid-typography-clamp-sass-functions/",
          "publishedOn": "2022-10-05T12:00:00.000Z",
          "wordCount": 4142,
          "title": "Easy Fluid Typography With clamp() Using Sass Functions",
          "enclosure": {
            "url": "http://cloud.netlifyusercontent.com/assets/344dbf88-fdf9-42bb-adb4-46f01eedd629/8ced8e27-33ad-4e3d-9e45-970f5324c8d4/fluid-typography-clamp-sass-functions.jpg",
            "length": "0",
            "type": "image/jpg"
          },
          "imageUrl": "http://cloud.netlifyusercontent.com/assets/344dbf88-fdf9-42bb-adb4-46f01eedd629/8ced8e27-33ad-4e3d-9e45-970f5324c8d4/fluid-typography-clamp-sass-functions.jpg"
        },
        {
          "id": "https://smashingmagazine.com/2022/10/ui-animations-shared-element-transitions-api-part1/",
          "author": "hello@smashingmagazine.com (Adrian Bece)",
          "description": "Shared Element Transitions API is a game-changing feature that will enable us to create impressive and elaborate UI animations easily. In this article, Adrian Bece will explore its incredible potential by building four real-life examples from scratch.",
          "link": "https://smashingmagazine.com/2022/10/ui-animations-shared-element-transitions-api-part1/",
          "publishedOn": "2022-10-03T13:00:00.000Z",
          "wordCount": 7753,
          "title": "Delightful UI Animations With Shared Element Transitions API (Part 1)",
          "enclosure": {
            "url": "http://cloud.netlifyusercontent.com/assets/344dbf88-fdf9-42bb-adb4-46f01eedd629/aa71c04f-6c9e-4717-8767-a6f31f3c20c9/ui-animations-shared-element-transitions-api-part1.jpg",
            "length": "0",
            "type": "image/jpg"
          },
          "imageUrl": "http://cloud.netlifyusercontent.com/assets/344dbf88-fdf9-42bb-adb4-46f01eedd629/aa71c04f-6c9e-4717-8767-a6f31f3c20c9/ui-animations-shared-element-transitions-api-part1.jpg"
        },
        {
          "id": "https://smashingmagazine.com/2022/09/desktop-wallpaper-calendars-october-2022/",
          "author": "hello@smashingmagazine.com (Cosima Mielke)",
          "description": "How about a little inspiration boost? Well, we might have something for you: desktop wallpapers created with love by artists and designers from across the globe. They are available in versions with and without a calendar for October and can be downloaded for free. Enjoy!",
          "link": "https://smashingmagazine.com/2022/09/desktop-wallpaper-calendars-october-2022/",
          "publishedOn": "2022-09-30T13:30:00.000Z",
          "wordCount": 5020,
          "title": "October Vibes For Your Desktop (2022 Wallpapers Edition)",
          "enclosure": {
            "url": "http://cloud.netlifyusercontent.com/assets/344dbf88-fdf9-42bb-adb4-46f01eedd629/5e6453cd-7ad1-45e4-b88c-afe922049104/oct-22-dreamy-autumn-girl-preview-opt.png",
            "length": "0",
            "type": "image/png"
          },
          "imageUrl": "http://cloud.netlifyusercontent.com/assets/344dbf88-fdf9-42bb-adb4-46f01eedd629/5e6453cd-7ad1-45e4-b88c-afe922049104/oct-22-dreamy-autumn-girl-preview-opt.png"
        },
        {
          "id": "https://smashingmagazine.com/2022/09/unconscious-biases-inclusive-design/",
          "author": "hello@smashingmagazine.com (Trina Moore Pervall)",
          "description": "Throughout the research and design processes, our unconscious biases are the greatest risk to delivering inclusive experiences. From who we include and exclude in our research to how we plan and conduct research to how we analyze findings, it’s crucial that we understand how our unacknowledged biases can perpetuate systems of exclusion.",
          "link": "https://smashingmagazine.com/2022/09/unconscious-biases-inclusive-design/",
          "publishedOn": "2022-09-29T21:00:00.000Z",
          "wordCount": 4871,
          "title": "Unconscious Biases That Get In The Way Of Inclusive Design",
          "enclosure": {
            "url": "http://cloud.netlifyusercontent.com/assets/344dbf88-fdf9-42bb-adb4-46f01eedd629/353aec29-80ea-4143-935a-c24bcd89593f/unconscious-biases-inclusive-design.jpg",
            "length": "0",
            "type": "image/jpg"
          },
          "imageUrl": "http://cloud.netlifyusercontent.com/assets/344dbf88-fdf9-42bb-adb4-46f01eedd629/353aec29-80ea-4143-935a-c24bcd89593f/unconscious-biases-inclusive-design.jpg"
        },
        {
          "id": "https://smashingmagazine.com/2022/09/ten-principles-consider-building-security-strategy-case-study/",
          "author": "hello@smashingmagazine.com (Wix Security Team)",
          "description": "In this article, Wix security experts share ten “security by design” principles that emerged from their work in keeping the Wix platform secure. If you’re a developer, these tried-and-true principles can help you build your own secure applications.",
          "link": "https://smashingmagazine.com/2022/09/ten-principles-consider-building-security-strategy-case-study/",
          "publishedOn": "2022-09-29T12:00:00.000Z",
          "wordCount": 5290,
          "title": "Building Your Security Strategy (Case Study)",
          "enclosure": {
            "url": "http://cloud.netlifyusercontent.com/assets/344dbf88-fdf9-42bb-adb4-46f01eedd629/1504d71c-665f-4bef-81ff-f09c25cc55eb/building-your-security-strategy.jpg",
            "length": "0",
            "type": "image/jpg"
          },
          "imageUrl": "http://cloud.netlifyusercontent.com/assets/344dbf88-fdf9-42bb-adb4-46f01eedd629/1504d71c-665f-4bef-81ff-f09c25cc55eb/building-your-security-strategy.jpg"
        },
        {
          "id": "https://smashingmagazine.com/2022/09/phone-numbers-web-designers/",
          "author": "hello@smashingmagazine.com (Onno Westra)",
          "description": "The customer journey is not limited to a website alone. Simply by combining the world of website design and telephony, far better results can be obtained for your organization. And thanks to the similarities and mutual benefits, it is an easy step to take.",
          "link": "https://smashingmagazine.com/2022/09/phone-numbers-web-designers/",
          "publishedOn": "2022-09-28T11:00:00.000Z",
          "wordCount": 4828,
          "title": "Phone Numbers For Web Designers",
          "enclosure": {
            "url": "http://cloud.netlifyusercontent.com/assets/344dbf88-fdf9-42bb-adb4-46f01eedd629/20a14bbc-76a0-49f8-828b-0718c7c1f5a8/phone-numbers-web-designers.jpg",
            "length": "0",
            "type": "image/jpg"
          },
          "imageUrl": "http://cloud.netlifyusercontent.com/assets/344dbf88-fdf9-42bb-adb4-46f01eedd629/20a14bbc-76a0-49f8-828b-0718c7c1f5a8/phone-numbers-web-designers.jpg"
        },
        {
          "id": "https://smashingmagazine.com/2022/09/data-loading-patterns-improve-frontend-performance/",
          "author": "hello@smashingmagazine.com (Agustinus Theodorus)",
          "description": "You don’t need a framework for everything, but if you use one, this article will help you use it in the most performant way.",
          "link": "https://smashingmagazine.com/2022/09/data-loading-patterns-improve-frontend-performance/",
          "publishedOn": "2022-09-27T14:00:00.000Z",
          "wordCount": 5758,
          "title": "Five Data-Loading Patterns To Boost Web Performance",
          "enclosure": {
            "url": "http://cloud.netlifyusercontent.com/assets/344dbf88-fdf9-42bb-adb4-46f01eedd629/b4b98819-8676-4a35-b3a1-ab5428b36784/data-loading-patterns-boost-web-performance.jpg",
            "length": "0",
            "type": "image/jpg"
          },
          "imageUrl": "http://cloud.netlifyusercontent.com/assets/344dbf88-fdf9-42bb-adb4-46f01eedd629/b4b98819-8676-4a35-b3a1-ab5428b36784/data-loading-patterns-boost-web-performance.jpg"
        },
        {
          "id": "https://smashingmagazine.com/2022/09/meet-smashingconf-new-york/",
          "author": "hello@smashingmagazine.com (Vitaly Friedman)",
          "description": "SmashingConf NYC is back! A friendly, inclusive conference for designers and front-end engineers who can’t wait to learn and be inspired. October 10–13, 2022. Get your ticket!",
          "link": "https://smashingmagazine.com/2022/09/meet-smashingconf-new-york/",
          "publishedOn": "2022-09-26T10:30:00.000Z",
          "wordCount": 3158,
          "title": "Meet SmashingConf New York 🇺🇸 (Oct 10&ndash;13)",
          "enclosure": {
            "url": "http://cloud.netlifyusercontent.com/assets/344dbf88-fdf9-42bb-adb4-46f01eedd629/6b0218f4-6266-412a-ace8-ea05b1ad688d/smashingconf-ny-banner.png",
            "length": "0",
            "type": "image/png"
          },
          "imageUrl": "http://cloud.netlifyusercontent.com/assets/344dbf88-fdf9-42bb-adb4-46f01eedd629/6b0218f4-6266-412a-ace8-ea05b1ad688d/smashingconf-ny-banner.png"
        },
        {
          "id": "https://smashingmagazine.com/2022/09/lessons-learned-designer-founder/",
          "author": "hello@smashingmagazine.com (Dave Feldman)",
          "description": "In this article, Dave Feldman shares his lessons learned and the experiments has done as a multidisciplinary designer-founder-CEO at an early-stage startup. Let’s take a look at what it is that makes a great design process for teams of any size.",
          "link": "https://smashingmagazine.com/2022/09/lessons-learned-designer-founder/",
          "publishedOn": "2022-09-23T11:30:00.000Z",
          "wordCount": 5539,
          "title": "Lessons Learned As A Designer-Founder",
          "enclosure": {
            "url": "http://cloud.netlifyusercontent.com/assets/344dbf88-fdf9-42bb-adb4-46f01eedd629/273285f3-018f-4ce0-9c9c-06310070caaf/lessons-learned-designer-founder.jpg",
            "length": "0",
            "type": "image/jpg"
          },
          "imageUrl": "http://cloud.netlifyusercontent.com/assets/344dbf88-fdf9-42bb-adb4-46f01eedd629/273285f3-018f-4ce0-9c9c-06310070caaf/lessons-learned-designer-founder.jpg"
        },
        {
          "id": "https://smashingmagazine.com/2022/09/angular-guide/",
          "author": "hello@smashingmagazine.com (William Juan)",
          "description": "If you’re considering learning Angular, this article sums up what William Juan wished he knew when he started, including the mistakes made and lessons learned the hard way.",
          "link": "https://smashingmagazine.com/2022/09/angular-guide/",
          "publishedOn": "2022-09-22T13:00:00.000Z",
          "wordCount": 5673,
          "title": "Things I Wish I Had Known About Angular When I Started",
          "enclosure": {
            "url": "http://cloud.netlifyusercontent.com/assets/344dbf88-fdf9-42bb-adb4-46f01eedd629/ef27939e-040f-49bc-bd4e-1af6d80a84ac/angular-guide.jpg",
            "length": "0",
            "type": "image/jpg"
          },
          "imageUrl": "http://cloud.netlifyusercontent.com/assets/344dbf88-fdf9-42bb-adb4-46f01eedd629/ef27939e-040f-49bc-bd4e-1af6d80a84ac/angular-guide.jpg"
        },
        {
          "id": "https://smashingmagazine.com/2022/09/inline-validation-web-forms-ux/",
          "author": "hello@smashingmagazine.com (Vitaly Friedman)",
          "description": "Inline validation in web forms is useful when it works, but frustrating when it fails. Too often it leads to an endless stream of disruptive error messages or dead-ends without any chance of getting out. Let’s fix it.",
          "link": "https://smashingmagazine.com/2022/09/inline-validation-web-forms-ux/",
          "publishedOn": "2022-09-21T11:30:00.000Z",
          "wordCount": 6436,
          "title": "Designing Better Inline Validation UX",
          "enclosure": {
            "url": "http://cloud.netlifyusercontent.com/assets/344dbf88-fdf9-42bb-adb4-46f01eedd629/64066efe-71fa-45b6-8e86-caf46c423b64/clean-up-input-ux-pattern.jpg",
            "length": "0",
            "type": "image/jpg"
          },
          "imageUrl": "http://cloud.netlifyusercontent.com/assets/344dbf88-fdf9-42bb-adb4-46f01eedd629/64066efe-71fa-45b6-8e86-caf46c423b64/clean-up-input-ux-pattern.jpg"
        },
        {
          "id": "https://smashingmagazine.com/2022/09/smashing-podcast-episode-53/",
          "author": "hello@smashingmagazine.com (Drew McLellan)",
          "description": "In this episode of the Smashing Podcast, we’re talking about HTML email. Do we still have to design like we would for IE5? Vitaly talks to expert Rémi Parmentier to find out.",
          "link": "https://smashingmagazine.com/2022/09/smashing-podcast-episode-53/",
          "publishedOn": "2022-09-20T13:00:00.000Z",
          "wordCount": 9461,
          "title": "Smashing Podcast Episode 53 With Rémi Parmentier: Can HTML Email Use Modern CSS?",
          "enclosure": {
            "url": "http://cloud.netlifyusercontent.com/assets/344dbf88-fdf9-42bb-adb4-46f01eedd629/3eaf789d-a932-4d1f-a811-3406e0c63644/smashing-podcast-episode-53.png",
            "length": "0",
            "type": "image/png"
          },
          "imageUrl": "http://cloud.netlifyusercontent.com/assets/344dbf88-fdf9-42bb-adb4-46f01eedd629/3eaf789d-a932-4d1f-a811-3406e0c63644/smashing-podcast-episode-53.png"
        },
        {
          "id": "https://smashingmagazine.com/2022/09/new-gatsby-2022/",
          "author": "hello@smashingmagazine.com (Paul Scanlon)",
          "description": "Gatsby has evolved quite dramatically in the last two years. In this article, Paul Scanlon explains what Gatsby can do today, and how he used some of the new features when upgrading his personal website from Gatsby 2 to Gatsby 4.",
          "link": "https://smashingmagazine.com/2022/09/new-gatsby-2022/",
          "publishedOn": "2022-09-20T08:00:00.000Z",
          "wordCount": 4971,
          "title": "What’s New In Gatsby 2022?",
          "enclosure": {
            "url": "http://cloud.netlifyusercontent.com/assets/344dbf88-fdf9-42bb-adb4-46f01eedd629/34359e66-8433-419e-9ea1-ab4c3becac46/new-gatsby-2022.jpg",
            "length": "0",
            "type": "image/jpg"
          },
          "imageUrl": "http://cloud.netlifyusercontent.com/assets/344dbf88-fdf9-42bb-adb4-46f01eedd629/34359e66-8433-419e-9ea1-ab4c3becac46/new-gatsby-2022.jpg"
        },
        {
          "id": "https://smashingmagazine.com/2022/09/building-retro-draggable-web-component-using-lit/",
          "author": "hello@smashingmagazine.com (Andrico Karoulla)",
          "description": "In today’s article, Andrico Karoulla explains how to create a cool draggable effect by listening to the drag events and writing some custom logic inside the handlers.",
          "link": "https://smashingmagazine.com/2022/09/building-retro-draggable-web-component-using-lit/",
          "publishedOn": "2022-09-19T18:00:00.000Z",
          "wordCount": 7013,
          "title": "Building A Retro Draggable Web Component With Lit",
          "enclosure": {
            "url": "http://cloud.netlifyusercontent.com/assets/344dbf88-fdf9-42bb-adb4-46f01eedd629/c1d9b905-3c76-4125-a9b1-91c8db791a06/building-retro-draggable-web-component-using-lit.jpg",
            "length": "0",
            "type": "image/jpg"
          },
          "imageUrl": "http://cloud.netlifyusercontent.com/assets/344dbf88-fdf9-42bb-adb4-46f01eedd629/c1d9b905-3c76-4125-a9b1-91c8db791a06/building-retro-draggable-web-component-using-lit.jpg"
        }
      ]
    },
    {
      "title": "freeCodeCamp.org",
      "feedUrl": "https://www.freecodecamp.org/news/rss/",
      "siteUrl": "https://www.freecodecamp.org/news/",
      "articles": [
        {
          "id": "https://www.freecodecamp.org/news/linux-command-line-tutorial/",
          "author": "Destiny Erhabor",
          "description": "An operating system is a set of software layers between you and your computer's hardware.  The operating system (or OS) is a piece of software that controls all other application programs and helps you manage the hardware and software of your computer. Examples of popular operating systems are Windows,",
          "link": "https://www.freecodecamp.org/news/linux-command-line-tutorial/",
          "publishedOn": "2022-10-18T23:33:44.000Z",
          "wordCount": 3584,
          "title": "Linux Command Line Tutorial – How to Use Common Terminal Commands",
          "imageUrl": "https://www.freecodecamp.org/news/content/images/2022/10/pexels-sora-shimazaki-5935794--3-.jpg"
        },
        {
          "id": "https://www.freecodecamp.org/news/wi-fi-hacking-101/",
          "author": "Daniel Iwugo",
          "description": "Welcome to the world of Wi-Fi hacking, everybody. 💻. In my previous article [/news/linux-basics/], we talked about some basic Linux skills and tricks. In this article you are going to learn a basic Wi-Fi hacking procedure using those skills. You'll learn things such as how to:  1. Monitor Wi-Fi",
          "link": "https://www.freecodecamp.org/news/wi-fi-hacking-101/",
          "publishedOn": "2022-10-18T20:37:37.000Z",
          "wordCount": 3012,
          "title": "Wi-Fi Hacking 101 – How to Hack WPA2 and Defend Against These Attacks",
          "imageUrl": "https://www.freecodecamp.org/news/content/images/2022/10/image-74-1.png"
        },
        {
          "id": "https://www.freecodecamp.org/news/append-a-string-in-python-str-appending/",
          "author": "Ihechikara Vincent Abba",
          "description": "In this article, you'll learn the different methods of appending strings in Python.  Another term commonly used when talking about appending strings is concatenation. So you'll often see these terms — append and concatenate — used interchangeably.  Either way, to append or concatenate strings means to add or",
          "link": "https://www.freecodecamp.org/news/append-a-string-in-python-str-appending/",
          "publishedOn": "2022-10-18T19:33:59.000Z",
          "wordCount": 1417,
          "title": "Append a String in Python – STR Appending",
          "imageUrl": "https://www.freecodecamp.org/news/content/images/2022/10/alex-chumak-zGuBURGGmdY-unsplash.jpg"
        },
        {
          "id": "https://www.freecodecamp.org/news/go-beginners-handbook/",
          "author": "Flavio Copes",
          "description": "Golang is an awesome, simple, modern, and fast programming language. It’s compiled, open source, and strongly typed. Golang – also called Go – was created by Google engineers with these main goals:  * make their projects compile (and run) faster  * be simple so people can pick it",
          "link": "https://www.freecodecamp.org/news/go-beginners-handbook/",
          "publishedOn": "2022-10-18T18:35:37.000Z",
          "wordCount": 5845,
          "title": "The Go Handbook – Learn Golang for Beginners",
          "imageUrl": "https://www.freecodecamp.org/news/content/images/2022/10/pexels-christina-morillo-1181290.jpg"
        },
        {
          "id": "https://www.freecodecamp.org/news/build-a-cross-platform-app-with-next-and-tauri/",
          "author": "Rajdeep Singh",
          "description": "Tauri is a new Rust-based framework that builds an x86_64 cross-platform application for Windows, macOS, and Linux.  In this tutorial, we'll use Tauri and Next.js to build a desktop-based cross-platform application and publish it to the Snap store and AppImage. So why is building a cross-platform app, that works",
          "link": "https://www.freecodecamp.org/news/build-a-cross-platform-app-with-next-and-tauri/",
          "publishedOn": "2022-10-18T16:38:44.000Z",
          "wordCount": 5058,
          "title": "How to Build a Cross-Platform Application with Next.js and Tauri",
          "imageUrl": "https://www.freecodecamp.org/news/content/images/2022/10/Tauri-and-nextjs--1-.png"
        },
        {
          "id": "https://www.freecodecamp.org/news/github-search-tips/",
          "author": "Hillary Nyakundi",
          "description": "When I was a beginner to open-source contributions, one of my greatest challenge was finding the correct projects/issues to work on. For the longest time I relied on resources curated by different writers on the internet (which were good, by the way). But I always wanted to find a way",
          "link": "https://www.freecodecamp.org/news/github-search-tips/",
          "publishedOn": "2022-10-17T19:27:10.000Z",
          "wordCount": 2159,
          "title": "GitHub Search Tips – How to Search Issues, Repos, and More Effectively on GitHub",
          "imageUrl": "https://www.freecodecamp.org/news/content/images/2022/10/Search--2-.png"
        },
        {
          "id": "https://www.freecodecamp.org/news/php-explode-how-to-split-a-string-into-an-array/",
          "author": "Kolade Chris",
          "description": "The PHP explode() function converts a string to an array. Each of the characters in the string is given an index that starts from 0. Like the built-in imlode()  function, the explode function does not modify the data (string). Syntax of the explode() Function The explode() function takes in",
          "link": "https://www.freecodecamp.org/news/php-explode-how-to-split-a-string-into-an-array/",
          "publishedOn": "2022-10-17T17:19:46.000Z",
          "wordCount": 1114,
          "title": "PHP Explode – How to Split a String into an Array",
          "imageUrl": "https://www.freecodecamp.org/news/content/images/2022/10/explode.png"
        },
        {
          "id": "https://www.freecodecamp.org/news/how-to-show-upcoming-meetings-for-a-microsoft-365-user/",
          "author": "Waldek Mastykarz",
          "description": "If you're a web developer and you work with an organization that uses Microsoft 365, you probably use it to manage your meetings. In this tutorial, you'll learn how you can build a simple personal assistant in under 10 minutes that'll show a Microsoft 365 user the meetings they have",
          "link": "https://www.freecodecamp.org/news/how-to-show-upcoming-meetings-for-a-microsoft-365-user/",
          "publishedOn": "2022-10-17T17:08:26.000Z",
          "wordCount": 2674,
          "title": "How to Show Upcoming Meetings for a Microsoft 365 User",
          "imageUrl": "https://www.freecodecamp.org/news/content/images/2022/10/Screenshot-2022-10-17-at-14.47.26.png"
        },
        {
          "id": "https://www.freecodecamp.org/news/how-to-architect-a-blockchain-on-kubernetes-k8s-microservice-tutorial/",
          "author": "Kayode Adeniyi",
          "description": "In this article, I will describe how to use microservices architecture and Kubernetes to build a blockchain.  The technologies usually used for blockchains are purpose-driven, and you can use them for other projects as well. The examples in this article can readily handle heavy loads and remain responsive and",
          "link": "https://www.freecodecamp.org/news/how-to-architect-a-blockchain-on-kubernetes-k8s-microservice-tutorial/",
          "publishedOn": "2022-10-17T16:02:43.000Z",
          "wordCount": 2894,
          "title": "How to Architect a Blockchain on Kubernetes – K8S Microservice Tutorial",
          "imageUrl": "https://www.freecodecamp.org/news/content/images/2022/10/Screenshot-2022-10-01-at-07.39.09.png"
        },
        {
          "id": "https://www.freecodecamp.org/news/how-to-lowercase-a-string-in-javascript-tolowercase-in-js/",
          "author": "Ilenia Magoni",
          "description": "Strings are a fundamental part of working with JavaScript. And the toLowerCase()  method is one of the many integrated methods that you can use to work with strings. In this article, we'll see how to make strings lowercase with the toLowerCase()  method in Python. What is a String?",
          "link": "https://www.freecodecamp.org/news/how-to-lowercase-a-string-in-javascript-tolowercase-in-js/",
          "publishedOn": "2022-10-17T15:51:50.000Z",
          "wordCount": 1358,
          "title": "How to Lowercase a String in JavaScript – toLowerCase() in JS",
          "imageUrl": "https://www.freecodecamp.org/news/content/images/2022/10/pexels-magda-ehlers-1337382.jpg"
        },
        {
          "id": "https://www.freecodecamp.org/news/learn-svelte-complete-course/",
          "author": "Beau Carnes",
          "description": "Svelte is a front-end JavaScript framework for making interactive webpages. Svelte has grown in popularity quite a bit over the last few years. We just published a free 23-hour course on the freeCodeCamp.org YouTube channel that will teach you how to use Svelte. Li Hau Tan developed this course. Li",
          "link": "https://www.freecodecamp.org/news/learn-svelte-complete-course/",
          "publishedOn": "2022-10-17T15:14:47.000Z",
          "wordCount": 955,
          "title": "Learn Svelte in 23 Hours",
          "imageUrl": "https://www.freecodecamp.org/news/content/images/2022/10/svelte-1.png"
        },
        {
          "id": "https://www.freecodecamp.org/news/interpret-black-box-model-using-lime/",
          "author": "Josua Antonius Naiborhu",
          "description": "Machine learning models are black box models. By giving input to these models, we can get output based on the particular model we're using.  The way humans interpret things is different from how machines interpret them. So it's helpful to use tools that can turn the output from certain",
          "link": "https://www.freecodecamp.org/news/interpret-black-box-model-using-lime/",
          "publishedOn": "2022-10-17T15:12:31.000Z",
          "wordCount": 2391,
          "title": "How to Interpret Black Box Models using LIME (Local Interpretable Model-Agnostic Explanations)",
          "imageUrl": "https://www.freecodecamp.org/news/content/images/2022/10/LIME.jpeg"
        },
        {
          "id": "https://www.freecodecamp.org/news/what-is-python-beginners-guide/",
          "author": "Michael Lee",
          "description": "In this article, I am going to explain what Python is and how the Python interpreter works. Then you'll write your first \"Hello World\" program. What is Python? Python is a high-level programming language designed to do many tasks. It's based on the CPython interpreter which translates the Python code",
          "link": "https://www.freecodecamp.org/news/what-is-python-beginners-guide/",
          "publishedOn": "2022-10-17T13:38:18.000Z",
          "wordCount": 1696,
          "title": "What is Python? How the Interpreter Works and How to Write \"Hello World\" in Python",
          "imageUrl": "https://www.freecodecamp.org/news/content/images/2022/10/python-img.jpg"
        },
        {
          "id": "https://www.freecodecamp.org/news/the-five-layers-model-explained/",
          "author": "Omer Rosenbaum",
          "description": "Computer Networks are a beautiful, amazing topic. Networks involve so much knowledge from different fields, from physics to algorithms.  When dealing with Computer Networks, there is one framework that puts everything into place – and that is the layers model.  In this post you'll learn why we need",
          "link": "https://www.freecodecamp.org/news/the-five-layers-model-explained/",
          "publishedOn": "2022-10-17T13:37:19.000Z",
          "wordCount": 3944,
          "title": "What is the Five Layers Model? The Framework of the Internet Explained",
          "imageUrl": "https://www.freecodecamp.org/news/content/images/2022/10/d.png"
        },
        {
          "id": "https://www.freecodecamp.org/news/find-vs-filter-javascript/",
          "author": "Aman Kalra",
          "description": "A common interview question that JavaScript developers often get asked is to explain the difference between the find() and filter() methods.  In this tutorial today, I'll walk you through what these methods are and when you should use them. What is the filter() method? This method returns all the",
          "link": "https://www.freecodecamp.org/news/find-vs-filter-javascript/",
          "publishedOn": "2022-10-14T22:22:22.000Z",
          "wordCount": 1174,
          "title": "find() vs filter() in JavaScript – Differences Explained with Examples",
          "imageUrl": "https://www.freecodecamp.org/news/content/images/2022/10/Logo.jpg"
        },
        {
          "id": "https://www.freecodecamp.org/news/copy-text-to-clipboard-javascript/",
          "author": "Joel Olawanle",
          "description": "When you're building advanced web pages and applications, you'll sometimes want to add the copy feature. This lets your users simply click a button or icon to copy text rather than highlighting the text and clicking a couple of buttons on the keyboard. This feature is mostly used when someone",
          "link": "https://www.freecodecamp.org/news/copy-text-to-clipboard-javascript/",
          "publishedOn": "2022-10-14T21:18:48.000Z",
          "wordCount": 1263,
          "title": "How to Copy Text to the Clipboard with JavaScript",
          "imageUrl": "https://www.freecodecamp.org/news/content/images/2022/10/cover-template--14-.png"
        },
        {
          "id": "https://www.freecodecamp.org/news/javascript-add-to-an-array-js-append/",
          "author": "Ihechikara Vincent Abba",
          "description": "You can use arrays in JavaScript to store a group of variables, often referred to as elements or items of the array. Each of these elements will have an index number assigned to them starting from zero.  By default, you can use the index of an element in an",
          "link": "https://www.freecodecamp.org/news/javascript-add-to-an-array-js-append/",
          "publishedOn": "2022-10-14T18:29:54.000Z",
          "wordCount": 1555,
          "title": "JavaScript Add to an Array – JS Append",
          "imageUrl": "https://www.freecodecamp.org/news/content/images/2022/10/kelly-sikkema--1_RZL8BGBM-unsplash.jpg"
        },
        {
          "id": "https://www.freecodecamp.org/news/ux-vs-ui-whats-the-difference-definition-and-meaning/",
          "author": "Dionysia Lemonaki",
          "description": "When designing a website or an app, the finished product needs to be functional, intuitive, and aesthetically pleasing. This is where UX and UI design come in. UX and UI design are two technical terms that can often be confusing. Many people may use these two terms interchangeably, incorrectly, or",
          "link": "https://www.freecodecamp.org/news/ux-vs-ui-whats-the-difference-definition-and-meaning/",
          "publishedOn": "2022-10-14T16:15:57.000Z",
          "wordCount": 3296,
          "title": "UX vs UI – What's the Difference? Definition and Meaning",
          "imageUrl": "https://www.freecodecamp.org/news/content/images/2022/10/pexels-picjumbocom-196644.jpg"
        },
        {
          "id": "https://www.freecodecamp.org/news/developer-journey/",
          "author": "Jalmari Ikävalko",
          "description": "Hi everyone, I'm Jalmari Ikävalko, a software developer in my early 30s. In this article, I’ll share my whole journey from my first contact with code to becoming the professional developer I am today.  I'll start from my childhood when I first got interested in programming. My Introduction to",
          "link": "https://www.freecodecamp.org/news/developer-journey/",
          "publishedOn": "2022-10-14T16:01:31.000Z",
          "wordCount": 3915,
          "title": "My Developer Journey – How I Learned to Code with Dyslexia and ADHD",
          "imageUrl": "https://www.freecodecamp.org/news/content/images/2022/10/1.jpg"
        },
        {
          "id": "https://www.freecodecamp.org/news/avoid-prop-drilling-with-react-context-api/",
          "author": "Edeh Israel Chidera",
          "description": "The React Context API provides a way to pass data through multiple nested levels of components without having to manually pass that data to each level.  React context is one sure way of globally managing your data in your app, and it's a good way to avoid prop drilling.",
          "link": "https://www.freecodecamp.org/news/avoid-prop-drilling-with-react-context-api/",
          "publishedOn": "2022-10-13T16:52:03.000Z",
          "wordCount": 1243,
          "title": "How to Avoid Prop Drilling with the React Context API",
          "imageUrl": "https://www.freecodecamp.org/news/content/images/2022/10/ferenc-almasi-c8h0n7fSTqs-unsplash.jpg"
        },
        {
          "id": "https://www.freecodecamp.org/news/code-a-project-three-different-ways-javascript-rest-api-database/",
          "author": "Beau Carnes",
          "description": "When you code a similar project using different methods it helps you understand each method more. We just published a course on the freeCodeCamp.org YouTube channel that will teach you how to code a flight widget in JavaScript using multiple methods. First you will learn to create the project using",
          "link": "https://www.freecodecamp.org/news/code-a-project-three-different-ways-javascript-rest-api-database/",
          "publishedOn": "2022-10-13T14:06:09.000Z",
          "wordCount": 852,
          "title": "Code a project three different ways (JavaScript + REST API + Database)",
          "imageUrl": "https://www.freecodecamp.org/news/content/images/2022/10/maxresdefault.jpeg"
        },
        {
          "id": "https://www.freecodecamp.org/news/how-to-build-a-machine-learning-model-in-rust/",
          "author": "Chigozie Oduah",
          "description": "Machine learning is a really interesting concept in computer programming. It involves using data to train a computer program to carry out tasks.  During the process, the program learns from data by discovering patterns. This reduces the need for programmers to hard code rules in some applications. Languages like",
          "link": "https://www.freecodecamp.org/news/how-to-build-a-machine-learning-model-in-rust/",
          "publishedOn": "2022-10-12T22:31:25.000Z",
          "wordCount": 2706,
          "title": "How to Build a Machine Learning Model in Rust",
          "imageUrl": "https://www.freecodecamp.org/news/content/images/2022/10/guerrillabuzz-crypto-pr-IlUq1ruyv0Q-unsplash.jpg"
        },
        {
          "id": "https://www.freecodecamp.org/news/email-alias-set-up-a-professional-email-for-free/",
          "author": "Eamonn Cottrell",
          "description": "I needed to log in to AWS. But my main email address was rejected. Apparently I'd done this in the past and the account had been irreversibly deleted.  No reset option – just a message saying the account was permanently deleted: There are about a million ways to get",
          "link": "https://www.freecodecamp.org/news/email-alias-set-up-a-professional-email-for-free/",
          "publishedOn": "2022-10-12T22:26:51.000Z",
          "wordCount": 1490,
          "title": "Email Alias – How to Set Up a Professional Email for Free",
          "imageUrl": "https://www.freecodecamp.org/news/content/images/2022/10/Email-Alias-with-Gmail.png"
        },
        {
          "id": "https://www.freecodecamp.org/news/data-visualization-tools-guide/",
          "author": "Ihechikara Vincent Abba",
          "description": "Data visualization is the process of interpreting or representing data graphically. Generally, it is the graphical or visual representation of data using charts, tables, histograms, and other info-graphics.  Data plays a major role in any type of organization. Data visualization helps us understand certain trends and insights, and make",
          "link": "https://www.freecodecamp.org/news/data-visualization-tools-guide/",
          "publishedOn": "2022-10-12T17:45:21.000Z",
          "wordCount": 2031,
          "title": "Data Visualization Tools – 2022 Guide",
          "imageUrl": "https://www.freecodecamp.org/news/content/images/2022/10/luke-chesser-JKUTrJ4vK00-unsplash.jpg"
        },
        {
          "id": "https://www.freecodecamp.org/news/learn-docker-and-kubernetes-hands-on-course/",
          "author": "Beau Carnes",
          "description": "Docker and Kubernetes are important technologies that can help you scale your applications. Docker is a platform for packaging, deploying, and running applications in containers. Kubernetes is a system for managing containerized applications across a cluster of nodes. It provides basic mechanisms for deployment, maintenance, and scaling of applications. We",
          "link": "https://www.freecodecamp.org/news/learn-docker-and-kubernetes-hands-on-course/",
          "publishedOn": "2022-10-12T14:22:50.000Z",
          "wordCount": 1119,
          "title": "Learn Docker and Kubernetes – Free Hands-On Course",
          "imageUrl": "https://www.freecodecamp.org/news/content/images/2022/10/docker.png"
        },
        {
          "id": "https://www.freecodecamp.org/news/how-to-implement-whitelist-in-smartcontracts-erc-721-nft-erc-1155-and-others/",
          "author": "Igor Gaponov",
          "description": "In this article I will show you three ways you can create a whitelist in a smart contract. Here's what we'll discuss:  * On-chain whitelists  * Digital signatures  * Merkle trees All methods are available in the repo here [https://github.com/gapon2401/smartcontract-whitelist]. A whitelist is useful if you want",
          "link": "https://www.freecodecamp.org/news/how-to-implement-whitelist-in-smartcontracts-erc-721-nft-erc-1155-and-others/",
          "publishedOn": "2022-10-12T14:12:02.000Z",
          "wordCount": 2642,
          "title": "How to Implement a Whitelist in Smart Contracts (ERC-721 NFT, ERC-1155, and others)",
          "imageUrl": "https://www.freecodecamp.org/news/content/images/2022/10/whitelist-1.jpg"
        },
        {
          "id": "https://www.freecodecamp.org/news/how-web-storage-works/",
          "author": "Tooba Jamal",
          "description": "Anyone who works with the web needs to store data for a later use. Backend developers have some powerful databases in their toolkit. But if you are a frontend developer, you can still store and process data using web storage. In this article, you'll learn what is a web storage,",
          "link": "https://www.freecodecamp.org/news/how-web-storage-works/",
          "publishedOn": "2022-10-12T14:08:46.000Z",
          "wordCount": 1568,
          "title": "How Web Storage Works – Local vs Session Storage Explained",
          "imageUrl": "https://www.freecodecamp.org/news/content/images/2022/10/webstorage-1-1.png"
        },
        {
          "id": "https://www.freecodecamp.org/news/dbms-and-sql-basics/",
          "author": "Bikash Daga (Jain)",
          "description": "Database Management Systems and SQL are two of the most important and widely used tools on the internet today.  You use a Database Management System (DBMS) to store the data you collect from various sources, and SQL to manipulate and access the particular data you want in an efficient",
          "link": "https://www.freecodecamp.org/news/dbms-and-sql-basics/",
          "publishedOn": "2022-10-12T13:57:35.000Z",
          "wordCount": 3446,
          "title": "Database Management Systems and SQL – Tutorial for Beginners",
          "imageUrl": "https://www.freecodecamp.org/news/content/images/2022/09/FreeCodeCamp.png"
        },
        {
          "id": "https://www.freecodecamp.org/news/branding-for-developer-freelancers/",
          "author": "Juan Cruz Martinez",
          "description": "You probably didn’t get into freelance development to become a marketer.  You got into freelancing so you could work when you want, make more money, and control your life. But, if you haven’t realized it yet, building a career as a freelancer requires you to embrace more than just",
          "link": "https://www.freecodecamp.org/news/branding-for-developer-freelancers/",
          "publishedOn": "2022-10-12T13:52:08.000Z",
          "wordCount": 2977,
          "title": "How to Build Your Personal Brand as a Freelance Developer",
          "imageUrl": "https://www.freecodecamp.org/news/content/images/2022/10/Standard-Blog-Post.png"
        },
        {
          "id": "https://www.freecodecamp.org/news/build-a-webshop-with-angular-node-js-typescript-stripe/",
          "author": "Beau Carnes",
          "description": "Learn how to build a webshop from scratch! We just published a course on the freeCodeCamp.org YouTube channel that will teach you how to build a webshop or e-commerce store using Angular/TypeScript, Express.js, and Stripe.  You will learn how to use Angular material and Tailwind to structure the UI",
          "link": "https://www.freecodecamp.org/news/build-a-webshop-with-angular-node-js-typescript-stripe/",
          "publishedOn": "2022-10-12T13:46:34.000Z",
          "wordCount": 809,
          "title": "Build a Webshop with Angular, Node.js, TypeScript, & Stripe",
          "imageUrl": "https://www.freecodecamp.org/news/content/images/2022/10/webshop.png"
        },
        {
          "id": "https://www.freecodecamp.org/news/how-to-recognize-phishing-email/",
          "author": "Jose Vicente Nunez",
          "description": "You know the drill: you open your email client and there is it an email saying that you will be in trouble if you do not follow certain instructions in short time, no questions asked. All it takes is a single click, and you're in trouble. This kind of email",
          "link": "https://www.freecodecamp.org/news/how-to-recognize-phishing-email/",
          "publishedOn": "2022-10-12T00:52:32.000Z",
          "wordCount": 1630,
          "title": "How to Recognize a Phishing Email – And What to Do When You Get One",
          "imageUrl": "https://www.freecodecamp.org/news/content/images/2022/10/five_hours_until_the_bombing_run-1.JPG"
        },
        {
          "id": "https://www.freecodecamp.org/news/fix-typeerror-cannot-read-property-push-of-undefined-in-javascript/",
          "author": "Joel Olawanle",
          "description": "When working with JavaScript arrays, you have to be careful that you are not calling the push(), pop(), shift(), unShift(), or splice() methods on a variable that is meant to be an array but has a value of undefined. If you mistakenly do this, you'll get this error: If you",
          "link": "https://www.freecodecamp.org/news/fix-typeerror-cannot-read-property-push-of-undefined-in-javascript/",
          "publishedOn": "2022-10-11T23:18:26.000Z",
          "wordCount": 1487,
          "title": "How to Fix TypeError: Cannot read Property 'push' of Undefined in JavaScript",
          "imageUrl": "https://www.freecodecamp.org/news/content/images/2022/10/cover-template--13-.png"
        },
        {
          "id": "https://www.freecodecamp.org/news/best-resources-to-learn-golang-for-free/",
          "author": "Avdhoot Fulsundar",
          "description": "Golang has been around for a while now, and it's become quite popular among developers. It is a simple yet compelling programming language that's well-loved because of its powerful features like concurrency and the fact that it is developed by Google. Golang is a server-side language that's used in many",
          "link": "https://www.freecodecamp.org/news/best-resources-to-learn-golang-for-free/",
          "publishedOn": "2022-10-11T23:11:17.000Z",
          "wordCount": 1317,
          "title": "Best Free Resources to Learn Golang – Go Coding Courses",
          "imageUrl": "https://www.freecodecamp.org/news/content/images/2022/10/Gradient-Modern-Digital-Marketing-Facebook-Cover--36-.png"
        },
        {
          "id": "https://www.freecodecamp.org/news/python-programming-tips/",
          "author": "David Fagbuyiro",
          "description": "Python is one of the most popular programming languages out there today. Its simplicity and readability make it a favorite among many programmers. So in this tutorial, I'm sharing a few pointers and strategies to help you improve your Python programming skills. How to Reverse a String in Python In",
          "link": "https://www.freecodecamp.org/news/python-programming-tips/",
          "publishedOn": "2022-10-11T19:47:25.000Z",
          "wordCount": 1539,
          "title": "Python Programming Tips to Help You Level Up Your Code",
          "imageUrl": "https://www.freecodecamp.org/news/content/images/2022/10/pexels-ankush-rathi-925067.jpg"
        },
        {
          "id": "https://www.freecodecamp.org/news/typescript-generics-use-case-example/",
          "author": "Aman Kalra",
          "description": "In this tutorial, you'll learn the basics of generics in TypeScript. We'll discuss how to use them and when they're useful in your code. Use Case for Generics Let's start with a simple example, where you want to print the value of an argument passed: function printData(data: number) {",
          "link": "https://www.freecodecamp.org/news/typescript-generics-use-case-example/",
          "publishedOn": "2022-10-07T20:49:10.000Z",
          "wordCount": 1189,
          "title": "TypeScript Generics – Use Case and Examples",
          "imageUrl": "https://www.freecodecamp.org/news/content/images/2022/10/pexels-hitarth-jadhav-220357.jpg"
        },
        {
          "id": "https://www.freecodecamp.org/news/how-to-check-if-a-string-contains-a-substring-javascript/",
          "author": "Dionysia Lemonaki",
          "description": "When you're working with a JavaScript program, you might need to check whether a string contains a substring. A substring is a string inside another string. Specifically, you might need to check whether a word contains a specific character or a specific set of characters. Thankfully, there are a few",
          "link": "https://www.freecodecamp.org/news/how-to-check-if-a-string-contains-a-substring-javascript/",
          "publishedOn": "2022-10-07T18:00:38.000Z",
          "wordCount": 2230,
          "title": "How to Check if a String Contains a Substring in JavaScript",
          "imageUrl": "https://www.freecodecamp.org/news/content/images/2022/10/pexels-tranmautritam-251225.jpg"
        },
        {
          "id": "https://www.freecodecamp.org/news/recursion-in-javascript-simplified/",
          "author": "Dillion Megida",
          "description": "Recursion works similarly to how loops do in JavaScript. Loops allow you to execute a set of code multiple times as long as a condition is true. In this article, I will explain what Recursion is and how it works in JavaScript. In loops, when the condition becomes false, the",
          "link": "https://www.freecodecamp.org/news/recursion-in-javascript-simplified/",
          "publishedOn": "2022-10-07T17:51:43.000Z",
          "wordCount": 2285,
          "title": "How Does Recursion Work? Simplified in JavaScript with Examples",
          "imageUrl": "https://www.freecodecamp.org/news/content/images/2022/10/recursion-js.png"
        },
        {
          "id": "https://www.freecodecamp.org/news/freecodecamp-python-courses-ranked-from-best-to-worst/",
          "author": "Beau Carnes",
          "description": "Does freeCodeCamp really need yet another Python course?   Click for answer.  Between the curriculum and the YouTube channel, freeCodeCamp has quite a few Python programming courses. But which Python course should you take? In this article, I'll rank every singe freeCodeCamp beginner's Python course from best to",
          "link": "https://www.freecodecamp.org/news/freecodecamp-python-courses-ranked-from-best-to-worst/",
          "publishedOn": "2022-10-06T19:54:42.000Z",
          "wordCount": 1425,
          "title": "Python For Beginners Courses Ranked from Best to Worst – freeCodeCamp Edition",
          "imageUrl": "https://www.freecodecamp.org/news/content/images/2022/10/pythoninstructors-1.png"
        },
        {
          "id": "https://www.freecodecamp.org/news/stack-data-structure-solve-coding-challenges/",
          "author": "Beau Carnes",
          "description": "The stack data structure is used frequently in programming, sometimes behind-the-scenes. And questions involving the stack data structure are very common in coding interviews. We just published a course on the freeCodeCamp.org YouTube channel that will teach you how to use the stack data structure to solve the type of",
          "link": "https://www.freecodecamp.org/news/stack-data-structure-solve-coding-challenges/",
          "publishedOn": "2022-10-06T18:48:30.000Z",
          "wordCount": 948,
          "title": "How to Use the Stack Data Structure to Solve Coding Challenges",
          "imageUrl": "https://www.freecodecamp.org/news/content/images/2022/10/stack.png"
        },
        {
          "id": "https://www.freecodecamp.org/news/php-implode-convert-array-to-string-with-join/",
          "author": "Kolade Chris",
          "description": "In PHP, the implode() function is a built-in function that takes an array and converts it to a string. implode() doesn’t modify the original array. It doesn’t matter whether the array is an indexed or associative array. Once you pass in the array to implode(), it joins all the values",
          "link": "https://www.freecodecamp.org/news/php-implode-convert-array-to-string-with-join/",
          "publishedOn": "2022-10-06T16:14:10.000Z",
          "wordCount": 1366,
          "title": "PHP Implode – Convert Array to String with Join",
          "imageUrl": "https://www.freecodecamp.org/news/content/images/2022/10/implode.png"
        },
        {
          "id": "https://www.freecodecamp.org/news/learn-pytorch-for-deep-learning-in-day/",
          "author": "Daniel Bourke",
          "description": "My comprehensive PyTorch course is now live on the freeCodeCamp.org YouTube channel.   * You can view the full 26 hour course here [https://youtu.be/V_xro1bcAuA].  * Read the course materials online for free at learnpytorch.io    [https://learnpytorch.io/].  * See all of the course materials on GitHub",
          "link": "https://www.freecodecamp.org/news/learn-pytorch-for-deep-learning-in-day/",
          "publishedOn": "2022-10-06T14:48:39.000Z",
          "wordCount": 1730,
          "title": "Learn PyTorch for Deep Learning – Free 26-Hour Course",
          "imageUrl": "https://www.freecodecamp.org/news/content/images/2022/10/pytorch24.png"
        },
        {
          "id": "https://www.freecodecamp.org/news/react-helmet-examples/",
          "author": "Scott Gary",
          "description": "Because of the nature of single page applications (SPAs), modifying metadata in React apps can be tricky without using a helper library. Lucky for us, that library already exists – and it's called React Helmet. Leveraging Helmet for metadata inclusion can significantly simplify the process of making a React app SEO",
          "link": "https://www.freecodecamp.org/news/react-helmet-examples/",
          "publishedOn": "2022-10-05T16:36:10.000Z",
          "wordCount": 1799,
          "title": "How to Use React Helmet – With Example Use Case",
          "imageUrl": "https://www.freecodecamp.org/news/content/images/2022/10/react-head-examples.jpg"
        },
        {
          "id": "https://www.freecodecamp.org/news/vlookup-in-excel-formula-and-example-function/",
          "author": "Kolade Chris",
          "description": "In Excel, VLOOKUP() means vertical lookup. It is a powerful built-in function you can use to quickly search for a value in a spreadsheet. VLOOKUP() searches for a value in a vertical manner across the sheet – unlike the HLOOKUP() function which does it horizontally. Before using VLOOKUP(), make sure",
          "link": "https://www.freecodecamp.org/news/vlookup-in-excel-formula-and-example-function/",
          "publishedOn": "2022-10-05T16:26:42.000Z",
          "wordCount": 1424,
          "title": "VLOOKUP in Excel – Formula and Example Function",
          "imageUrl": "https://www.freecodecamp.org/news/content/images/2022/10/vlookup.png"
        },
        {
          "id": "https://www.freecodecamp.org/news/javascript-function-iife-parameters-code-blocks-explained/",
          "author": "Oluwatobi Sofela",
          "description": "Functions are one of the most widely-used features in programming. So, it helps to have a solid understanding of how they work. This tutorial discusses everything you need to know to use JavaScript functions like a pro. Table of Contents  1.  What Is a Function?  2.",
          "link": "https://www.freecodecamp.org/news/javascript-function-iife-parameters-code-blocks-explained/",
          "publishedOn": "2022-10-05T16:06:29.000Z",
          "wordCount": 3208,
          "title": "JavaScript Functions Tutorial – IIFE, Function Parameters, and Code Blocks Explained",
          "imageUrl": "https://www.freecodecamp.org/news/content/images/2022/10/programming-image-by-mohamed-hassan-from-pixabay-javascript-function-iffe-parameters-blocks-explained-codesweetly.png"
        },
        {
          "id": "https://www.freecodecamp.org/news/big-o-cheat-sheet-time-complexity-chart/",
          "author": "Joel Olawanle",
          "description": "An algorithm is a set of well-defined instructions for solving a specific problem. You can solve these problems in various ways. This means that the method you use to arrive at the same solution may differ from mine, but we should both get the same result. Because there are various",
          "link": "https://www.freecodecamp.org/news/big-o-cheat-sheet-time-complexity-chart/",
          "publishedOn": "2022-10-05T15:00:53.000Z",
          "wordCount": 2737,
          "title": "Big O Cheat Sheet – Time Complexity Chart",
          "imageUrl": "https://www.freecodecamp.org/news/content/images/2022/10/cover-template--12-.png"
        },
        {
          "id": "https://www.freecodecamp.org/news/how-to-validate-machine-learning-models-with-tensorflow-model-analysis/",
          "author": "Salim Oyinlola",
          "description": "My first deployed Machine Learning model was a failure. It was a simple Diabetes Diagnosis Model for potential diabetes mellitus patients – and quite frankly, I was beyond excited on deployment.  But the excitement soon disappeared when I received feedback from users. Simply put, the users felt the model",
          "link": "https://www.freecodecamp.org/news/how-to-validate-machine-learning-models-with-tensorflow-model-analysis/",
          "publishedOn": "2022-10-05T14:37:09.000Z",
          "wordCount": 2604,
          "title": "How to Validate your Machine Learning Models Using TensorFlow Model Analysis",
          "imageUrl": "https://www.freecodecamp.org/news/content/images/2022/10/pexels-pixabay-159275.jpg"
        },
        {
          "id": "https://www.freecodecamp.org/news/laravel-web-security-csrf/",
          "author": "Sule-Balogun Olanrewaju Ganiu",
          "description": "In this tutorial, you'll learn about Laravel web security and how to secure your web applications and protect them from Cross-Site Request Forgery, or CSRF attacks. CSRF is a malicious activity that involves an attacker performing actions on behalf of an authenticated user. Fortunately, Laravel provides out-of-the-box measures to prevent",
          "link": "https://www.freecodecamp.org/news/laravel-web-security-csrf/",
          "publishedOn": "2022-10-04T21:40:49.000Z",
          "wordCount": 1405,
          "title": "What is Cross-Site Request Forgery (CSRF)? Laravel Web Security Tutorial",
          "imageUrl": "https://www.freecodecamp.org/news/content/images/2022/10/Dark-Neon-Simple-Futuristic-UIUX-Designer-LinkedIn-Banner--7---1-.png"
        },
        {
          "id": "https://www.freecodecamp.org/news/how-does-print-work-in-java/",
          "author": "Md. Fahim Bin Amin",
          "description": "Often, you'll need to print something to the console output when you're coding in Java. And the first thing that likely comes to your mind is the print function or print statement. But very few people know about the three different print functions/statements in Java. In this article, I am",
          "link": "https://www.freecodecamp.org/news/how-does-print-work-in-java/",
          "publishedOn": "2022-10-04T21:16:25.000Z",
          "wordCount": 1679,
          "title": "How to Use the Print Function in Java",
          "imageUrl": "https://www.freecodecamp.org/news/content/images/2022/09/Print-Statement.png"
        },
        {
          "id": "https://www.freecodecamp.org/news/how-to-build-a-full-stack-application-from-start-to-finish/",
          "author": "Lane Wagner",
          "description": "Software architecture is a massive topic. That said, I think I can give you a simple method you can use to approach the architecture of a full-stack application.  In particular, I want to talk about the order in which you should think about and build out the pieces of",
          "link": "https://www.freecodecamp.org/news/how-to-build-a-full-stack-application-from-start-to-finish/",
          "publishedOn": "2022-10-04T17:49:10.000Z",
          "wordCount": 1580,
          "title": "How to Architect a Full-Stack Application from Start to Finish",
          "imageUrl": "https://www.freecodecamp.org/news/content/images/2022/10/jeremy-thomas-FO7bKvgETgQ-unsplash.jpg"
        },
        {
          "id": "https://www.freecodecamp.org/news/build-microsoft-365-application-in-10-minutes/",
          "author": "Waldek Mastykarz",
          "description": "If you're a web developer and work with an organization that uses Microsoft 365, or you build applications that you sell to customers, I've got great news for you: you can use your existing skills to build applications that integrate with Microsoft 365. What's Microsoft 365? Microsoft 365 [https://www.microsoft.com/microsoft-365] is",
          "link": "https://www.freecodecamp.org/news/build-microsoft-365-application-in-10-minutes/",
          "publishedOn": "2022-10-04T17:32:26.000Z",
          "wordCount": 2360,
          "title": "How to Build Your First Microsoft 365 Application in 10 minutes",
          "imageUrl": "https://www.freecodecamp.org/news/content/images/2022/09/banner.png"
        },
        {
          "id": "https://www.freecodecamp.org/news/sql-subquery-how-to-sub-query-in-select-statement/",
          "author": "Kolade Chris",
          "description": "A SQL subquery is a query inside a query. So, in SQL, a subquery is also called a nested query or an inner query. The outer query in which the inner query is inserted is the main query. SQL admins usually use subqueries inside the WHERE clause to narrow down",
          "link": "https://www.freecodecamp.org/news/sql-subquery-how-to-sub-query-in-select-statement/",
          "publishedOn": "2022-10-04T17:08:48.000Z",
          "wordCount": 1216,
          "title": "SQL Subquery – How to Sub Query in SELECT Statement",
          "imageUrl": "https://www.freecodecamp.org/news/content/images/2022/10/subqueries.png"
        },
        {
          "id": "https://www.freecodecamp.org/news/docker-vs-vm-key-differences-you-should-know/",
          "author": "Bala Priya C",
          "description": "In this guide, you'll learn the differences between a virtual machine and a  Docker container. Both virtual machines and containers help replicate the development environment, and manage dependencies and configurations better. But there are certain differences you should be aware of that will help you choose a VM or",
          "link": "https://www.freecodecamp.org/news/docker-vs-vm-key-differences-you-should-know/",
          "publishedOn": "2022-10-04T16:48:57.000Z",
          "wordCount": 1610,
          "title": "Docker vs Virtual Machine (VM) – Key Differences You Should Know",
          "imageUrl": "https://www.freecodecamp.org/news/content/images/2022/07/docker-vs-vm-diff.png"
        },
        {
          "id": "https://www.freecodecamp.org/news/learn-python-by-thinking-in-types/",
          "author": "Beau Carnes",
          "description": "Did you check Instagram today or watch YouTube? Well, you used a Python-based application! Python is one of the most popular programming languages. We just published a new Python course on the freeCodeCamp.org YouTube channel. We have quite a few Python courses on the freeCodeCamp.org YouTube channel so you may",
          "link": "https://www.freecodecamp.org/news/learn-python-by-thinking-in-types/",
          "publishedOn": "2022-10-04T15:45:05.000Z",
          "wordCount": 998,
          "title": "Learn Python by Thinking in Types",
          "imageUrl": "https://www.freecodecamp.org/news/content/images/2022/10/pythontypes.png"
        },
        {
          "id": "https://www.freecodecamp.org/news/how-to-build-a-modal-with-javascript/",
          "author": "Victor Eke",
          "description": "It's probably happened to you before: you unintentionally attempted to perform an action on a webpage, but luckily got a pop-up window asking you to confirm your decision. This pop-up window is called a modal. It's a web page element that pops up and displays in front of other page",
          "link": "https://www.freecodecamp.org/news/how-to-build-a-modal-with-javascript/",
          "publishedOn": "2022-10-03T23:49:06.000Z",
          "wordCount": 2342,
          "title": "How to Build a Modal with JavaScript",
          "imageUrl": "https://www.freecodecamp.org/news/content/images/2022/10/How-to-build-a-modal-with-JavaScript.png"
        },
        {
          "id": "https://www.freecodecamp.org/news/what-is-rem-in-css-rem-unit-font-size-padding-height-and-more/",
          "author": "Dillion Megida",
          "description": "The rem measurement unit is a relative unit that you can use for length values in CSS. I will explain what this unit is, and how it is different from other units in this article. In my previous article, I explained the two categories of units in CSS: Absolute and",
          "link": "https://www.freecodecamp.org/news/what-is-rem-in-css-rem-unit-font-size-padding-height-and-more/",
          "publishedOn": "2022-10-03T22:57:54.000Z",
          "wordCount": 1388,
          "title": "What is rem in CSS? rem Unit Font Size, Padding, Height, and More",
          "imageUrl": "https://www.freecodecamp.org/news/content/images/2022/10/rem-units.png"
        },
        {
          "id": "https://www.freecodecamp.org/news/machine-learning-web-app-with-flask/",
          "author": "Tooba Jamal",
          "description": "Being able to build predictive models is a superpower – but you can't make much of these models if users can't use them.  In this article, we will go through the process of building and deploying a machine learning web app using Flask and PythonAnywhere.  Flask is a",
          "link": "https://www.freecodecamp.org/news/machine-learning-web-app-with-flask/",
          "publishedOn": "2022-10-03T22:52:51.000Z",
          "wordCount": 2376,
          "title": "How to Turn Your Jupyter Notebook into a User-Friendly Web App",
          "imageUrl": "https://www.freecodecamp.org/news/content/images/2022/10/Purple-Illustrated-Technology-Blog-Banner-1.png"
        },
        {
          "id": "https://www.freecodecamp.org/news/map-filter-reduce-in-javascript/",
          "author": "Bhavesh Rawat",
          "description": "If you want to learn React, it's important to get a fair understanding of some core JavaScript concepts first.  So if that's what you're doing, first of all – great job! You have made a wise decision by not starting directly with React.  Second, React builds on key",
          "link": "https://www.freecodecamp.org/news/map-filter-reduce-in-javascript/",
          "publishedOn": "2022-10-03T22:06:51.000Z",
          "wordCount": 1763,
          "title": "How to Use map(), filter(), and reduce() in JavaScript",
          "imageUrl": "https://www.freecodecamp.org/news/content/images/2022/10/fCC-blog-2.png"
        },
        {
          "id": "https://www.freecodecamp.org/news/how-to-deploy-a-routed-react-app-to-netlify/",
          "author": "Edeh Israel Chidera",
          "description": "Have you ever experienced a “PAGE NOT FOUND” error when trying to access or refresh an application that uses React Router? Don't worry, you're not alone. In this article, you will learn how to deploy a React application that uses react-router without any problems. The Problem with Deploying react-router Apps",
          "link": "https://www.freecodecamp.org/news/how-to-deploy-a-routed-react-app-to-netlify/",
          "publishedOn": "2022-10-03T17:16:24.000Z",
          "wordCount": 1431,
          "title": "How to Deploy a React Router App to Netlify and Fix the \"Page Not Found\" Error",
          "imageUrl": "https://www.freecodecamp.org/news/content/images/2022/09/netlify1-1-1.png"
        },
        {
          "id": "https://www.freecodecamp.org/news/how-to-fix-typeerror-only-size-1-arrays-can-be-converted-to-python-scalars/",
          "author": "Ihechikara Vincent Abba",
          "description": "In Python, you can use the numpy library when working with arrays and certain math concepts like matrices and linear algebra.  But like every other aspect of learning and working with a programming language, errors are unavoidable.  In this article, you'll learn how to fix the \"TypeError: only",
          "link": "https://www.freecodecamp.org/news/how-to-fix-typeerror-only-size-1-arrays-can-be-converted-to-python-scalars/",
          "publishedOn": "2022-09-30T21:39:43.000Z",
          "wordCount": 1205,
          "title": "TypeError: only size-1 arrays can be converted to Python scalars",
          "imageUrl": "https://www.freecodecamp.org/news/content/images/2022/09/brett-jordan-XWar9MbNGUY-unsplash.jpg"
        },
        {
          "id": "https://www.freecodecamp.org/news/absolute-and-relative-css-units/",
          "author": "Dillion Megida",
          "description": "In CSS, we categorize measurement units as either absolute or relative units. In this article, I'll explain what these categories are with examples of units that fall under each of them. CSS Measurement Units You can use different measurement units in CSS. You use these units with length or size",
          "link": "https://www.freecodecamp.org/news/absolute-and-relative-css-units/",
          "publishedOn": "2022-09-30T21:19:17.000Z",
          "wordCount": 1746,
          "title": "What are Absolute and Relative Units in CSS? Explained with Examples",
          "imageUrl": "https://www.freecodecamp.org/news/content/images/2022/09/absolute-relative-units-1.png"
        },
        {
          "id": "https://www.freecodecamp.org/news/rename-file-linux-bash-command/",
          "author": "Zaira Hira",
          "description": "Renaming files is a very common operation whether you are using the command line or the GUI.  Compared to the GUI (or Graphical User Interface), the CLI is especially powerful. This is in part because you can rename files in bulk or even schedule the scripts to rename files",
          "link": "https://www.freecodecamp.org/news/rename-file-linux-bash-command/",
          "publishedOn": "2022-09-30T15:06:08.000Z",
          "wordCount": 1122,
          "title": "Rename a File in Linux – Bash Terminal Command",
          "imageUrl": "https://www.freecodecamp.org/news/content/images/2022/09/Copy-of-read-write-files-python--3-.png"
        },
        {
          "id": "https://www.freecodecamp.org/news/how-to-fix-dns-server-not-responding-error-windows-10/",
          "author": "Gavin Lon",
          "description": "I think it's safe to say that the vast majority of professionals depend on the internet these days.  So being denied access to the internet when you are trying to mine nuggets of valuable information from your go-to web sites can be quite an ordeal. Especially when you are",
          "link": "https://www.freecodecamp.org/news/how-to-fix-dns-server-not-responding-error-windows-10/",
          "publishedOn": "2022-09-30T15:00:47.000Z",
          "wordCount": 3367,
          "title": "DNS Server Not Responding – How to Fix the Error in Windows 10",
          "imageUrl": "https://www.freecodecamp.org/news/content/images/2022/09/DNS-Issue-Main-Pic---pexels-yan-krukov-4458420.jpg"
        },
        {
          "id": "https://www.freecodecamp.org/news/what-is-dom-in-javascript/",
          "author": "Kedar Makode",
          "description": "Understanding how the DOM and events work in JavaScript is key if you want to be an effective front end developer. In this article, you'll learn what the DOM is and how it works. What is the DOM? DOM stands for Document Object Model. It's the interface between JavaScript and",
          "link": "https://www.freecodecamp.org/news/what-is-dom-in-javascript/",
          "publishedOn": "2022-09-30T14:50:00.000Z",
          "wordCount": 2869,
          "title": "What is the DOM? A Behind-the-Scenes Guide",
          "imageUrl": "https://www.freecodecamp.org/news/content/images/2022/09/What-is-DOM-and-Events--in-JavaScipt--2-.png"
        },
        {
          "id": "https://www.freecodecamp.org/news/swap-two-array-elements-in-javascript/",
          "author": "Joel Olawanle",
          "description": "When you're working with arrays, there are times when you need to swap two elements in an array in JavaScript. Maybe you're working on an algorithm question such as the bubble sort algorithm where you need to compare two values and then swap them if your condition is true. Aside",
          "link": "https://www.freecodecamp.org/news/swap-two-array-elements-in-javascript/",
          "publishedOn": "2022-09-29T20:15:18.000Z",
          "wordCount": 1395,
          "title": "How to Swap Two Array Elements in JavaScript – Switch Elements in JS",
          "imageUrl": "https://www.freecodecamp.org/news/content/images/2022/09/cover-template--11-.png"
        },
        {
          "id": "https://www.freecodecamp.org/news/whats-the-difference-between-authentication-and-authorisation/",
          "author": "Grant Weatherston",
          "description": "When you're starting out in web development, you'll likely hear the terms authentication and authorization all the time. And it doesn't help that they're both usually abbreviated 'auth', so it's very easy to get the two confused. In this article, you will learn:  * The differences between authentication and",
          "link": "https://www.freecodecamp.org/news/whats-the-difference-between-authentication-and-authorisation/",
          "publishedOn": "2022-09-29T17:45:49.000Z",
          "wordCount": 2191,
          "title": "Authentication vs Authorization – What's the Difference?",
          "imageUrl": "https://www.freecodecamp.org/news/content/images/2022/09/Background1.jpg"
        },
        {
          "id": "https://www.freecodecamp.org/news/bubble-sort-algorithm-in-java-cpp-python-with-example-code/",
          "author": "Kolade Chris",
          "description": "Bubble sort is a type of sorting algorithm you can use to arrange a set of values in ascending order. If you want, you can also implement bubble sort to sort the values in descending order. A real-world example of a bubble sort algorithm is how the contact list on",
          "link": "https://www.freecodecamp.org/news/bubble-sort-algorithm-in-java-cpp-python-with-example-code/",
          "publishedOn": "2022-09-29T17:34:36.000Z",
          "wordCount": 2291,
          "title": "Bubble Sort – Algorithm in Java, C++, Python with Example Code",
          "imageUrl": "https://www.freecodecamp.org/news/content/images/2022/09/bubbleSortCover.png"
        },
        {
          "id": "https://www.freecodecamp.org/news/css-selectors-cheat-sheet-for-beginners/",
          "author": "Dionysia Lemonaki",
          "description": "CSS selectors target and select the HTML elements you want to style. Specifically, CSS selectors allow you to select multiple elements at once. They are helpful when you want to apply the same styles to more than one HTML element, because you will not repeat yourself by writing the same",
          "link": "https://www.freecodecamp.org/news/css-selectors-cheat-sheet-for-beginners/",
          "publishedOn": "2022-09-29T15:22:20.000Z",
          "wordCount": 4118,
          "title": "CSS Selectors – Cheat Sheet for Class, Name, Child Selector List",
          "imageUrl": "https://www.freecodecamp.org/news/content/images/2022/09/laura-adai-s6U7Gq93UU8-unsplash.jpg"
        },
        {
          "id": "https://www.freecodecamp.org/news/create-a-low-code-ecommerce-app-with-stripe-postgres-rest-api-backend/",
          "author": "Beau Carnes",
          "description": "Building apps can be much quicker with low-code tools. A low-code platform can give you pre-built UI components packed with functionality like tables, buttons, and text inputs. This allows you to skip the frontend templates and build your own quickly. We just published a tutorial on the freeCodeCamp.org YouTube channel",
          "link": "https://www.freecodecamp.org/news/create-a-low-code-ecommerce-app-with-stripe-postgres-rest-api-backend/",
          "publishedOn": "2022-09-29T13:43:07.000Z",
          "wordCount": 921,
          "title": "Create a Low-Code Ecommerce App with Stripe, Postgres, & REST API Backend",
          "imageUrl": "https://www.freecodecamp.org/news/content/images/2022/09/low-code-ecommerce.png"
        },
        {
          "id": "https://www.freecodecamp.org/news/what-is-the-difference-between-parameters-and-arguments-in-javascript/",
          "author": "Segun Ajibola",
          "description": "JavaScript is one of the most popular programming languages out there for web development. The dynamic values passed in a JavaScript function can change when the function gets called in another location in the code. The keywords we use to name these data are parameters and arguments, but some developers",
          "link": "https://www.freecodecamp.org/news/what-is-the-difference-between-parameters-and-arguments-in-javascript/",
          "publishedOn": "2022-09-28T21:18:15.000Z",
          "wordCount": 1315,
          "title": "Parameters vs Arguments in JavaScript – What's the Difference?",
          "imageUrl": "https://www.freecodecamp.org/news/content/images/2022/09/Parameters-vs-Arguments.png"
        },
        {
          "id": "https://www.freecodecamp.org/news/how-to-code-a-2d-game-using-javascript-html-and-css/",
          "author": "Beau Carnes",
          "description": "JavaScript can be a surprisingly good programming language to use for creating 2D games. Especially games you want to be playable on almost any device.  We just published a course on the freeCodeCamp.org YouTube channel that will teach you how to code a 2D game using JavaScript, HTML, CSS,",
          "link": "https://www.freecodecamp.org/news/how-to-code-a-2d-game-using-javascript-html-and-css/",
          "publishedOn": "2022-09-28T19:29:45.000Z",
          "wordCount": 871,
          "title": "How to Code a 2D Game Using JavaScript, HTML, and CSS",
          "imageUrl": "https://www.freecodecamp.org/news/content/images/2022/09/2dgamejs.png"
        },
        {
          "id": "https://www.freecodecamp.org/news/how-to-test-in-express-and-mongoose-apps/",
          "author": "Rakesh Potnuru",
          "description": "Testing is a vital part of software development. The sooner you start testing, the better.  In this article, I'll show you how to write tests for your NodeJs/ExpressJS and MongoDB/Mongoose applications with Jest and Supertest. Let's get started First let's set up a demo Express.js app. Let's say we",
          "link": "https://www.freecodecamp.org/news/how-to-test-in-express-and-mongoose-apps/",
          "publishedOn": "2022-09-27T23:26:16.000Z",
          "wordCount": 1666,
          "title": "How to Test Your Express.js and Mongoose Apps with Jest and SuperTest",
          "imageUrl": "https://www.freecodecamp.org/news/content/images/2022/09/how-to-write-tests.png"
        },
        {
          "id": "https://www.freecodecamp.org/news/node-js-server-side-javascript-what-is-node-used-for/",
          "author": "Ihechikara Vincent Abba",
          "description": "The release of Node.js in 2009 by Ryan Dahl increased the scope of what developers could do with JavaScript. Prior to that, you could only use JavaScript on the client side (the browser) or frontend of web applications. With Node.js, developers can create server side applications, command line tools, and",
          "link": "https://www.freecodecamp.org/news/node-js-server-side-javascript-what-is-node-used-for/",
          "publishedOn": "2022-09-27T21:34:58.000Z",
          "wordCount": 1475,
          "title": "Node.js Server-Side JavaScript – What is Node Used For?",
          "imageUrl": "https://www.freecodecamp.org/news/content/images/2022/09/christina-wocintechchat-com-glRqyWJgUeY-unsplash.jpg"
        },
        {
          "id": "https://www.freecodecamp.org/news/how-to-use-the-cli-beginner-guide/",
          "author": "Maybell Obadoni",
          "description": "There's a lot to learn when you're getting into tech. But fortunately there are some skills that you can use across different programming languages, operating systems, and tools.  And knowing how to use the command line interface (also known as the command prompt or terminal, depending on your operating",
          "link": "https://www.freecodecamp.org/news/how-to-use-the-cli-beginner-guide/",
          "publishedOn": "2022-09-27T21:11:32.000Z",
          "wordCount": 2155,
          "title": "How to Use the Command Line Interface – for Beginners",
          "imageUrl": "https://www.freecodecamp.org/news/content/images/2022/09/BEGINNERS--HACK-ON-USING-CLI--1-.png"
        },
        {
          "id": "https://www.freecodecamp.org/news/debugging-in-python-using-pdb/",
          "author": "Jagruti Tiwari",
          "description": "Debugging tools are at the heart of any programming language. And as a developer, it's hard to make progress and write clean code unless you know your way around these tools. This article will help you get acquainted with one such tool: The Python Debugger (pdb) [https://docs.python.org/3/library/pdb.html#:~:text=The%20module%20pdb%20defines%20an,context%20of%20any%20stack%20frame] Note that this",
          "link": "https://www.freecodecamp.org/news/debugging-in-python-using-pdb/",
          "publishedOn": "2022-09-27T17:50:42.000Z",
          "wordCount": 1512,
          "title": "How to Debug Your Python Code with the Python Debugger (pdb)",
          "imageUrl": "https://www.freecodecamp.org/news/content/images/2022/09/paulius-andriekus-552Vm3_Ah6A-unsplash.jpg"
        },
        {
          "id": "https://www.freecodecamp.org/news/how-to-implement-vertical-scrolling-in-react-using-react-router-hash-link/",
          "author": "Edeh Israel Chidera",
          "description": "Smooth scrolling is a feature that makes webpages more usable and allows for a better user scrolling experience in most browsers. Implementing a smooth page scroll while using react-router-dom has been a problem in React.js. So this article, you are going to learn how to implement smooth vertical scrolling using",
          "link": "https://www.freecodecamp.org/news/how-to-implement-vertical-scrolling-in-react-using-react-router-hash-link/",
          "publishedOn": "2022-09-27T17:42:42.000Z",
          "wordCount": 1278,
          "title": "How to Implement Vertical Scrolling in React Using react-router-hash-link",
          "imageUrl": "https://www.freecodecamp.org/news/content/images/2022/09/ferenc-almasi-L8KQIPCODV8-unsplash.jpeg"
        },
        {
          "id": "https://www.freecodecamp.org/news/what-is-information-systems-definition-for-beginners/",
          "author": "Kolade Chris",
          "description": "You may have heard the term \"information systems\" as a type of degree some people get from a college or university. Or maybe you've heard it as a general term used to describe information and communication systems in general. Information systems are more than a degree or a general term.",
          "link": "https://www.freecodecamp.org/news/what-is-information-systems-definition-for-beginners/",
          "publishedOn": "2022-09-27T16:43:54.000Z",
          "wordCount": 1619,
          "title": "What is Information Systems? Definition for Beginners",
          "imageUrl": "https://www.freecodecamp.org/news/content/images/2022/09/christopher-gower-m_HRfLhgABo-unsplash.jpg"
        },
        {
          "id": "https://www.freecodecamp.org/news/learn-java-programming/",
          "author": "Beau Carnes",
          "description": "Java has been one of the most popular programming languages for a long time. It is considered a general-purpose, concurrent, strongly typed, class-based object-oriented language. We just published a full course on the freeCodeCamp.org YouTube channel that will teach you the Java programming language. This course is perfect for beginners.",
          "link": "https://www.freecodecamp.org/news/learn-java-programming/",
          "publishedOn": "2022-09-27T13:37:06.000Z",
          "wordCount": 815,
          "title": "Learn Java Programming (version 17)",
          "imageUrl": "https://www.freecodecamp.org/news/content/images/2022/09/java.png"
        },
        {
          "id": "https://www.freecodecamp.org/news/linux-basics/",
          "author": "Daniel Iwugo",
          "description": "Time to learn how to use the operating system of the average hacker 🐧. In this article, we will take a little tour of:  * The Linux operating system  * Package management  * The Linux file structure  * The Command Line Interface And you get to",
          "link": "https://www.freecodecamp.org/news/linux-basics/",
          "publishedOn": "2022-09-26T23:20:22.000Z",
          "wordCount": 4025,
          "title": "Linux for Hackers – Basics for Cybersecurity Beginners",
          "imageUrl": "https://www.freecodecamp.org/news/content/images/2022/09/linux-basics-for-hackers.jpeg"
        },
        {
          "id": "https://www.freecodecamp.org/news/how-to-loop-through-an-array-with-for-loop-in-javascript/",
          "author": "Dennis Temoye Charity",
          "description": "A loop is an instruction in computer programming that allows an application to repeat a process until a specific condition is met. For example, say you want to run through a list of names and output each name on your screen. If you didn't use a loop, you'd end up",
          "link": "https://www.freecodecamp.org/news/how-to-loop-through-an-array-with-for-loop-in-javascript/",
          "publishedOn": "2022-09-26T23:14:42.000Z",
          "wordCount": 1364,
          "title": "JavaScript For loop – How to Loop Through an Array in JS",
          "imageUrl": "https://www.freecodecamp.org/news/content/images/2022/09/1_9H5rmyp3MgrcA8i1emsJPg.jpeg"
        },
        {
          "id": "https://www.freecodecamp.org/news/iteration-in-golang/",
          "author": "Ubaydah Abdulwasiu",
          "description": "In programming, iteration (commonly known as looping) is a process where a step is repeated n number of times until a specific condition is met. Just like every other programming language, Golang has a way of iterating through different data structures and data types like structs, maps, arrays, strings, and",
          "link": "https://www.freecodecamp.org/news/iteration-in-golang/",
          "publishedOn": "2022-09-26T22:44:22.000Z",
          "wordCount": 2082,
          "title": "Iteration in Golang – How to Loop Through Data Structures in Go",
          "imageUrl": "https://www.freecodecamp.org/news/content/images/2022/09/How-to-perform-iteration-in-Golang-1.png"
        },
        {
          "id": "https://www.freecodecamp.org/news/how-to-create-serverless-logic-with-azure-functions/",
          "author": "Salim Oyinlola",
          "description": "What is Serverless Computing? You can think of serverless computing as a function as a service, or a microservice that is hosted on a cloud platform.  In this setup, your business logic runs as functions, and you do not have to manually create or scale infrastructure. The cloud platform",
          "link": "https://www.freecodecamp.org/news/how-to-create-serverless-logic-with-azure-functions/",
          "publishedOn": "2022-09-26T22:35:00.000Z",
          "wordCount": 2248,
          "title": "How to Create Serverless Logic with Azure Functions",
          "imageUrl": "https://www.freecodecamp.org/news/content/images/2022/09/QWERTYUIOP.png"
        },
        {
          "id": "https://www.freecodecamp.org/news/javascript-concepts-you-should-know-before-learning-react/",
          "author": "Ashutosh Mishra",
          "description": "React is one of the most popular JavaScript frameworks for building single page applications. Needless to say, as a JavaScript framework, it requires you to have a good knowledge of JavaScript concepts. In this article, we are going to take a look at some of those JavaScript concepts that you",
          "link": "https://www.freecodecamp.org/news/javascript-concepts-you-should-know-before-learning-react/",
          "publishedOn": "2022-09-26T19:22:52.000Z",
          "wordCount": 2533,
          "title": "The JavaScript Concepts You Should Know Before Learning React",
          "imageUrl": "https://www.freecodecamp.org/news/content/images/2022/09/pexels-pixabay-417173--1-.jpg"
        },
        {
          "id": "https://www.freecodecamp.org/news/machine-learning-for-everybody/",
          "author": "Beau Carnes",
          "description": "Machine learning technology is now so common that you probably use it dozens of times a day without even realizing it. And since it has so many applications, the job prospects are great for anyone with a lot of machine learning experience. We just released a machine learning course on",
          "link": "https://www.freecodecamp.org/news/machine-learning-for-everybody/",
          "publishedOn": "2022-09-26T17:28:23.000Z",
          "wordCount": 848,
          "title": "Machine Learning for Everybody",
          "imageUrl": "https://www.freecodecamp.org/news/content/images/2022/09/machinelearning.png"
        },
        {
          "id": "https://www.freecodecamp.org/news/html-drop-down-menu-how-to-add-a-drop-down-list-with-the-select-element/",
          "author": "Joel Olawanle",
          "description": "Many websites, applications, and web pages use drop-down menus to help display a list of information. You can use them to create navigation menus, options for forms, and more. If you're looking at some of these menus or lists, you might imagine how complex creating them could be. And yes",
          "link": "https://www.freecodecamp.org/news/html-drop-down-menu-how-to-add-a-drop-down-list-with-the-select-element/",
          "publishedOn": "2022-09-26T14:25:06.000Z",
          "wordCount": 1500,
          "title": "HTML Drop-down Menu – How to Add a Drop-Down List with the Select Element",
          "imageUrl": "https://www.freecodecamp.org/news/content/images/2022/09/cover-template--9-.png"
        },
        {
          "id": "https://www.freecodecamp.org/news/introduction-to-git-and-github/",
          "author": "Segun Ajibola",
          "description": "Git and GitHub are common tools used in programming. They help you manage different versions of your code and collaborate with other developers. Building projects is one of the core parts of being a developer. And Git and GitHub are essential tools you'll use when building projects with others. But",
          "link": "https://www.freecodecamp.org/news/introduction-to-git-and-github/",
          "publishedOn": "2022-09-26T05:23:00.000Z",
          "wordCount": 2199,
          "title": "How to Use Git and GitHub – Introduction for Beginners",
          "imageUrl": "https://www.freecodecamp.org/news/content/images/2022/09/Untitled-design--6-.png"
        },
        {
          "id": "https://www.freecodecamp.org/news/html-background-image-how-to-add-wallpaper-images-to-your-website/",
          "author": "Ihechikara Vincent Abba",
          "description": "Background images can help beautify websites and make them more attractive to users.  In this article, you'll learn:   * How to add a background image to your website using the CSS background-image     property.   * Other CSS background properties for images. How",
          "link": "https://www.freecodecamp.org/news/html-background-image-how-to-add-wallpaper-images-to-your-website/",
          "publishedOn": "2022-09-23T19:18:19.000Z",
          "wordCount": 1202,
          "title": "HTML Background Image – How to Add Wallpaper Images to Your Website",
          "imageUrl": "https://www.freecodecamp.org/news/content/images/2022/09/jonatan-pie-3l3RwQdHRHg-unsplash.jpg"
        },
        {
          "id": "https://www.freecodecamp.org/news/how-to-use-surrealdb-with-fresh-framework/",
          "author": "Rajdeep Singh",
          "description": "SurrealDB is a newly launched database that has recently started gaining popularity in the programming world. SurrealDB was built with the Rust language and was created by Tobie Morgan Hitchcock [https://www.linkedin.com/in/tobiemorganhitchcock/] and Jaime Morgan Hitchcock [https://www.linkedin.com/in/jaimemorganhitchcock/]. SurrealDB's new database comes with many features, but I'm most interested in the Deno",
          "link": "https://www.freecodecamp.org/news/how-to-use-surrealdb-with-fresh-framework/",
          "publishedOn": "2022-09-23T17:51:53.000Z",
          "wordCount": 3329,
          "title": "How to Use SurrealDb with the Fresh Framework and Deno",
          "imageUrl": "https://www.freecodecamp.org/news/content/images/2022/09/Surreal-DB--and-deno-fresh-CMS--4-.png"
        },
        {
          "id": "https://www.freecodecamp.org/news/how-to-sort-recursively-in-python/",
          "author": "P S Mohammed Ali",
          "description": "When you want to sort a list or array in Python, there are many sorting algorithms you can use.  Some use looping concepts like Insertion Sort, Bubble Sort, and Selection Sort. On the other hand, you can also sort the same list or array using Merge Sort with the",
          "link": "https://www.freecodecamp.org/news/how-to-sort-recursively-in-python/",
          "publishedOn": "2022-09-23T14:35:00.000Z",
          "wordCount": 2092,
          "title": "How to Sort a List Recursively in Python",
          "imageUrl": "https://www.freecodecamp.org/news/content/images/2022/09/max-harlynking-_QcLpud-gD0-unsplash-1.jpg"
        },
        {
          "id": "https://www.freecodecamp.org/news/introduction-to-linked-lists-in-python/",
          "author": "Fakorede Damilola",
          "description": "Different programming languages offer different ways to store and access data. Some of the data structures you can use are collections such as arrays, lists, maps, sets, and so on.  These all do an awesome job storing and accessing data, but sometimes you might need something different. Another data",
          "link": "https://www.freecodecamp.org/news/introduction-to-linked-lists-in-python/",
          "publishedOn": "2022-09-22T16:08:05.000Z",
          "wordCount": 2377,
          "title": "Linked Lists in Python – Explained with Examples",
          "imageUrl": "https://www.freecodecamp.org/news/content/images/2022/09/chain-3481377_1280.jpg"
        },
        {
          "id": "https://www.freecodecamp.org/news/how-to-align-text-in-html/",
          "author": "Joel Olawanle",
          "description": "Text is essential on web pages, as it tells your users what your web page is all about. When you add text to your web page, it dictates the direction and feel of your web page based on your language. For example, by default, English moves from left to right",
          "link": "https://www.freecodecamp.org/news/how-to-align-text-in-html/",
          "publishedOn": "2022-09-22T16:02:44.000Z",
          "wordCount": 1969,
          "title": "How to Align Text in HTML – Text-align, Center, and Justified Example",
          "imageUrl": "https://www.freecodecamp.org/news/content/images/2022/09/cover-template--8-.png"
        },
        {
          "id": "https://www.freecodecamp.org/news/what-is-hacking/",
          "author": "Daniel Iwugo",
          "description": "Time to learn the basics of the splendid art of hacking 👨‍💻👩‍💻.  In this article, you will learn what the hacking process really looks like. And hopefully one day, you'll get to say those famous words: “I’m in”. Disclaimer: This is for educational purposes only. Please (with a cherry",
          "link": "https://www.freecodecamp.org/news/what-is-hacking/",
          "publishedOn": "2022-09-22T15:21:49.000Z",
          "wordCount": 2094,
          "title": "What is Hacking? The Hacker Methodology Explained",
          "imageUrl": "https://www.freecodecamp.org/news/content/images/2022/09/hacker-methodology-image.jpeg"
        },
        {
          "id": "https://www.freecodecamp.org/news/intro-to-algorithms-with-python/",
          "author": "Beau Carnes",
          "description": "Understanding algorithms in an important skill for many computer science jobs. Algorithms help us solve problems efficiently. We just published an introduction to algorithms with Python course on the freeCodeCamp.org YouTube channel. In this course, you'll work with algorithm basics like recursion then go all the way to working with",
          "link": "https://www.freecodecamp.org/news/intro-to-algorithms-with-python/",
          "publishedOn": "2022-09-22T14:36:57.000Z",
          "wordCount": 969,
          "title": "Intro to Algorithms with Python",
          "imageUrl": "https://www.freecodecamp.org/news/content/images/2022/09/algos_python.png"
        },
        {
          "id": "https://www.freecodecamp.org/news/css-combinators-to-select-elements/",
          "author": "Dillion Megida",
          "description": "Combinators allow you to combine multiple selectors to target specific elements in the DOM. In this article, I'll explain how four of these combinators with examples. In my previous post on CSS Selector Types [/news/how-to-select-elements-to-style-in-css/], I shared seven types of selectors for targetting elements that you want to style. If",
          "link": "https://www.freecodecamp.org/news/css-combinators-to-select-elements/",
          "publishedOn": "2022-09-21T23:17:05.000Z",
          "wordCount": 1742,
          "title": "How to Use CSS Combinators to Select and Style Elements",
          "imageUrl": "https://www.freecodecamp.org/news/content/images/2022/09/css-combinations.png"
        },
        {
          "id": "https://www.freecodecamp.org/news/git-remove-last-commit-how-to-undo-a-commit-in-git/",
          "author": "Dionysia Lemonaki",
          "description": "Git is a powerful tool and the most popular version control system. It is how developers and technical teams collaborate and work together on projects. But what happens when you accidentally commit a file and realize that you shouldn't have done that because that file contains an error? There is",
          "link": "https://www.freecodecamp.org/news/git-remove-last-commit-how-to-undo-a-commit-in-git/",
          "publishedOn": "2022-09-21T17:42:10.000Z",
          "wordCount": 2004,
          "title": "Git Remove Last Commit – How to Undo a Commit in Git",
          "imageUrl": "https://www.freecodecamp.org/news/content/images/2022/09/pexels-andrew-neel-2312369.jpg"
        },
        {
          "id": "https://www.freecodecamp.org/news/generic-pnp-monitor-how-to-fix-windows-10-pc-device-driver/",
          "author": "Kolade Chris",
          "description": "Have you acquired a new monitor only to find out it's not displaying anything from your computer? Or maybe the monitor suddenly stops working? On many occasions, this problem is caused by a faulty generic PNP monitor driver. Apart from driver issues, the monitor might not be working due to",
          "link": "https://www.freecodecamp.org/news/generic-pnp-monitor-how-to-fix-windows-10-pc-device-driver/",
          "publishedOn": "2022-09-21T16:18:08.000Z",
          "wordCount": 1295,
          "title": "Generic PNP Monitor – How to Fix Windows 10 PC Device Driver",
          "imageUrl": "https://www.freecodecamp.org/news/content/images/2022/09/monitor-1307227_1280.jpg"
        },
        {
          "id": "https://www.freecodecamp.org/news/software-testing-beginners-guide/",
          "author": "Sophia Iroegbu",
          "description": "Software testing is essential to development. It saves you time and money in production mode.  But software testing is a complex topic and can be a bit difficult to understand. In this article, I'll explain the major topics in software testing and how this practice can help you.",
          "link": "https://www.freecodecamp.org/news/software-testing-beginners-guide/",
          "publishedOn": "2022-09-21T16:03:49.000Z",
          "wordCount": 2614,
          "title": "What is Software Testing? A Beginner's Guide",
          "imageUrl": "https://www.freecodecamp.org/news/content/images/2022/09/Tech-Blog-Cover--4-.png"
        },
        {
          "id": "https://www.freecodecamp.org/news/near-curriculum/",
          "author": "Tom Mondloch",
          "description": "Over the past 9 months, several of our instructors have been hard at work on a comprehensive NEAR curriculum. This will focus on NEAR's blockchain protocol and the NEAR tool ecosystem. This curriculum is made possible by NEAR Foundation, who gave our charity a grant to 100% fund development of",
          "link": "https://www.freecodecamp.org/news/near-curriculum/",
          "publishedOn": "2022-09-21T15:10:19.000Z",
          "wordCount": 1186,
          "title": "freeCodeCamp is Building a NEAR Curriculum",
          "imageUrl": "https://www.freecodecamp.org/news/content/images/2022/09/joshua-newton-IRXYNAMlUtw-unsplash-1.jpg"
        },
        {
          "id": "https://www.freecodecamp.org/news/solana-curriculum/",
          "author": "Tom Mondloch",
          "description": "Over the past 9 months, we've made considerable progress on our Solana curriculum. This will focus on Solana's blockchain protocol and the Solana tool ecosystem. This curriculum is made possible by The Solana Foundation, who gave our charity a grant to 100% fund development of this curriculum. What will this",
          "link": "https://www.freecodecamp.org/news/solana-curriculum/",
          "publishedOn": "2022-09-21T15:00:18.000Z",
          "wordCount": 1184,
          "title": "freeCodeCamp is Building a Solana Curriculum",
          "imageUrl": "https://www.freecodecamp.org/news/content/images/2022/09/arturo-castaneyra-7laIG_Xv5FI-unsplash.jpg"
        },
        {
          "id": "https://www.freecodecamp.org/news/web3-curriculum-open-beta/",
          "author": "Tom Mondloch",
          "description": "Over the past 11 months, we've made considerable progress on our Web3 curriculum. Today I'm thrilled to say that parts of this curriculum are now in open beta. You can try them today. Before we get into the details, I want to thank the KaijuKingz community, who made a donation",
          "link": "https://www.freecodecamp.org/news/web3-curriculum-open-beta/",
          "publishedOn": "2022-09-21T14:45:56.000Z",
          "wordCount": 1454,
          "title": "freeCodeCamp's Web3 Curriculum Open Beta – And How to Run it",
          "imageUrl": "https://www.freecodecamp.org/news/content/images/2022/09/thomas-habr-wprOCzLIEYI-unsplash.jpg"
        },
        {
          "id": "https://www.freecodecamp.org/news/how-to-use-props-in-reactjs/",
          "author": "Joy O. Oluwafemi",
          "description": "Props are an important concept to understand in React. You use props to pass data and values from one component to another to get dynamic and unique outputs.  Websites built with React like Facebook, Twitter, and Netflix use the same design patterns across many sections that just have different",
          "link": "https://www.freecodecamp.org/news/how-to-use-props-in-reactjs/",
          "publishedOn": "2022-09-20T20:16:27.000Z",
          "wordCount": 2096,
          "title": "How to Use Props in React.js",
          "imageUrl": "https://www.freecodecamp.org/news/content/images/2022/09/Blue-and-Black-Graphic-Dynamic-Sports-Football-Team-Flyer-2.png"
        },
        {
          "id": "https://www.freecodecamp.org/news/python-datetime-now-how-to-get-todays-date-and-time/",
          "author": "Ihechikara Vincent Abba",
          "description": "You can use the datetime module in Python to retrieve data about date and time.  In this article, you'll learn how to use the datetime object from the datetime  module to get the current date and time properties. You'll also learn how to get the date and time",
          "link": "https://www.freecodecamp.org/news/python-datetime-now-how-to-get-todays-date-and-time/",
          "publishedOn": "2022-09-20T20:12:09.000Z",
          "wordCount": 1232,
          "title": "Python Datetime.now() – How to Get Today's Date and Time",
          "imageUrl": "https://www.freecodecamp.org/news/content/images/2022/09/kevin-ku-aiyBwbrWWlo-unsplash.jpg"
        },
        {
          "id": "https://www.freecodecamp.org/news/code-a-minecraft-clone-using-react-and-three-js/",
          "author": "Beau Carnes",
          "description": "It may not be possible to code a Minecraft clone in 30 seconds [https://www.youtube.com/watch?v=MAlSjtxy5ak], but you can definitely create one in under two hours. We just published a course on the freeCodeCamp.org YouTube channel that will teach you how to create a fully-functional Minecraft clone using React, JavaScript, and Three.js.",
          "link": "https://www.freecodecamp.org/news/code-a-minecraft-clone-using-react-and-three-js/",
          "publishedOn": "2022-09-20T19:36:37.000Z",
          "wordCount": 834,
          "title": "Code a Minecraft Clone Using React and Three.js",
          "imageUrl": "https://www.freecodecamp.org/news/content/images/2022/09/minecraftclone2.png"
        },
        {
          "id": "https://www.freecodecamp.org/news/configure-metadata-in-single-page-applications/",
          "author": "Scott Gary",
          "description": "Why Metadata Matters Metadata is an integral part of any modern web app, because it's inherently tethered to search engine optimization (SEO).  Search engines and their respective results page (SERPS) rely on metadata to properly index and display relative information for each site. Also, meta tags are relied upon",
          "link": "https://www.freecodecamp.org/news/configure-metadata-in-single-page-applications/",
          "publishedOn": "2022-09-20T17:20:15.000Z",
          "wordCount": 2238,
          "title": "How to Configure Metadata for a Single-Page Application",
          "imageUrl": "https://www.freecodecamp.org/news/content/images/2022/09/meta-data-for-spa-seo.jpg"
        },
        {
          "id": "https://www.freecodecamp.org/news/how-to-write-a-good-technical-tutorial/",
          "author": "Avdhoot Fulsundar",
          "description": "If you are a software developer, then you know how often you search Google to help you solve specific problems when you're coding. Every developer looks at online tutorials to solve the problems they have. To help you solve your problem, these tutorials should have a few things that make",
          "link": "https://www.freecodecamp.org/news/how-to-write-a-good-technical-tutorial/",
          "publishedOn": "2022-09-20T16:59:19.000Z",
          "wordCount": 1456,
          "title": "How to write a Good Technical Tutorial",
          "imageUrl": "https://www.freecodecamp.org/news/content/images/2022/09/Gradient-Modern-Digital-Marketing-Facebook-Cover--14-.png"
        },
        {
          "id": "https://www.freecodecamp.org/news/why-developers-should-have-a-youtube-channel/",
          "author": "Nishant Kumar",
          "description": "If you're a software developer, chances are you'll be learning constantly. There is a famous quote that says, > “Forget about the kids, fathers are still learning”. This couldn't be more true in the case of coding. You constantly need to learn, develop, and upgrade your skills. And what is",
          "link": "https://www.freecodecamp.org/news/why-developers-should-have-a-youtube-channel/",
          "publishedOn": "2022-09-20T16:14:20.000Z",
          "wordCount": 2012,
          "title": "Why Developers Should Have a YouTube Channel",
          "imageUrl": "https://www.freecodecamp.org/news/content/images/2022/09/Why-developers-should-have-a--1-.png"
        },
        {
          "id": "https://www.freecodecamp.org/news/react-passport-authentication/",
          "author": "Reed Barger",
          "description": "Authentication is a major part of any serious React application. You need to have a good and reliable way to authenticate your users in your developer tool belt. There are dozens of authentication solutions to choose from today, many of which come with a price tag. Which one should you",
          "link": "https://www.freecodecamp.org/news/react-passport-authentication/",
          "publishedOn": "2022-09-19T22:29:44.000Z",
          "wordCount": 2453,
          "title": "How to Authenticate Your React App with Passport.js",
          "imageUrl": "https://www.freecodecamp.org/news/content/images/2022/09/passport-react.png"
        },
        {
          "id": "https://www.freecodecamp.org/news/how-to-select-elements-to-style-in-css/",
          "author": "Dillion Megida",
          "description": "When you want to style an element with CSS, you first have to \"select\" it. In this article, I'll show you seven (7) ways in which you can do that. Here's the syntax for styling elements in CSS: selector {   /* styles here */ } You have the",
          "link": "https://www.freecodecamp.org/news/how-to-select-elements-to-style-in-css/",
          "publishedOn": "2022-09-19T22:01:13.000Z",
          "wordCount": 2121,
          "title": "CSS Selector Types – How to Select Elements to Style in CSS",
          "imageUrl": "https://www.freecodecamp.org/news/content/images/2022/09/css-selector-types.png"
        },
        {
          "id": "https://www.freecodecamp.org/news/install-openjdk-free-java-multi-os-guide/",
          "author": "Otavio Ehrenberger",
          "description": "In a nutshell, there are two coexisting branches of Java: the proprietary, closed-source Oracle Java and the community-maintained open-source OpenJDK [https://github.com/openjdk/jdk]. OpenJDK is licensed under GPL-2.0 [https://github.com/openjdk/jdk/blob/master/LICENSE], and it consists of a Java Virtual Machine and a java-bytecode compiler. Since this is the easier and cheaper way, it's the one",
          "link": "https://www.freecodecamp.org/news/install-openjdk-free-java-multi-os-guide/",
          "publishedOn": "2022-09-19T20:52:44.000Z",
          "wordCount": 1565,
          "title": "How to Install OpenJDK (Free Java) – Multi OS Guide",
          "imageUrl": "https://www.freecodecamp.org/news/content/images/2022/09/pexels-simon-berger-1323550.jpg"
        },
        {
          "id": "https://www.freecodecamp.org/news/how-to-do-test-driven-development-with-svelte-and-vitest/",
          "author": "Sriram Thiagarajan",
          "description": "Test Driven Development (TDD) is one of the best ways to make sure your code is high quality and works like it's supposed to work. It can also help you create reliable builds during continuous deployments.  In this post, we will learn how to create a Svelte application using",
          "link": "https://www.freecodecamp.org/news/how-to-do-test-driven-development-with-svelte-and-vitest/",
          "publishedOn": "2022-09-19T17:20:38.000Z",
          "wordCount": 3497,
          "title": "How to Do Test-Driven Development with Svelte and Vitest – A Project-Based Tutorial",
          "imageUrl": "https://www.freecodecamp.org/news/content/images/2022/09/SvelteVitestTDDPoster.png"
        }
      ]
    }
  ],
  "cliVersion": "1.15.1"
}